
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>数据库中间件详解 | 珍藏版 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-emphasize/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="002.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    分库分表
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.1" data-path="001.html">
            
                <a href="001.html">
            
                    
                    MySQL数据库之互联网常用分库分表方案
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.2" data-path="002.html">
            
                <a href="002.html">
            
                    
                    一文读懂分库分表的技术演进（最佳实践）
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.1.3" data-path="003.html">
            
                <a href="003.html">
            
                    
                    数据库中间件详解 | 珍藏版
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >数据库中间件详解 | 珍藏版</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x8BE6;&#x89E3;--&#x73CD;&#x85CF;&#x7248;">&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x8BE6;&#x89E3; | &#x73CD;&#x85CF;&#x7248;</h1>
<h2 id="1-&#x6570;&#x636E;&#x5E93;&#x62C6;&#x5206;&#x8FC7;&#x7A0B;&#x53CA;&#x6311;&#x6218;">1. &#x6570;&#x636E;&#x5E93;&#x62C6;&#x5206;&#x8FC7;&#x7A0B;&#x53CA;&#x6311;&#x6218;</h2>
<p>&#x4E92;&#x8054;&#x7F51;&#x5F53;&#x4E0B;&#x7684;&#x6570;&#x636E;&#x5E93;&#x62C6;&#x5206;&#x8FC7;&#x7A0B;&#x57FA;&#x672C;&#x9075;&#x5FAA;&#x7684;&#x987A;&#x5E8F;&#x662F;&#xFF1A;<strong>&#x5782;&#x76F4;&#x62C6;&#x5206;</strong>&#x3001;<strong>&#x8BFB;&#x5199;&#x5206;&#x79BB;</strong>&#x3001;<strong>&#x5206;&#x5E93;&#x5206;&#x8868;(&#x6C34;&#x5E73;&#x62C6;&#x5206;)</strong>&#x3002;&#x6BCF;&#x4E2A;&#x62C6;&#x5206;&#x8FC7;&#x7A0B;&#x90FD;&#x80FD;&#x89E3;&#x51B3;&#x4E1A;&#x52A1;&#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#x4E5F;&#x9762;&#x4E34;&#x4E86;&#x4E00;&#x4E9B;&#x6311;&#x6218;&#x3002; </p>
<h3 id="11-&#x5782;&#x76F4;&#x62C6;&#x5206;">1.1 &#x5782;&#x76F4;&#x62C6;&#x5206;</h3>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x521A;&#x4E0A;&#x7EBF;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x9879;&#x76EE;&#x6765;&#x8BF4;&#xFF0C;&#x7531;&#x4E8E;&#x524D;&#x671F;&#x6D3B;&#x8DC3;&#x7528;&#x6237;&#x6570;&#x91CF;&#x5E76;&#x4E0D;&#x591A;&#xFF0C;&#x5E76;&#x53D1;&#x91CF;&#x4E5F;&#x76F8;&#x5BF9;&#x8F83;&#x5C0F;&#xFF0C;&#x6240;&#x4EE5;&#x6B64;&#x65F6;&#x4F01;&#x4E1A;&#x4E00;&#x822C;&#x90FD;&#x4F1A;&#x9009;&#x62E9;&#x5C06;&#x6240;&#x6709;&#x6570;&#x636E;&#x5B58;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93; &#x4E2D;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#x64CD;&#x4F5C;&#x3002;&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7535;&#x5546;&#x7CFB;&#x7EDF;&#xFF0C;&#x5176;&#x7528;&#x6237;&#x6A21;&#x5757;&#x548C;&#x4EA7;&#x54C1;&#x6A21;&#x5757;&#x7684;&#x8868;&#x521A;&#x5F00;&#x59CB;&#x90FD;&#x662F;&#x4F4D;&#x4E8E;&#x4E00;&#x4E2A;&#x5E93;&#x4E2D;&#x3002;</p>
<p><img src="../assets/1023.png" alt=""></p>
<p>&#x5176;&#x4E2D;&#xFF1A;user&#x3001;useraccount&#x8868;&#x5C5E;&#x4E8E;&#x7528;&#x6237;&#x6A21;&#x5757;&#xFF0C;productcategory&#x3001;product&#x8868;&#x5C5E;&#x4E8E;&#x4EA7;&#x54C1;&#x6A21;&#x5757;</p>
<p>&#x521A;&#x5F00;&#x59CB;&#xFF0C;&#x53EF;&#x80FD;&#x516C;&#x53F8;&#x7684;&#x6280;&#x672F;&#x56E2;&#x961F;&#x89C4;&#x6A21;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x90FD;&#x4F4D;&#x4E8E;&#x4E00;&#x4E2A;&#x5E93;&#x4E2D;&#x3002;&#x968F;&#x7740;&#x516C;&#x53F8;&#x4E1A;&#x52A1;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x6280;&#x672F;&#x56E2;&#x961F;&#x4EBA;&#x5458;&#x4E5F;&#x5F97;&#x5230;&#x4E86;&#x6269;&#x5F20;&#xFF0C;&#x5212;&#x5206;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x6280;&#x672F;&#x5C0F;&#x7EC4;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5C0F;&#x7EC4;&#x8D1F;&#x8D23;&#x4E0D;&#x540C;&#x7684;&#x4E1A;&#x52A1;&#x6A21;&#x5757;&#x3002;&#x4F8B;&#x5982;A&#x5C0F;&#x7EC4;&#x8D1F;&#x8D23;&#x7528;&#x6237;&#x6A21;&#x5757;&#xFF0C;B&#x5C0F;&#x7EC4;&#x8D1F;&#x8D23;&#x4EA7;&#x54C1;&#x6A21;&#x5757;&#x3002;&#x6B64;&#x65F6;&#x6570;&#x636E;&#x5E93;&#x4E5F;&#x8FCE;&#x6765;&#x4E86;&#x7B2C;&#x4E00;&#x6B21;&#x62C6;&#x5206;&#xFF1A;&#x5782;&#x76F4;&#x62C6;&#x5206;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x7684;&#x5782;&#x76F4;&#x62C6;&#x5206;&#xFF0C;&#x6307;&#x7684;&#x662F;&#x5C06;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E86;&#x5F88;&#x591A;&#x8868;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6839;&#x636E;&#x8868;&#x7684;&#x529F;&#x80FD;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x62C6;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6BCF;&#x4E2A;&#x5E93;&#x5305;&#x542B;&#x90E8;&#x5206;&#x8868;&#x3002;&#x4E0B;&#x56FE;&#x6F14;&#x793A;&#x5C06;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;db_eshop&#x5E93;&#xFF0C;&#x62C6;&#x5206;&#x4E3A;db_user&#x5E93;&#x548C;db_product&#x5E93;&#x3002;</p>
<p><img src="../assets/1024.png" alt=""></p>
<p>&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x5782;&#x76F4;&#x62C6;&#x5206;&#xFF0C;&#x90FD;&#x662F;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x6765;&#x5BF9;&#x4E00;&#x4E2A;&#x5E93;&#x4E2D;&#x7684;&#x8868;&#x8FDB;&#x884C;&#x62C6;&#x5206;&#x7684;&#x3002;&#x5173;&#x4E8E;&#x5782;&#x76F4;&#x62C6;&#x5206;&#xFF0C;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x5C06;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E86;&#x5F88;&#x591A;&#x5B57;&#x6BB5;&#x7684;&#x5927;&#x8868;&#x62C6;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x5C0F;&#x8868;&#xFF0C;&#x6BCF;&#x4E2A;&#x8868;&#x5305;&#x542B;&#x90E8;&#x5206;&#x5B57;&#x6BB5;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5728;&#x5B9E;&#x9645;&#x5F00;&#x53D1;&#x4E2D;&#x57FA;&#x672C;&#x5F88;&#x5C11;&#x9047;&#x5230;&#x3002;</p>
<p>&#x5782;&#x76F4;&#x62C6;&#x5206;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x5E94;&#x7528;&#x573A;&#x666F;&#x662F;&#x670D;&#x52A1;&#x5316;(SOA)&#x6539;&#x9020;&#x3002;&#x5728;&#x670D;&#x52A1;&#x5316;&#x7684;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x9664;&#x4E86;&#x4E1A;&#x52A1;&#x4E0A;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x62C6;&#x5206;&#xFF0C;&#x5E95;&#x5C42;&#x7684;&#x5B58;&#x50A8;&#x4E5F;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x9694;&#x79BB;&#x3002; &#x5782;&#x76F4;&#x62C6;&#x5206;&#x4F1A;&#x4F7F;&#x5F97;&#x5355;&#x4E2A;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x53D8;&#x957F;&#xFF0C;&#x539F;&#x56E0;&#x5728;&#x4E8E;&#xFF0C;&#x5728;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x7684;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x4E1A;&#x52A1;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5185;&#x90E8;&#x5B8C;&#x6210;&#xFF0C;&#x800C;&#x5782;&#x76F4;&#x62C6;&#x5206;&#x4E4B;&#x540E;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x9700;&#x8981;&#x8FDB;&#x884C;RPC&#x8C03;&#x7528;&#x3002;&#x7136;&#x540E;&#x867D;&#x7136;&#x5355;&#x4E2A;&#x8BF7;&#x6C42;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x589E;&#x52A0;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6574;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x541E;&#x5410;&#x91CF;&#x786E;&#x4F1A;&#x5927;&#x5927;&#x7684;&#x589E;&#x52A0;&#x3002;</p>
<h3 id="12-&#x8BFB;&#x5199;&#x5206;&#x79BB;">1.2 &#x8BFB;&#x5199;&#x5206;&#x79BB;</h3>
<p>&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x7684;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#xFF0C;&#x7528;&#x6237;&#x6570;&#x91CF;&#x548C;&#x5E76;&#x53D1;&#x91CF;&#x4E0D;&#x65AD;&#x4E0A;&#x5347;&#x3002;&#x8FD9;&#x65F6;&#x5982;&#x679C;&#x4EC5;&#x9760;&#x5355;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x4F8B;&#x6765;&#x652F;&#x6491;&#x6240;&#x6709;&#x8BBF;&#x95EE;&#x538B;&#x529B;,&#x51E0;&#x4E4E;&#x662F;&#x5728; &#x81EA;&#x5BFB;&#x6B7B;&#x8DEF; &#x3002;&#x4EE5;&#x4EA7;&#x54C1;&#x5E93;&#x4E3A;&#x4F8B;&#xFF0C;&#x53EF;&#x80FD;&#x5E93;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x51E0;&#x4E07;&#x79CD;&#x5546;&#x54C1;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x5929;&#x65B0;&#x589E;&#x51E0;&#x5341;&#x79CD;&#xFF0C;&#x800C;&#x4EA7;&#x54C1;&#x5E93;&#x6BCF;&#x5929;&#x7684;&#x8BBF;&#x95EE;&#x4E86;&#x53EF;&#x80FD;&#x6709;&#x51E0;&#x4EBF;&#x751A;&#x81F3;&#x51E0;&#x5341;&#x4EBF;&#x6B21;&#x3002;&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x7684;&#x538B;&#x529B;&#x592A;&#x5927;&#xFF0C;&#x5355;&#x53F0;mysql&#x5B9E;&#x4F8B;&#x625B;&#x4E0D;&#x4F4F;&#xFF0C;&#x6B64;&#x65F6;&#x5927;&#x90E8;&#x5206; Mysql DBA &#x5C31;&#x4F1A;&#x5C06;&#x6570;&#x636E;&#x5E93;&#x8BBE;&#x7F6E;&#x6210; &#x8BFB;&#x5199;&#x5206;&#x79BB;&#x72B6;&#x6001; &#x3002;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A; Master &#x8282;&#x70B9;(&#x4E3B;&#x5E93;)&#x5BF9;&#x5E94;&#x591A;&#x4E2A; Salve &#x8282;&#x70B9;(&#x4ECE;&#x5E93;)&#x3002;&#x53EF;&#x4EE5;&#x5C06;slave&#x8282;&#x70B9;&#x7684;&#x6570;&#x636E;&#x7406;&#x89E3;&#x4E3A;master&#x8282;&#x70B9;&#x6570;&#x636E;&#x7684;&#x5168;&#x91CF;&#x5907;&#x4EFD;&#x3002;</p>
<p><img src="../assets/1025.png" alt=""></p>
<p>master&#x8282;&#x70B9;&#x63A5;&#x6536;&#x7528;&#x6237;&#x7684;&#x5199;&#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x5199;&#x5165;&#x5230;&#x672C;&#x5730;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;(binary log)&#x4E2D;&#x3002;slave&#x901A;&#x8FC7;&#x4E00;&#x4E2A;I/O&#x7EBF;&#x7A0B;&#x4E0E;Master&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x53D1;&#x9001;binlog dump&#x6307;&#x4EE4;&#x3002;Master&#x4F1A;&#x5C06;binlog&#x6570;&#x636E;&#x63A8;&#x9001;&#x7ED9;slave&#xFF0C;slave&#x5C06;&#x63A5;&#x6536;&#x5230;&#x7684;binlog&#x4FDD;&#x5B58;&#x5230;&#x672C;&#x5730;&#x7684;&#x4E2D;&#x7EE7;&#x65E5;&#x5FD7;(relay log)&#x4E2D;&#xFF0C;&#x6700;&#x540E;&#xFF0C;slave&#x901A;&#x8FC7;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;SQL thread&#x5E94;&#x7528;&#x672C;&#x5730;&#x7684;relay log&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x540C;&#x6B65;&#x5230;slave&#x5E93;&#x4E2D;&#x3002;</p>
<p>&#x5173;&#x4E8E;mysql&#x4E3B;&#x4ECE;&#x590D;&#x5236;&#xFF0C;&#x5185;&#x90E8;&#x5305;&#x542B;&#x5F88;&#x591A;&#x7EC6;&#x8282;&#x3002;&#x4F8B;&#x5982;binlog &#x683C;&#x5F0F;&#x5206;&#x4E3A;statement&#x3001;row&#x548C;mixed&#xFF0C;binlog&#x540C;&#x6B65;&#x65B9;&#x5F0F;&#x53C8;&#x53EF;&#x4EE5;&#x5212;&#x5206;&#x4E3A;&#xFF1A;&#x5F02;&#x6B65;&#x3001;&#x534A;&#x540C;&#x6B65;&#x548C;&#x540C;&#x6B65;&#x3002;&#x590D;&#x5236;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;binlogFile+position&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;GTID&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;DBA&#x8D1F;&#x8D23;&#x7EF4;&#x62A4;&#x7684;&#xFF0C;&#x4E1A;&#x52A1;RD&#x65E0;&#x611F;&#x77E5;&#x3002;</p>
<blockquote>
<ol>
<li>PM: Product Manager -- &#x4EA7;&#x54C1;&#x7ECF;&#x7406;</li>
<li>RD: Research and Development engineer -- &#x7814;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;</li>
<li>QA: Quality Assurance -- &#x6D4B;&#x8BD5;</li>
<li>OP: Operator -- &#x8FD0;&#x7EF4;</li>
</ol>
</blockquote>
<p>&#x5728;DBA&#x5C06;mysql&#x914D;&#x7F6E;&#x6210;&#x4E3B;&#x4ECE;&#x590D;&#x5236;&#x96C6;&#x7FA4;&#x7684;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x5F00;&#x53D1;&#x540C;&#x5B66;&#x6240;&#x9700;&#x8981;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#xFF1A;&#x5F53;&#x66F4;&#x65B0;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x5C06;&#x6570;&#x636E;&#x5199;&#x5165;master&#x4E3B;&#x5E93;&#xFF0C;&#x4E3B;&#x5E93;&#x5C06;&#x6570;&#x636E;&#x540C;&#x6B65;&#x7ED9;&#x591A;&#x4E2A;slave&#x4ECE;&#x5E93;&#x3002;&#x5F53;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x9009;&#x62E9;&#x67D0;&#x4E2A;slave&#x8282;&#x70B9;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x3002;</p>
<p><img src="../assets/1026.png" alt=""></p>
<h4 id="121-&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x7684;&#x4F18;&#x70B9;">1.2.1 &#x8BFB;&#x5199;&#x5206;&#x79BB;&#x7684;&#x4F18;&#x70B9;</h4>
<p>&#x8FD9;&#x6837;&#x901A;&#x8FC7;&#x914D;&#x7F6E;&#x591A;&#x4E2A;slave&#x8282;&#x70B9;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x7684;&#x907F;&#x514D;&#x8FC7;&#x5927;&#x7684;&#x8BBF;&#x95EE;&#x91CF;&#x5BF9;&#x5355;&#x4E2A;&#x5E93;&#x9020;&#x6210;&#x7684;&#x538B;&#x529B;&#x3002;</p>
<h4 id="122-&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x7684;&#x6311;&#x6218;">1.2.2 &#x8BFB;&#x5199;&#x5206;&#x79BB;&#x7684;&#x6311;&#x6218;</h4>
<p><strong>&#x5BF9;&#x4E8E;DBA&#x800C;&#x8A00;&#xFF0C;&#x591A;&#x4E86;&#x5F88;&#x591A;&#x96C6;&#x7FA4;&#x8FD0;&#x7EF4;&#x5DE5;&#x4F5C;:</strong></p>
<p>&#x4F8B;&#x5982;&#x96C6;&#x7FA4;&#x642D;&#x5EFA;&#x3001;&#x4E3B;&#x4ECE;&#x5207;&#x6362;&#x3001;&#x4ECE;&#x5E93;&#x6269;&#x5BB9;&#x3001;&#x7F29;&#x5BB9;&#x7B49;&#x3002;&#x4F8B;&#x5982;master&#x914D;&#x7F6E;&#x4E86;&#x591A;&#x4E2A;slave&#x8282;&#x70B9;&#xFF0C;&#x5982;&#x679C;&#x5176;&#x4E2D;&#x67D0;&#x4E2A;slave&#x8282;&#x70B9;&#x6302;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x4E4B;&#x540E;&#x7684;&#x8BFB;&#x8BF7;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x7528;&#x5C06;&#x5176;&#x8F6C;&#x53D1;&#x5230;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x7684;slave&#x8282;&#x70B9;&#x4E0A;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x65B0;&#x589E;&#x4E86;slave&#x8282;&#x70B9;&#xFF0C;&#x5E94;&#x7528;&#x4E5F;&#x5E94;&#x8BE5;&#x611F;&#x77E5;&#x5230;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8BFB;&#x8BF7;&#x6C42;&#x8F6C;&#x53D1;&#x5230;&#x65B0;&#x7684;slave&#x8282;&#x70B9;&#x4E0A;&#x3002;</p>
<p><strong>&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x800C;&#x8A00;:</strong></p>
<p>&#x57FA;&#x672C;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x529F;&#x80FD;&#xFF1A;&#x5BF9;sql&#x7C7B;&#x578B;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#xFF0C;&#x5982;&#x679C;&#x662F;select&#x7B49;&#x8BFB;&#x8BF7;&#x6C42;&#xFF0C;&#x5C31;&#x8D70;&#x4ECE;&#x5E93;&#xFF0C;&#x5982;&#x679C;&#x662F;insert&#x3001;update&#x3001;delete&#x7B49;&#x5199;&#x8BF7;&#x6C42;&#xFF0C;&#x5C31;&#x8D70;&#x4E3B;&#x5E93;&#x3002;</p>
<p>&#x4E3B;&#x4ECE;&#x6570;&#x636E;&#x540C;&#x6B65;&#x5EF6;&#x8FDF;&#x95EE;&#x9898;&#xFF1A;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x662F;&#x4ECE;master&#x8282;&#x70B9;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x540C;&#x6B65;&#x7ED9;&#x591A;&#x4E2A;slave&#x8282;&#x70B9;&#xFF0C;&#x56E0;&#x6B64;&#x5FC5;&#x7136;&#x5B58;&#x5728;&#x5EF6;&#x8FDF;&#x3002;&#x56E0;&#x6B64;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x6211;&#x4EEC;&#x5728;master&#x8282;&#x70B9;&#x4E2D;&#x5DF2;&#x7ECF;&#x63D2;&#x5165;&#x4E86;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;slave&#x8282;&#x70B9;&#x5374;&#x8BFB;&#x53D6;&#x4E0D;&#x5230;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#xFF0C;&#x8981;&#x6C42;&#x63D2;&#x5165;&#x540E;&#x5FC5;&#x987B;&#x80FD;&#x8BFB;&#x53D6;&#x5230;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x8BA9;&#x8BFB;&#x8BF7;&#x6C42;&#x4E5F;&#x53EF;&#x4EE5;&#x8D70;&#x4E3B;&#x5E93;&#xFF0C;&#x800C;&#x4E3B;&#x5E93;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x5FC5;&#x7136;&#x662F;&#x6700;&#x65B0;&#x7684;&#x3002;</p>
<p>&#x4E8B;&#x52A1;&#x95EE;&#x9898;&#xFF1A;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#x540C;&#x65F6;&#x5305;&#x542B;&#x4E86;&#x8BFB;&#x8BF7;&#x6C42;(&#x5982;select)&#x548C;&#x5199;&#x8BF7;&#x6C42;(&#x5982;insert)&#xFF0C;&#x5982;&#x679C;&#x8BFB;&#x8BF7;&#x6C42;&#x8D70;&#x4ECE;&#x5E93;&#xFF0C;&#x5199;&#x8BF7;&#x6C42;&#x8D70;&#x4E3B;&#x5E93;&#xFF0C;&#x7531;&#x4E8E;&#x8DE8;&#x4E86;&#x591A;&#x4E2A;&#x5E93;&#xFF0C;&#x90A3;&#x4E48;&#x672C;&#x5730;&#x4E8B;&#x52A1;&#x5DF2;&#x7ECF;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#xFF0C;&#x5C5E;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x7684;&#x8303;&#x7574;&#x3002;&#x800C;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x975E;&#x5E38;&#x590D;&#x6742;&#x4E14;&#x6548;&#x7387;&#x8F83;&#x4F4E;&#x3002;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#xFF0C;&#x76EE;&#x524D;&#x4E3B;&#x6D41;&#x7684;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x6240;&#x6709;sql&#x7EDF;&#x4E00;&#x90FD;&#x8D70;&#x4E3B;&#x5E93;&#xFF0C;&#x7531;&#x4E8E;&#x53EA;&#x6D89;&#x53CA;&#x5230;&#x4E00;&#x4E2A;&#x5E93;&#xFF0C;&#x672C;&#x5730;&#x4E8B;&#x52A1;&#x5C31;&#x53EF;&#x4EE5;&#x641E;&#x5B9A;&#x3002;</p>
<p>&#x611F;&#x77E5;&#x96C6;&#x7FA4;&#x4FE1;&#x606F;&#x53D8;&#x66F4;&#xFF1A;&#x5982;&#x679C;&#x8BBF;&#x95EE;&#x7684;&#x6570;&#x636E;&#x5E93;&#x96C6;&#x7FA4;&#x4FE1;&#x606F;&#x53D8;&#x66F4;&#x4E86;&#xFF0C;&#x4F8B;&#x5982;&#x4E3B;&#x4ECE;&#x5207;&#x6362;&#x4E86;&#xFF0C;&#x5199;&#x6D41;&#x91CF;&#x5C31;&#x8981;&#x5230;&#x65B0;&#x7684;&#x4E3B;&#x5E93;&#x4E0A;&#xFF1B;&#x53C8;&#x4F8B;&#x5982;&#x589E;&#x52A0;&#x4E86;&#x4ECE;&#x5E93;&#x6570;&#x91CF;&#xFF0C;&#x6D41;&#x91CF;&#x9700;&#x8981;&#x53EF;&#x4EE5;&#x6253;&#x5230;&#x65B0;&#x7684;&#x4ECE;&#x5E93;&#x4E0A;&#xFF1B;&#x53C8;&#x6216;&#x8005;&#x67D0;&#x4E2A;&#x4ECE;&#x5E93;&#x5EF6;&#x8FDF;&#x6216;&#x8005;&#x5931;&#x8D25;&#x7387;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x5E94;&#x8BE5;&#x5C06;&#x8FD9;&#x4E2A;&#x4ECE;&#x5E93;&#x8FDB;&#x884C;&#x9694;&#x79BB;&#xFF0C;&#x8BFB;&#x6D41;&#x91CF;&#x5C3D;&#x91CF;&#x6253;&#x5230;&#x6B63;&#x5E38;&#x7684;&#x4ECE;&#x5E93;&#x4E0A;</p>
<h3 id="13-&#x5206;&#x5E93;&#x5206;&#x8868;">1.3 &#x5206;&#x5E93;&#x5206;&#x8868;</h3>
<p>&#x7ECF;&#x8FC7;&#x5782;&#x76F4;&#x5206;&#x533A;&#x540E;&#x7684; Master/Salve &#x6A21;&#x5F0F;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x627F;&#x53D7;&#x4F4F;&#x96BE;&#x4EE5;&#x60F3;&#x8C61;&#x7684;&#x9AD8;&#x5E76;&#x53D1;&#x8BBF;&#x95EE;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x6C38;&#x8FDC; &#x9AD8;&#x6795;&#x65E0;&#x5FE7; &#x4E86;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x5426;&#x5B9A;&#x7684;&#xFF0C;&#x4E00;&#x65E6;&#x4E1A;&#x52A1;&#x8868;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x91CF;&#x5927;&#x4E86;&#xFF0C;&#x4ECE;&#x7EF4;&#x62A4;&#x548C;&#x6027;&#x80FD;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x4EFB;&#x4F55;&#x7684; CRUD &#x64CD;&#x4F5C;&#xFF0C;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x800C;&#x8A00;&#x90FD;&#x662F;&#x4E00;&#x4EF6;&#x6781;&#x5176;&#x8017;&#x8D39;&#x8D44;&#x6E90;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5373;&#x4FBF;&#x8BBE;&#x7F6E;&#x4E86;&#x7D22;&#x5F15;&#xFF0C; &#x4ECD;&#x7136;&#x65E0;&#x6CD5;&#x63A9;&#x76D6;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x91CF;&#x8FC7;&#x5927;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x7684;&#x6570;&#x636E;&#x5E93;&#x6027;&#x80FD;&#x4E0B;&#x964D;&#x7684;&#x4E8B;&#x5B9E; &#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x4E2A;&#x65F6;&#x5019; Mysql DBA &#x6216;&#x8BB8;&#x5C31;&#x8BE5;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C; &#x6C34;&#x5E73;&#x5206;&#x533A; &#xFF08;sharding&#xFF0C;&#x5373;&#x5206;&#x5E93;&#x5206;&#x8868; &#xFF09;&#x3002;&#x7ECF;&#x8FC7;&#x6C34;&#x5E73;&#x5206;&#x533A;&#x8BBE;&#x7F6E;&#x540E;&#x7684;&#x4E1A;&#x52A1;&#x8868;&#xFF0C;&#x5FC5;&#x7136;&#x80FD;&#x591F;&#x5C06;&#x539F;&#x672C;&#x4E00;&#x5F20;&#x8868;&#x7EF4;&#x62A4;&#x7684;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x5206;&#x914D;&#x7ED9; N &#x4E2A;&#x5B50;&#x8868;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#x548C;&#x7EF4;&#x62A4;&#x3002;</p>
<p>&#x6C34;&#x5E73;&#x5206;&#x8868;&#x4ECE;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x4E0A;&#x53C8;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;3&#x79CD;&#xFF1A;&#x53EA;&#x5206;&#x8868;&#x3001;&#x53EA;&#x5206;&#x5E93;&#x3001;&#x5206;&#x5E93;&#x5206;&#x8868;&#xFF0C;&#x4E0B;&#x56FE;&#x5C55;&#x793A;&#x4E86;&#x8FD9;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;</p>
<p><img src="../assets/1027.png" alt=""></p>
<p><strong>&#x53EA;&#x5206;&#x8868;&#xFF1A;</strong></p>
<p>&#x5C06;db&#x5E93;&#x4E2D;&#x7684;user&#x8868;&#x62C6;&#x5206;&#x4E3A;2&#x4E2A;&#x5206;&#x8868;&#xFF0C;user_0&#x548C;user_1&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x8868;&#x8FD8;&#x4F4D;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x5E93;&#x4E2D;&#x3002;&#x9002;&#x7528;&#x573A;&#x666F;&#xFF1A;&#x5982;&#x679C;&#x5E93;&#x4E2D;&#x7684;&#x591A;&#x4E2A;&#x8868;&#x4E2D;&#x53EA;&#x6709;&#x67D0;&#x5F20;&#x8868;&#x6216;&#x8005;&#x5C11;&#x6570;&#x8868;&#x6570;&#x636E;&#x91CF;&#x8FC7;&#x5927;&#xFF0C;&#x90A3;&#x4E48;&#x53EA;&#x9700;&#x8981;&#x9488;&#x5BF9;&#x8FD9;&#x4E9B;&#x8868;&#x8FDB;&#x884C;&#x62C6;&#x5206;&#xFF0C;&#x5176;&#x4ED6;&#x8868;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;</p>
<p><strong>&#x53EA;&#x5206;&#x5E93;&#xFF1A;</strong></p>
<p>&#x5C06;db&#x5E93;&#x62C6;&#x5206;&#x4E3A;db_0&#x548C;db_1&#x4E24;&#x4E2A;&#x5E93;&#xFF0C;&#x540C;&#x65F6;&#x5728;db_0&#x548C;db_1&#x5E93;&#x4E2D;&#x5404;&#x81EA;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;user&#x8868;&#xFF0C;db_0.user&#x8868;&#x548C;db_1.user&#x8868;&#x4E2D;&#x5404;&#x81EA;&#x53EA;&#x5B58;&#x539F;&#x6765;&#x7684;db.user&#x8868;&#x4E2D;&#x7684;&#x90E8;&#x5206;&#x6570;&#x636E;&#x3002;</p>
<p><strong>&#x5206;&#x5E93;&#x5206;&#x8868;&#xFF1A;</strong></p>
<p>&#x5C06;db&#x5E93;&#x62C6;&#x5206;&#x4E3A;db_0&#x548C;db_1&#x4E24;&#x4E2A;&#x5E93;&#xFF0C;db_0&#x4E2D;&#x5305;&#x542B;user_0&#x3001;user_1&#x4E24;&#x4E2A;&#x5206;&#x8868;&#xFF0C;db_1&#x4E2D;&#x5305;&#x542B;user_2&#x3001;user_3&#x4E24;&#x4E2A;&#x5206;&#x8868;&#x3002;&#x4E0B;&#x56FE;&#x6F14;&#x793A;&#x4E86;&#x5728;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6570;&#x636E;&#x662F;&#x5982;&#x4F55;&#x62C6;&#x5206;&#x7684;&#xFF1A;&#x5047;&#x8BBE;db&#x5E93;&#x7684;user&#x8868;&#x4E2D;&#x539F;&#x6765;&#x6709;4000W&#x6761;&#x6570;&#x636E;&#xFF0C;&#x73B0;&#x5728;&#x5C06;db&#x5E93;&#x62C6;&#x5206;&#x4E3A;2&#x4E2A;&#x5206;&#x5E93;db_0&#x548C;db_1&#xFF0C;user&#x8868;&#x62C6;&#x5206;&#x4E3A;user_0&#x3001;user_1&#x3001;user_2&#x3001;user_3&#x56DB;&#x4E2A;&#x5206;&#x8868;&#xFF0C;&#x6BCF;&#x4E2A;&#x5206;&#x8868;&#x5B58;&#x50A8;1000W&#x6761;&#x6570;&#x636E;&#x3002;</p>
<p><img src="../assets/1028.png" alt=""></p>
<h4 id="131-&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x597D;&#x5904;">1.3.1 &#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x597D;&#x5904;</h4>
<p><strong>&#x5982;&#x679C;&#x8BF4;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x5B9E;&#x73B0;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x80FD;&#x529B;&#x7684;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#xFF0C;&#x90A3;&#x4E48;&#x5206;&#x5E93;&#x5206;&#x8868;&#x5C31;&#x662F;&#x5B9E;&#x73B0;&#x4E86;&#x5199;&#x80FD;&#x529B;&#x7684;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#x3002;</strong>  </p>
<ul>
<li>&#x5B58;&#x50A8;&#x80FD;&#x529B;&#x7684;&#x6C34;&#x5E73;&#x6269;&#x5C55;</li>
</ul>
<p>&#x5728;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;master&#x548C;slave&#x57FA;&#x672C;&#x4E0A;&#x6570;&#x636E;&#x662F;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x4ECE;&#x5B58;&#x50A8;&#x80FD;&#x529B;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x5B58;&#x5728;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x80FD;&#x7531;&#x4E8E;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x65E0;&#x6CD5;&#x5B58;&#x50A8;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x3002;&#x800C;&#x5728;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x642D;&#x5EFA;&#x591A;&#x4E2A;mysql&#x4E3B;&#x4ECE;&#x590D;&#x5236;&#x96C6;&#x7FA4;&#xFF0C;&#x6BCF;&#x4E2A;&#x96C6;&#x7FA4;&#x53EA;&#x5B58;&#x50A8;&#x90E8;&#x5206;&#x5206;&#x7247;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5B9E;&#x73B0;&#x5B58;&#x50A8;&#x80FD;&#x529B;&#x7684;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#x3002;</p>
<ul>
<li>&#x5199;&#x80FD;&#x529B;&#x7684;&#x6C34;&#x5E73;&#x6269;&#x5C55;</li>
</ul>
<p>&#x5728;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x96C6;&#x7FA4;&#x53EA;&#x6709;&#x4E00;&#x4E2A;master&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x538B;&#x529B;&#x90FD;&#x96C6;&#x4E2D;&#x5728;&#x8FD9;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x5728;&#x5199;&#x5165;&#x5E76;&#x53D1;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x91CC;&#x4F1A;&#x6210;&#x4E3A;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x74F6;&#x9888;&#x3002;</p>
<p>&#x800C;&#x5728;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x5206;&#x7247;&#x6240;&#x5C5E;&#x7684;&#x96C6;&#x7FA4;&#x90FD;&#x6709;&#x4E00;&#x4E2A;master&#x8282;&#x70B9;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#xFF0C;&#x5B9E;&#x73B0;&#x5199;&#x80FD;&#x529B;&#x7684;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#x3002;&#x6B64;&#x5916;&#x51CF;&#x5C0F;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x5F00;&#x9500;&#xFF0C;&#x964D;&#x4F4E;&#x5199;&#x64CD;&#x4F5C;&#x7684;&#x9501;&#x64CD;&#x4F5C;&#x8017;&#x65F6;&#x7B49;&#xFF0C;&#x90FD;&#x4F1A;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x663E;&#x7136;&#x7684;&#x597D;&#x5904;&#x3002; </p>
<h4 id="132-&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x6311;&#x6218;">1.3.2 &#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x6311;&#x6218;</h4>
<p>&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x6311;&#x6218;&#x4E3B;&#x8981;&#x4F53;&#x73B0;&#x5728;4&#x4E2A;&#x65B9;&#x9762;&#xFF1A;<strong>&#x57FA;&#x672C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x589E;&#x5220;&#x6539;&#x529F;&#x80FD;</strong>&#xFF0C;<strong>&#x5206;&#x5E03;&#x5F0F;id</strong>&#xFF0C;<strong>&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;</strong>&#xFF0C;<strong>&#x52A8;&#x6001;&#x6269;&#x5BB9;</strong>&#xFF0C;&#x4E0B;&#x9762;&#x9010;&#x4E00;&#x8FDB;&#x884C;&#x8BB2;&#x8FF0;&#x3002; </p>
<p><strong>&#x6311;&#x6218;1&#xFF1A;&#x57FA;&#x672C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x589E;&#x5220;&#x6539;&#x529F;&#x80FD;</strong>   </p>
<p>&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x800C;&#x8A00;&#xFF0C;&#x867D;&#x7136;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x8FD8;&#x662F;&#x5E0C;&#x671B;&#x80FD;&#x548C;&#x5355;&#x5E93;&#x5355;&#x8868;&#x90A3;&#x6837;&#x7684;&#x53BB;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x5E93;&#x3002;&#x4F8B;&#x5982;&#x6211;&#x4EEC;&#x8981;&#x6279;&#x91CF;&#x63D2;&#x5165;&#x56DB;&#x6761;&#x7528;&#x6237;&#x8BB0;&#x5F55;&#xFF0C;&#x5E76;&#x4E14;&#x5E0C;&#x671B;&#x6839;&#x636E;&#x7528;&#x6237;&#x7684;id&#x5B57;&#x6BB5;&#xFF0C;&#x786E;&#x5B9A;&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#x63D2;&#x5165;&#x54EA;&#x4E2A;&#x5E93;&#x7684;&#x54EA;&#x5F20;&#x8868;&#x3002;&#x4F8B;&#x5982;1&#x53F7;&#x8BB0;&#x5F55;&#x63D2;&#x5165;user1&#x8868;&#xFF0C;2&#x53F7;&#x8BB0;&#x5F55;&#x63D2;&#x5165;user2&#x8868;&#xFF0C;3&#x53F7;&#x8BB0;&#x5F55;&#x63D2;&#x5165;user3&#x8868;&#xFF0C;4&#x53F7;&#x8BB0;&#x5F55;&#x63D2;&#x5165;user0&#x8868;&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;sql&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> <span class="hljs-keyword">user</span>(<span class="hljs-keyword">id</span>,<span class="hljs-keyword">name</span>) <span class="hljs-keyword">values</span> (<span class="hljs-number">1</span>,&#x201D;tianshouzhi&#x201D;),(<span class="hljs-number">2</span>,&#x201D;huhuamin&#x201D;), (<span class="hljs-number">3</span>,&#x201D;wanghanao&#x201D;),(<span class="hljs-number">4</span>,&#x201D;luyang&#x201D;)
</code></pre>
<p>&#x8FD9;&#x6837;&#x7684;sql&#x660E;&#x663E;&#x662F;&#x65E0;&#x6CD5;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5BF9;&#x5E93;&#x548C;&#x8868;&#x8FDB;&#x884C;&#x4E86;&#x62C6;&#x5206;,&#x8FD9;&#x79CD;sql&#x8BED;&#x6CD5;&#x53EA;&#x80FD;&#x64CD;&#x4F5C;mysql&#x7684;&#x5355;&#x4E2A;&#x5E93;&#x548C;&#x5355;&#x4E2A;&#x8868;&#x3002;&#x6240;&#x4EE5;&#x5FC5;&#x987B;&#x5C06;sql&#x6539;&#x6210;4&#x6761;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF0C;&#x7136;&#x540E;&#x5206;&#x522B;&#x5230;&#x6BCF;&#x4E2A;&#x5E93;&#x4E0A;&#x53BB;&#x6267;&#x884C;&#x3002;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> user0(<span class="hljs-keyword">id</span>,<span class="hljs-keyword">name</span>) <span class="hljs-keyword">values</span> (<span class="hljs-number">4</span>,&#x201D;luyang&#x201D;)
<span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> user1(<span class="hljs-keyword">id</span>,<span class="hljs-keyword">name</span>) <span class="hljs-keyword">values</span> (<span class="hljs-number">1</span>,&#x201D;tianshouzhi&#x201D;)
<span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> user2(<span class="hljs-keyword">id</span>,<span class="hljs-keyword">name</span>) <span class="hljs-keyword">values</span> (<span class="hljs-number">2</span>,&#x201D;huhuamin&#x201D;)
<span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> user3(<span class="hljs-keyword">id</span>,<span class="hljs-keyword">name</span>) <span class="hljs-keyword">values</span> (<span class="hljs-number">3</span>,&#x201D;wanghanao&#x201D;)
</code></pre>
<p>&#x5177;&#x4F53;&#x6D41;&#x7A0B;&#x53EF;&#x4EE5;&#x7528;&#x4E0B;&#x56FE;&#x8FDB;&#x884C;&#x63CF;&#x8FF0;&#xFF1A;</p>
<p><img src="../assets/1029.png" alt=""></p>
<p><strong>&#x89E3;&#x91CA;&#x5982;&#x4E0B;&#xFF1A;</strong></p>
<ol>
<li><strong>sql&#x89E3;&#x6790;&#xFF1A;</strong>&#x9996;&#x5148;&#x5BF9;sql&#x8FDB;&#x884C;&#x89E3;&#x6790;&#xFF0C;&#x5F97;&#x5230;&#x9700;&#x8981;&#x63D2;&#x5165;&#x7684;&#x56DB;&#x6761;&#x8BB0;&#x5F55;&#x7684;id&#x5B57;&#x6BB5;&#x7684;&#x503C;&#x5206;&#x522B;&#x4E3A;1,2,3,4</li>
<li><strong>sql&#x8DEF;&#x7531;&#xFF1A;</strong>sql&#x8DEF;&#x7531;&#x5305;&#x62EC;&#x5E93;&#x8DEF;&#x7531;&#x548C;&#x8868;&#x8DEF;&#x7531;&#x3002;&#x5E93;&#x8DEF;&#x7531;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#x5E94;&#x8BE5;&#x63D2;&#x5165;&#x54EA;&#x4E2A;&#x5E93;&#xFF0C;&#x8868;&#x8DEF;&#x7531;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#x5E94;&#x8BE5;&#x63D2;&#x5165;&#x54EA;&#x4E2A;&#x8868;&#x3002;</li>
<li><strong>sql&#x6539;&#x5199;&#xFF1A;</strong>&#x56E0;&#x4E3A;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x53EA;&#x80FD;&#x63D2;&#x5165;&#x5230;&#x4E00;&#x4E2A;&#x5E93;&#x4E2D;&#xFF0C;&#x800C;&#x4E0A;&#x8FF0;&#x6279;&#x91CF;&#x63D2;&#x5165;&#x7684;&#x8BED;&#x6CD5;&#x5C06;&#x4F1A;&#x5728; &#x6BCF;&#x4E2A;&#x5E93;&#x4E2D;&#x90FD;&#x63D2;&#x5165;&#x56DB;&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x660E;&#x663E;&#x662F;&#x4E0D;&#x5408;&#x9002;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5BF9;sql&#x8FDB;&#x884C;&#x6539;&#x5199;&#xFF0C;&#x6BCF;&#x4E2A;&#x5E93;&#x53EA;&#x63D2;&#x5165;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x3002;</li>
<li><strong>sql&#x6267;&#x884C;&#xFF1A;</strong>&#x4E00;&#x6761;sql&#x7ECF;&#x8FC7;&#x6539;&#x5199;&#x540E;&#x53D8;&#x6210;&#x4E86;&#x591A;&#x6761;sql&#xFF0C;&#x4E3A;&#x4E86;&#x63D0;&#x5347;&#x6548;&#x7387;&#x5E94;&#x8BE5;&#x5E76;&#x53D1;&#x7684;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5E93;&#x4E0A;&#x53BB;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6309;&#x7167;&#x987A;&#x5E8F;&#x9010;&#x4E00;&#x6267;&#x884C;</li>
<li><strong>&#x7ED3;&#x679C;&#x96C6;&#x5408;&#x5E76;&#xFF1A;</strong>&#x6BCF;&#x4E2A;sql&#x6267;&#x884C;&#x4E4B;&#x540E;&#xFF0C;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x7ED3;&#x679C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x7ED3;&#x679C;&#x96C6;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#xFF0C;&#x4ECE;&#x800C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7ED3;&#x679C;&#x3002;</li>
</ol>
<p><strong>&#x6311;&#x6218;2&#xFF1A;&#x5206;&#x5E03;&#x5F0F;id</strong></p>
<p>&#x5728;&#x5206;&#x5E93;&#x5206;&#x8868;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x518D;&#x4F7F;&#x7528;mysql&#x7684;&#x81EA;&#x589E;&#x4E3B;&#x952E;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x63D2;&#x5165;&#x8BB0;&#x5F55;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5E93;&#x751F;&#x6210;&#x7684;&#x8BB0;&#x5F55;&#x7684;&#x81EA;&#x589E;id&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x51B2;&#x7A81;&#x3002;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x7684;id&#x751F;&#x6210;&#x5668;&#x3002;&#x76EE;&#x524D;&#x5206;&#x5E03;&#x5F0F;id&#x6709;&#x5F88;&#x591A;&#x4E2D;&#x65B9;&#x6848;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x65B9;&#x6848;&#x662F;twitter&#x7684;snowflake&#x7B97;&#x6CD5;&#x3002;</p>
<p><strong>&#x6311;&#x6218;3&#xFF1A;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;</strong></p>
<p>&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x662F;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7ED5;&#x4E0D;&#x8FC7;&#x53BB;&#x7684;&#x4E00;&#x4E2A;&#x574E;&#xFF0C;&#x56E0;&#x4E3A;&#x6D89;&#x53CA;&#x5230;&#x4E86;&#x540C;&#x65F6;&#x66F4;&#x65B0;&#x591A;&#x4E2A;&#x5206;&#x7247;&#x6570;&#x636E;&#x3002;&#x4F8B;&#x5982;&#x4E0A;&#x9762;&#x7684;&#x6279;&#x91CF;&#x63D2;&#x5165;&#x8BB0;&#x5F55;&#x5230;&#x56DB;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5E93;&#xFF0C;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x8981;&#x4E48;&#x540C;&#x65F6;&#x6210;&#x529F;&#xFF0C;&#x8981;&#x4E48;&#x540C;&#x65F6;&#x5931;&#x8D25;&#x3002;&#x5173;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#xFF0C;mysql&#x652F;&#x6301;XA&#x4E8B;&#x52A1;&#xFF0C;&#x4F46;&#x662F;&#x6548;&#x7387;&#x8F83;&#x4F4E;&#x3002;&#x67D4;&#x6027;&#x4E8B;&#x52A1;&#x662F;&#x76EE;&#x524D;&#x6BD4;&#x8F83;&#x4E3B;&#x6D41;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x67D4;&#x6027;&#x4E8B;&#x52A1;&#x5305;&#x62EC;&#xFF1A;&#x6700;&#x5927;&#x52AA;&#x529B;&#x901A;&#x77E5;&#x578B;&#x3001;&#x53EF;&#x9760;&#x6D88;&#x606F;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x65B9;&#x6848;&#x4EE5;&#x53CA;TCC&#x4E24;&#x9636;&#x6BB5;&#x63D0;&#x4EA4;&#x3002;&#x4F46;&#x662F;&#x65E0;&#x8BBA;XA&#x4E8B;&#x52A1;&#x8FD8;&#x662F;&#x67D4;&#x6027;&#x4E8B;&#x52A1;&#xFF0C;&#x5B9E;&#x73B0;&#x8D77;&#x6765;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x3002;</p>
<p><strong>&#x6311;&#x6218;4&#xFF1A;&#x52A8;&#x6001;&#x6269;&#x5BB9;</strong></p>
<p>&#x52A8;&#x6001;&#x6269;&#x5BB9;&#x6307;&#x7684;&#x662F;&#x589E;&#x52A0;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x6570;&#x91CF;&#x3002;&#x4F8B;&#x5982;&#x539F;&#x6765;&#x7684;user&#x8868;&#x62C6;&#x5206;&#x5230;2&#x4E2A;&#x5E93;&#x7684;&#x56DB;&#x5F20;&#x8868;&#x4E0A;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5C06;&#x5206;&#x5E93;&#x7684;&#x6570;&#x91CF;&#x53D8;&#x4E3A;4&#x4E2A;&#xFF0C;&#x5206;&#x8868;&#x7684;&#x6570;&#x91CF;&#x53D8;&#x4E3A;8&#x4E2A;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4E00;&#x822C;&#x8981;&#x4F34;&#x968F;&#x7740;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x3002;&#x4F8B;&#x5982;&#x5728;4&#x5F20;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;id&#x4E3A;7&#x7684;&#x8BB0;&#x5F55;&#xFF0C;7%4=3&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#x4F4D;&#x4E8E;user3&#x8FD9;&#x5F20;&#x8868;&#x4E0A;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x5206;&#x8868;&#x7684;&#x6570;&#x91CF;&#x53D8;&#x4E3A;&#x4E86;8&#x4E2A;&#xFF0C;&#x800C;7%8=0&#xFF0C;&#x800C;user0&#x8FD9;&#x5F20;&#x8868;&#x4E0A;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;id=7&#x7684;&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x56E0;&#x6B64;&#x5982;&#x679C;&#x4E0D;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x8BB0;&#x5F55;&#x627E;&#x4E0D;&#x5230;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x672C;&#x6559;&#x7A0B;&#x540E;&#x9762;&#x5C06;&#x4F1A;&#x4ECB;&#x7ECD;&#x4E00;&#x79CD;&#x5728;&#x52A8;&#x6001;&#x6269;&#x5BB9;&#x65F6;&#x4E0D;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x7684;&#x65B9;&#x6848;&#x3002;</p>
<h2 id="2-&#x4E3B;&#x6D41;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;">2. &#x4E3B;&#x6D41;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;</h2>
<p>&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x4E3B;&#x8981;&#x4F5C;&#x7528;&#x662F;&#x5411;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C4F;&#x853D;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x548C;&#x5206;&#x5E93;&#x5206;&#x8868;&#x9762;&#x4E34;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x5E76;&#x9690;&#x85CF;&#x5E95;&#x5C42;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x4F7F;&#x5F97;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x50CF;&#x64CD;&#x4F5C;&#x5355;&#x5E93;&#x5355;&#x8868;&#x90A3;&#x6837;&#x53BB;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x3002;&#x5728;&#x4ECB;&#x7ECD;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x4E3B;&#x6D41;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x5728;&#x5355;&#x4E2A;&#x5E93;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5E94;&#x7528;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E0B;&#x56FE;&#x8FDB;&#x884C;&#x63CF;&#x8FF0;&#xFF1A;</p>
<p><img src="../assets/1030.png" alt=""></p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5728;&#x64CD;&#x4F5C;&#x5355;&#x5E93;&#x5355;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x76F4;&#x63A5;&#x5728;&#x5E94;&#x7528;&#x4E2D;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x8FDE;&#x63A5;&#x6C60;(connection pool)&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x8FDB;&#x884C;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#x3002; &#x800C;&#x5BF9;&#x4E8E;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x548C;&#x5206;&#x5E93;&#x5206;&#x8868;&#xFF0C;&#x5E94;&#x7528;&#x90FD;&#x8981;&#x64CD;&#x4F5C;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x4F8B;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x3002;</p>
<h3 id="21-&#x8BBE;&#x8BA1;&#x65B9;&#x6848;">2.1 &#x8BBE;&#x8BA1;&#x65B9;&#x6848;</h3>
<p>&#x5178;&#x578B;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;&#x6709;2&#x79CD;&#xFF1A;<strong>proxy</strong>&#x3001;<strong>smart-client</strong>&#x3002;&#x4E0B;&#x56FE;&#x6F14;&#x793A;&#x4E86;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6848;&#x7684;&#x67B6;&#x6784;&#xFF1A;</p>
<p><img src="../assets/1031.png" alt=""></p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E0D;&#x8BBA;&#x662F;proxy&#x8FD8;&#x662F;smart-client&#xFF0C;&#x5E95;&#x5C42;&#x90FD;&#x64CD;&#x4F5C;&#x4E86;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x4F8B;&#x3002;&#x4E0D;&#x8BBA;&#x662F;&#x5206;&#x5E93;&#x5206;&#x8868;&#xFF0C;&#x8FD8;&#x662F;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#xFF0C;&#x90FD;&#x662F;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x5C42;&#x9762;&#x5BF9;&#x4E1A;&#x52A1;&#x5F00;&#x53D1;&#x540C;&#x5B66;&#x8FDB;&#x884C;&#x5C4F;&#x853D;&#x3002;</p>
<h4 id="211-proxy&#x6A21;&#x5F0F;">2.1.1 proxy&#x6A21;&#x5F0F;</h4>
<p>&#x6211;&#x4EEC;&#x72EC;&#x7ACB;&#x90E8;&#x7F72;&#x4E00;&#x4E2A;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x80CC;&#x540E;&#x7BA1;&#x7406;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x4F8B;&#x3002;&#x800C;&#x5728;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x6570;&#x636E;&#x6E90;(c3p0&#x3001;druid&#x3001;dbcp&#x7B49;)&#x4E0E;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x6240;&#x6709;&#x7684;sql&#x64CD;&#x4F5C;&#x8BED;&#x53E5;&#x90FD;&#x662F;&#x53D1;&#x9001;&#x7ED9;&#x8FD9;&#x4E2A;&#x4EE3;&#x7406;&#xFF0C;&#x7531;&#x8FD9;&#x4E2A;&#x4EE3;&#x7406;&#x53BB;&#x64CD;&#x4F5C;&#x5E95;&#x5C42;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5F97;&#x5230;&#x7ED3;&#x679C;&#x5E76;&#x8FD4;&#x56DE;&#x7ED9;&#x5E94;&#x7528;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x65B9;&#x6848;&#x4E0B;&#xFF0C;&#x5206;&#x5E93;&#x5206;&#x8868;&#x548C;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x7684;&#x903B;&#x8F91;&#x5BF9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x662F;&#x5B8C;&#x5168;&#x900F;&#x660E;&#x7684;&#x3002;</p>
<p><strong>&#x4F18;&#x70B9;&#xFF1A;</strong></p>
<p>1 &#x591A;&#x8BED;&#x8A00;&#x652F;&#x6301;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E0D;&#x8BBA;&#x4F60;&#x7528;&#x7684;php&#x3001;java&#x6216;&#x662F;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x3002;&#x4EE5;mysql&#x6570;&#x636E;&#x5E93;&#x4E3A;&#x4F8B;&#xFF0C;&#x5982;&#x679C;proxy&#x672C;&#x8EAB;&#x5B9E;&#x73B0;&#x4E86;mysql&#x7684;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x5C31;&#x5C06;&#x5176;&#x770B;&#x6210;&#x4E00;&#x4E2A;mysql &#x670D;&#x52A1;&#x5668;&#x3002;mysql&#x5B98;&#x65B9;&#x56E2;&#x961F;&#x4E3A;&#x4E0D;&#x540C;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5374;&#x52A8;&#xFF0C;&#x5982;java&#x8BED;&#x8A00;&#x7684;mysql-connector-java&#xFF0C;python&#x8BED;&#x8A00;&#x7684;mysql-connector-python&#x7B49;&#x7B49;&#x3002;&#x56E0;&#x6B64;&#x4E0D;&#x540C;&#x8BED;&#x8A00;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;mysql&#x5B98;&#x65B9;&#x63D0;&#x4F9B;&#x7684;&#x5BF9;&#x5E94;&#x7684;&#x9A71;&#x52A8;&#x6765;&#x4E0E;&#x8FD9;&#x4E2A;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x5EFA;&#x901A;&#x4FE1;&#x3002;</p>
<p>2 &#x5BF9;&#x4E1A;&#x52A1;&#x5F00;&#x53D1;&#x540C;&#x5B66;&#x900F;&#x660E;&#x3002;&#x7531;&#x4E8E;&#x53EF;&#x4EE5;&#x628A;proxy&#x5F53;&#x6210;mysql&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x4E1A;&#x52A1;&#x540C;&#x5B66;&#x4E0D;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x592A;&#x591A;&#x4EE3;&#x7801;&#x6539;&#x9020;&#xFF0C;&#x65E2;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x63A5;&#x5165;&#x3002;</p>
<p><strong>&#x7F3A;&#x70B9;&#xFF1A;</strong></p>
<p>1 &#x5B9E;&#x73B0;&#x590D;&#x6742;&#x3002;&#x56E0;&#x4E3A;proxy&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x88AB;&#x4EE3;&#x7406;&#x7684;&#x6570;&#x636E;&#x5E93;server&#x7AEF;&#x7684;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#xFF0C;&#x5B9E;&#x73B0;&#x96BE;&#x5EA6;&#x8F83;&#x5927;&#x3002;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E00;&#x4E9B;proxy&#x6A21;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x53EA;&#x80FD;&#x4EE3;&#x7406;&#x67D0;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5982;mysql&#x3002;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x4EE3;&#x7406;&#x591A;&#x79CD;&#x6570;&#x636E;&#x5E93;(sqlserver&#x3001;PostgreSQL&#x3001;Oracle)&#x3002;</p>
<p>2 proxy&#x672C;&#x8EAB;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x9AD8;&#x53EF;&#x7528;&#x3002;&#x7531;&#x4E8E;&#x5E94;&#x7528;&#x672C;&#x6765;&#x662F;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x73B0;&#x5728;&#x6539;&#x6210;&#x4E86;&#x8BBF;&#x95EE;proxy&#xFF0C;&#x610F;&#x5473;&#x7740;proxy&#x5FC5;&#x987B;&#x4FDD;&#x8BC1;&#x9AD8;&#x53EF;&#x7528;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x6CA1;&#x6709;&#x5B95;&#x673A;&#xFF0C;proxy&#x6302;&#x4E86;&#xFF0C;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x5E93;&#x65E0;&#x6CD5;&#x6B63;&#x5E38;&#x8BBF;&#x95EE;&#xFF0C;&#x5C31;&#x5C34;&#x5C2C;&#x4E86;&#x3002; </p>
<p>3 &#x79DF;&#x6237;&#x9694;&#x79BB;&#x3002;&#x53EF;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x8BBF;&#x95EE;proxy&#x4EE3;&#x7406;&#x7684;&#x5E95;&#x5C42;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5FC5;&#x7136;&#x4F1A;&#x5BF9;proxy&#x81EA;&#x8EAB;&#x7684;&#x5185;&#x5B58;&#x3001;&#x7F51;&#x7EDC;&#x3001;cpu&#x7B49;&#x4EA7;&#x751F;&#x8D44;&#x6E90;&#x7ADE;&#x4E89;&#xFF0C;proxy&#x9700;&#x8981;&#x9700;&#x8981;&#x5177;&#x5907;&#x9694;&#x79BB;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<h4 id="212-smart-client&#x6A21;&#x5F0F;">2.1.2 smart-client&#x6A21;&#x5F0F;</h4>
<p>&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x6539;&#x9020;&#xFF0C;<span class="pg-emphasize pg-emphasize-green" style=""> &#x5F15;&#x5165;&#x652F;&#x6301;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x6216;&#x8005;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x529F;&#x80FD;&#x7684;sdk </span>&#xFF0C;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;smart-client&#x3002;&#x901A;&#x5E38;smart-client&#x662F;&#x5728;&#x8FDE;&#x63A5;&#x6C60;&#x6216;&#x8005;driver&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x5C42;&#x5C01;&#x88C5;&#xFF0C;smart-client&#x5185;&#x90E8;&#x4E0E;&#x4E0D;&#x540C;&#x7684;&#x5E93;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EA7;&#x751F;&#x7684;sql&#x4EA4;&#x7ED9;smart-client&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x5176;&#x5185;&#x90E8;&#x5BF9;sql&#x8FDB;&#x884C;&#x5FC5;&#x8981;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9009;&#x62E9;&#x8D70;&#x4ECE;&#x5E93;&#x8FD8;&#x662F;&#x4E3B;&#x5E93;&#xFF1B;&#x5728;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FDB;&#x884C;sql&#x89E3;&#x6790;&#x3001;sql&#x6539;&#x5199;&#x7B49;&#x64CD;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x8DEF;&#x7531;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x5E93;&#xFF0C;&#x5C06;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#xFF0C;&#x8FD4;&#x56DE;&#x7ED9;&#x5E94;&#x7528;&#x3002;</p>
<p><strong>&#x4F18;&#x70B9;&#xFF1A;</strong></p>
<p>1 &#x5B9E;&#x73B0;&#x7B80;&#x5355;&#x3002;proxy&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x5E93;&#x7684;&#x670D;&#x52A1;&#x7AEF;&#x534F;&#x8BAE;&#xFF0C;&#x4F46;&#x662F;smart-client&#x4E0D;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x5BA2;&#x6237;&#x7AEF;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#x3002;&#x539F;&#x56E0;&#x5728;&#x4E8E;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x636E;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5546;&#x5DF2;&#x7ECF;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;&#x76F8;&#x5E94;&#x7684;&#x6570;&#x636E;&#x5E93;&#x9A71;&#x52A8;driver&#xFF0C;&#x4F8B;&#x5982;mysql&#x9488;&#x5BF9;java&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;mysql-connector-java&#x9A71;&#x52A8;&#xFF0C;&#x9488;&#x5BF9;python&#x63D0;&#x4F9B;&#x4E86;mysql-connector-python&#x9A71;&#x52A8;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#x5DF2;&#x7ECF;&#x5728;driver&#x5C42;&#x9762;&#x505A;&#x8FC7;&#x4E86;&#x3002;&#x56E0;&#x6B64;smart-client&#x6A21;&#x5F0F;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x901A;&#x5E38;&#x53EA;&#x9700;&#x8981;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x8FDB;&#x884C;&#x5C01;&#x88C5;&#x5373;&#x53EF;&#x3002;</p>
<p>2 &#x5929;&#x7136;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x3002;smart-client&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x7531;&#x4E8E;&#x672C;&#x8EAB;&#x4EE5;sdk&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x88AB;&#x5E94;&#x7528;&#x76F4;&#x63A5;&#x5F15;&#x5165;&#xFF0C;&#x968F;&#x7740;&#x5E94;&#x7528;&#x90E8;&#x7F72;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x4E14;&#x76F4;&#x8FDE;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4E2D;&#x95F4;&#x4E0D;&#x9700;&#x8981;&#x6709;&#x4EE3;&#x7406;&#x5C42;&#x3002;&#x56E0;&#x6B64;&#x76F8;&#x8F83;&#x4E8E;proxy&#x800C;&#x8A00;&#xFF0C;&#x9664;&#x4E86;&#x7F51;&#x7EDC;&#x8D44;&#x6E90;&#x4E4B;&#x5916;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x4E0D;&#x5B58;&#x5728;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x8D44;&#x6E90;&#x7684;&#x7ADE;&#x4E89;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x9AD8;&#x53EF;&#x7528;&#x7684;&#x95EE;&#x9898;&#x3002;&#x53EA;&#x8981;&#x5E94;&#x7528;&#x7684;&#x8282;&#x70B9;&#x6CA1;&#x6709;&#x5168;&#x90E8;&#x5B95;&#x673A;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#x3002;(&#x8FD9;&#x91CC;&#x7684;&#x9AD8;&#x53EF;&#x7528;&#x662F;&#x76F8;&#x6BD4;proxy&#x800C;&#x8A00;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x672C;&#x8EAB;&#x7684;&#x9AD8;&#x53EF;&#x7528;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x7684;)</p>
<p><strong>&#x7F3A;&#x70B9;&#xFF1A;</strong></p>
<p>1 &#x901A;&#x5E38;&#x4EC5;&#x652F;&#x6301;&#x67D0;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x3002;&#x4F8B;&#x5982;tddl&#x3001;zebra&#x3001;sharding-jdbc&#x90FD;&#x662F;&#x4F7F;&#x7528;java&#x8BED;&#x8A00;&#x5F00;&#x53D1;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x5C31;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x4E2D;&#x95F4;&#x4EF6;&#x3002;&#x5982;&#x679C;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x8981;&#x4F7F;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x5F00;&#x53D1;&#x591A;&#x8BED;&#x8A00;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</p>
<p>2 &#x7248;&#x672C;&#x5347;&#x7EA7;&#x56F0;&#x96BE;&#x3002;&#x56E0;&#x4E3A;&#x5E94;&#x7528;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x6E90;&#x4EE3;&#x7406;&#x5C31;&#x662F;&#x5F15;&#x5165;&#x4E00;&#x4E2A;jar&#x5305;&#x7684;&#x4F9D;&#x8D56;&#xFF0C;&#x5728;&#x6709;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x90FD;&#x5BF9;&#x67D0;&#x4E2A;&#x7248;&#x672C;&#x7684;jar&#x5305;&#x4EA7;&#x751F;&#x4F9D;&#x8D56;&#x65F6;&#xFF0C;&#x4E00;&#x65E6;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x6709;bug&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5E94;&#x7528;&#x90FD;&#x9700;&#x8981;&#x5347;&#x7EA7;&#x3002;&#x800C;&#x6570;&#x636E;&#x5E93;&#x4EE3;&#x7406;&#x5347;&#x7EA7;&#x5219;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#xFF0C;&#x56E0;&#x4E3A;&#x670D;&#x52A1;&#x662F;&#x5355;&#x72EC;&#x90E8;&#x7F72;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x5347;&#x7EA7;&#x8FD9;&#x4E2A;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6240;&#x6709;&#x8FDE;&#x63A5;&#x5230;&#x8FD9;&#x4E2A;&#x4EE3;&#x7406;&#x7684;&#x5E94;&#x7528;&#x81EA;&#x7136;&#x4E5F;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x90FD;&#x5347;&#x7EA7;&#x4E86;&#x3002;</p>
<h3 id="22-&#x4E1A;&#x754C;&#x4EA7;&#x54C1;">2.2 &#x4E1A;&#x754C;&#x4EA7;&#x54C1;</h3>
<p>&#x65E0;&#x8BBA;&#x662F;proxy&#xFF0C;&#x8FD8;&#x662F;smart-client&#xFF0C;&#x4E8C;&#x8005;&#x7684;&#x4F5C;&#x7528;&#x90FD;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#x3002;&#x4EE5;&#x4E0B;&#x5217;&#x51FA;&#x4E86;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6848;&#x76EE;&#x524D;&#x5DF2;&#x6709;&#x7684;&#x5B9E;&#x73B0;&#x4EE5;&#x53CA;&#x5404;&#x81EA;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#xFF1A;</p>
<p><img src="../assets/1032.png" alt=""></p>
<p><strong>proxy&#x5B9E;&#x73B0;</strong></p>
<p>&#x76EE;&#x524D;&#x7684;&#x5DF2;&#x6709;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x6848;&#x6709;&#xFF1A;</p>
<ul>
<li>&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x5F00;&#x6E90;&#x7684;cobar</li>
<li>&#x963F;&#x91CC;&#x4E91;&#x4E0A;&#x7684;drds</li>
<li>mycat&#x56E2;&#x961F;&#x5728;cobar&#x57FA;&#x7840;&#x4E0A;&#x5F00;&#x53D1;&#x7684;mycat</li>
<li>mysql&#x5B98;&#x65B9;&#x63D0;&#x4F9B;&#x7684;mysql-proxy</li>
<li>&#x5947;&#x864E;360&#x5728;mysql-proxy&#x57FA;&#x7840;&#x5F00;&#x53D1;&#x7684;atlas(&#x53EA;&#x652F;&#x6301;&#x5206;&#x8868;&#xFF0C;&#x4E0D;&#x652F;&#x6301;&#x5206;&#x5E93;)</li>
<li>&#x5F53;&#x5F53;&#x7F51;&#x5F00;&#x6E90;&#x7684;sharing-sphere</li>
<li>&#x76EE;&#x524D;&#x9664;&#x4E86;mycat&#x3001;sharing-sphere&#xFF0C;&#x5176;&#x4ED6;&#x51E0;&#x4E2A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x57FA;&#x672C;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x7EF4;&#x62A4;&#xFF0C;sharing-sphere&#x524D;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5DF2;&#x7ECF;&#x8FDB;&#x53BB;&#x4E86;Apache &#x8F6F;&#x4EF6;&#x57FA;&#x91D1;&#x4F1A;&#x5B75;&#x5316;&#x5668;&#x3002;</li>
</ul>
<p><strong>smart-client&#x5B9E;&#x73B0;</strong></p>
<p>&#x76EE;&#x524D;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x6848;&#x6709;&#xFF1A;</p>
<ul>
<li>&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x5F00;&#x6E90;&#x7684;tddl&#xFF0C;&#x5DF2;&#x5F88;&#x4E45;&#x6CA1;&#x7EF4;&#x62A4;</li>
<li>&#x5927;&#x4F17;&#x70B9;&#x8BC4;&#x5F00;&#x6E90;&#x7684;zebra&#xFF0C;&#x5927;&#x4F17;&#x70B9;&#x8BC4;&#x7684;zebra&#x5F00;&#x6E90;&#x7248;&#x672C;&#x4EE3;&#x7801;&#x5DF2;&#x7ECF;&#x5F88;&#x4E45;&#x6CA1;&#x6709;&#x66F4;&#x65B0;&#xFF0C;&#x4E0D;&#x8FC7;&#x6700;&#x8FD1;&#x7F8E;&#x56E2;&#x4E0A;&#x5E02;&#xFF0C;&#x91CD;&#x65B0;&#x5F00;&#x6E90;&#x5927;&#x91CF;&#x5185;&#x90E8;&#x65B0;&#x7684;&#x529F;&#x80FD;&#x7279;&#x6027;&#xFF0C;&#x5E76;&#x8BA1;&#x5212;&#x957F;&#x671F;&#x7EF4;&#x6301;&#x3002;</li>
<li>&#x5F53;&#x5F53;&#x7F51;&#x5F00;&#x6E90;&#x7684;sharding-jdbc&#xFF0C;&#x76EE;&#x524D;&#x7B97;&#x662F;&#x505A;&#x7684;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#xFF0C;&#x6587;&#x6863;&#x8D44;&#x6599;&#x6BD4;&#x8F83;&#x5168;&#x3002;&#x548C;sharding-sphere&#x4E00;&#x8D77;&#x8FDB;&#x5165;&#x4E86;Apache&#x5B75;&#x5316;&#x5668;&#x3002;</li>
<li>&#x8682;&#x8681;&#x91D1;&#x670D;&#x7684;zal</li>
</ul>
<blockquote>
<ul>
<li>&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;sharding-jdbc&#xFF08;3.x&#x5DF2;&#x7ECF;&#x66F4;&#x540D;&#x4E3A;sharding-sphere)</li>
<li>&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;sharding-jdbc&#xFF08;sharding-jdbc&#x7684;3.x&#x7248;&#x672C;&#x5373;sharding-sphere&#x5DF2;&#x7ECF;&#x652F;&#x6301;&#x4E86;proxy&#x6A21;&#x5F0F;&#xFF09;</li>
</ul>
</blockquote>
<h2 id="3-&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x6838;&#x5FC3;&#x8981;&#x70B9;">3. &#x8BFB;&#x5199;&#x5206;&#x79BB;&#x6838;&#x5FC3;&#x8981;&#x70B9;</h2>
<h3 id="31-&#x57FA;&#x672C;&#x8DEF;&#x7531;&#x529F;&#x80FD;">3.1 &#x57FA;&#x672C;&#x8DEF;&#x7531;&#x529F;&#x80FD;</h3>
<p>&#x57FA;&#x672C;&#x8DEF;&#x7531;&#x8DEF;&#x529F;&#x80FD;&#x4E3B;&#x8981;&#x662F;&#x89E3;&#x51B3;&#xFF0C;&#x5728;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x8DEF;&#x7531;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0B;&#x56FE;&#x8FDB;&#x884C;&#x63CF;&#x8FF0;&#xFF1A;</p>
<p><img src="../assets/1033.png" alt=""></p>
<h4 id="311-sql&#x7C7B;&#x578B;&#x5224;&#x65AD;">3.1.1 sql&#x7C7B;&#x578B;&#x5224;&#x65AD;</h4>
<p>&#x4E3B;&#x8981;&#x662F;&#x5224;&#x65AD;&#x51FA;&#x6765;sql&#x662F;&#x8BFB;&#x8FD8;&#x662F;&#x5199;sql&#xFF0C;&#x5C06;&#x8BFB;sql&#x5230;&#x4ECE;&#x5E93;&#x4E0A;&#x53BB;&#x6267;&#x884C;&#xFF0C;&#x5199;sql&#x53BB;&#x4E3B;&#x5E93;&#x4E0A;&#x6267;&#x884C;</p>
<p>write&#x8BED;&#x53E5;&#xFF1A;insert&#x3001;update&#x3001;delete&#x3001;create&#x3001;alter&#x3001;truncate&#x2026;</p>
<p>query&#x8BED;&#x53E5;&#xFF1A;select&#x3001;show&#x3001;desc&#x3001;explain&#x2026; </p>
<h4 id="312-&#x5F3A;&#x5236;&#x8D70;&#x4E3B;&#x5E93;">3.1.2 &#x5F3A;&#x5236;&#x8D70;&#x4E3B;&#x5E93;</h4>
<p>&#x6709;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x9700;&#x8981;&#x5199;&#x5165;&#x540E;&#xFF0C;&#x5FC5;&#x987B;&#x80FD;&#x8BFB;&#x53D6;&#x5230;&#x6570;&#x636E;&#x3002;&#x7531;&#x4E8E;&#x4E3B;&#x4ECE;&#x540C;&#x6B65;&#x5B58;&#x5728;&#x5EF6;&#x8FDF;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x4E3B;&#x5E93;&#x5199;&#x5165;&#xFF0C;&#x800C;&#x4ECE;&#x5E93;&#x67E5;&#x4E0D;&#x5230;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x6B21;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5F3A;&#x5236;&#x8D70;&#x4E3B;&#x5E93;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x4E0A;&#x6709;2&#x79CD;&#x65B9;&#x6848;&#xFF1A;hint &#x6216;API</p>
<p><strong>hint: </strong>&#x5C31;&#x662F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;sql&#x4E0A;&#x505A;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x6807;&#x8BB0;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x8BC6;&#x522B;&#x5230;&#x8FD9;&#x4E2A;&#x6807;&#x8BB0;&#xFF0C;&#x5C31;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;sql&#x9700;&#x8981;&#x8D70;&#x4E3B;&#x5E93;&#xFF0C;&#x5982;&#xFF1A; </p>
<pre><code class="lang-sql"><span class="hljs-comment">/*master*/</span><span class="hljs-keyword">select</span> * <span class="hljs-keyword">from</span> table_xx
</code></pre>
<p>&#x8FD9;&#x91CC;&#x7684;<code>/*master*/</code>&#x5C31;&#x662F;&#x4E00;&#x4E2A;hint&#xFF0C;&#x8868;&#x793A;&#x9700;&#x8981;&#x8D70;&#x4E3B;&#x5E93;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x5F3A;&#x5236;&#x8D70;&#x4E3B;&#x5E93;&#x7684;hint&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#xFF0C;&#x4F8B;&#x5982;zebra&#x7684;hint&#x4E3A;<code>/*zebra:w+*/</code>&#xFF0C;hint&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x662F;&#x65E0;&#x6240;&#x8C13;&#x7684;&#xFF0C;&#x5176;&#x4F5C;&#x7528;&#x4EC5;&#x4EC5;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6807;&#x8BB0;&#x800C;&#x5DF2;&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x5C06;hint&#x5199;&#x5728;<code>/*&#x2026;*/</code>&#x4E2D;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x6807;&#x51C6;&#x7684;sql&#x6CE8;&#x91CA;&#x8BED;&#x6CD5;&#x3002;&#x5373;&#x4F7F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x672A;&#x80FD;&#x8BC6;&#x522B;&#x8FD9;&#x4E2A;hint&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;sql&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x3002;</p>
<p><strong>api: </strong>&#x4E3B;&#x8981;&#x662F;&#x901A;&#x8FC7;&#x4EE3;&#x7801;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x6DFB;&#x52A0;sql&#x8D70;&#x4E3B;&#x5E93;&#x7684;&#x6807;&#x8BC6;&#xFF0C;hint&#x901A;&#x5E38;&#x53EA;&#x80FD;&#x52A0;&#x5728;&#x67D0;&#x4E2A;sql&#x4E0A;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x591A;&#x4E2A;sql&#x540C;&#x65F6;&#x90FD;&#x8D70;&#x4E3B;&#x5E93;&#xFF0C;&#x4E5F;&#x4E0D;&#x5E0C;&#x671B;&#x52A0;hint&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;api&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5176;&#x5185;&#x90E8;&#x4E3B;&#x8981;&#x5229;&#x7528;&#x8BED;&#x8A00;&#x7684;thread local&#x7EBF;&#x7A0B;&#x4E0A;&#x4E0B;&#x6587;&#x7279;&#x6027;&#xFF0C;&#x5982;&#xFF1A;</p>
<pre><code class="lang-java">ForceMasterHelper.forceMaster()
    <span class="hljs-comment">//&#x2026;&#x6267;&#x884C;&#x591A;&#x6761;sql</span>
ForceMasterHelper.clear()
</code></pre>
<p>&#x5728;api&#x6807;&#x8BC6;&#x8303;&#x56F4;&#x5185;&#x6267;&#x884C;&#x7684;sql&#xFF0C;&#x90FD;&#x4F1A;&#x8D70;&#x4E3B;&#x5E93;&#x3002;&#x5177;&#x4F53;API&#x5230;&#x5E95;&#x5E94;&#x8BE5;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#xFF0C;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#xFF0C;&#x4E5F;&#x662F;&#x7531;&#x76F8;&#x5E94;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x6765;&#x51B3;&#x5B9A;&#x7684;&#x3002;</p>
<p>&#x7279;&#x522B;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;sql&#xFF0C;&#x4F8B;&#x5982; select last_insert_id&#xFF1B;&#x6216;&#x8005;select @@identity&#x7B49;&#xFF0C;&#x8FD9;&#x7C7B;sql&#x603B;&#x662F;&#x9700;&#x8981;&#x8D70;&#x4E3B;&#x5E93;&#x3002; &#x8FD9;&#x4E9B;sql&#x662F;&#x8981;&#x83B7;&#x5F97;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x63D2;&#x5165;&#x8BB0;&#x5F55;&#x7684;id&#xFF0C;&#x63D2;&#x5165;&#x64CD;&#x4F5C;&#x53EA;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x5728;&#x4E3B;&#x5E93;&#x4E0A;&#x3002;</p>
<h3 id="32-&#x4ECE;&#x5E93;&#x8DEF;&#x7531;&#x7B56;&#x7565;">3.2 &#x4ECE;&#x5E93;&#x8DEF;&#x7531;&#x7B56;&#x7565;</h3>
<p>&#x901A;&#x5E38;&#x5728;&#x4E00;&#x4E2A;&#x96C6;&#x7FA4;&#x4E2D;&#xFF0C;&#x53EA;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;master&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x591A;&#x4E2A;slave&#x3002;&#x5F53;&#x5224;&#x65AD;&#x662F;&#x4E00;&#x4E2A;&#x8BFB;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x5982;&#x4F55;&#x5224;&#x65AD;&#x9009;&#x62E9;&#x54EA;&#x4E2A;slave&#x5462;&#xFF1F;</p>
<p>&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x9009;&#x62E9;&#x7B56;&#x7565;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x968F;&#x673A;&#x9009;&#x62E9;(random)</li>
<li>&#x6309;&#x7167;&#x6743;&#x91CD;&#x8FDB;&#x884C;&#x9009;&#x62E9;(weight)</li>
<li>&#x6216;&#x8005;&#x8F6E;&#x8BAD;(round-robin)</li>
</ul>
<p>&#x7279;&#x522B;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x8DE8;IDC(&#x6570;&#x636E;&#x4E2D;&#x5FC3;)&#x90E8;&#x7F72;&#x7684;&#x6570;&#x636E;&#x5E93;&#x96C6;&#x7FA4;&#xFF0C;&#x901A;&#x5E38;&#x9700;&#x8981;&#x6709;&#x5C31;&#x8FD1;&#x8DEF;&#x7531;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A; </p>
<p><img src="../assets/1034.png" alt=""></p>
<p>&#x56FE;&#x4E2D;&#xFF0C;&#x5728;IDC2&#x90E8;&#x7F72;&#x4E86;&#x4E00;&#x4E2A;master&#xFF0C;&#x5728;IDC1&#x548C;IDC2&#x5404;&#x90E8;&#x7F72;&#x4E86;&#x4E00;&#x4E2A;slave&#xFF0C;&#x5E94;&#x7528;app&#x90E8;&#x7F72;&#x5728;IDC1&#x3002;&#x663E;&#x7136;&#x5F53;app&#x63A5;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x4F18;&#x5148;&#x67E5;&#x8BE2;&#x4E0E;&#x5176;&#x4F4D;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;slave1&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8DE8;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x53BB;&#x67E5;&#x8BE2;slave2&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5C31;&#x8FD1;&#x8DEF;&#x7531;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5185;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x90E8;&#x7F72;&#x591A;&#x4E2A;slave&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x9009;&#x62E9;&#xFF0C;&#x56E0;&#x6B64;&#x5C31;&#x8FD1;&#x8DEF;&#x7531;&#x901A;&#x5E38;&#x548C;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x8DEF;&#x7531;&#x7B56;&#x7565;&#x7ED3;&#x5408;&#x4F7F;&#x7528;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5BF9;&#x4E8E;&#x5C31;&#x8FD1;&#x8DEF;&#x7531;&#xFF0C;&#x901A;&#x5E38;&#x4E5F;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x5C42;&#x7EA7;&#xFF0C;&#x4F8B;&#x5982;&#x540C;&#x673A;&#x623F;&#x3001;&#x540C;&#x4E2D;&#x5FC3;&#x3001;&#x540C;&#x533A;&#x57DF;&#x3001;&#x8DE8;&#x533A;&#x57DF;&#x7B49;&#x3002;</p>
<h3 id="33-ha&#x3001;scalable&#x76F8;&#x5173;">3.3 HA&#x3001;Scalable&#x76F8;&#x5173;</h3>
<p>&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x9664;&#x4E86;&#x9700;&#x8981;&#x5177;&#x5907;&#x4E0A;&#x8FF0;&#x63D0;&#x5230;&#x7684;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x529F;&#x80FD;&#x6765;&#x8BBF;&#x95EE;&#x5E95;&#x5C42;&#x7684;&#x6570;&#x636E;&#x5E93;&#x96C6;&#x7FA4;&#x3002;&#x4E5F;&#x9700;&#x8981;&#x4E00;&#x5957;&#x652F;&#x6301;&#x9AD8;&#x53EF;&#x7528;&#x3001;&#x52A8;&#x6001;&#x6269;&#x5C55;&#x7684;&#x4F53;&#x7CFB;&#xFF1A;</p>
<p>&#x4ECE;HA&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x4F8B;&#x5982;&#x4E3B;&#x5E93;&#x5B95;&#x673A;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x8BE5;&#x4ECE;&#x4ECE;&#x5E93;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x4F5C;&#x4E3A;&#x65B0;&#x7684;&#x4E3B;&#x5E93;&#x3002;&#x5F00;&#x6E90;&#x7684;MHA&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x4E8B;&#xFF1B;&#x7136;&#x800C;&#xFF0C;MHA&#x53EA;&#x80FD;&#x5728;&#x4E3B;&#x5E93;&#x5B95;&#x673A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B8C;&#x6210;&#x4E3B;&#x4ECE;&#x5207;&#x6362;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x4ECE;&#x5E93;&#x5B95;&#x673A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;MHA&#x901A;&#x5E38;&#x662F;&#x65E0;&#x80FD;&#x4E3A;&#x529B;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x901A;&#x5E38;&#x90FD;&#x4F1A;&#x5728;MHA&#x8FDB;&#x884C;&#x6539;&#x9020;&#xFF0C;&#x4F7F;&#x5176;&#x652F;&#x6301;&#x66F4;&#x591A;&#x7684;HA&#x80FD;&#x529B;&#x8981;&#x6C42;&#x3002;</p>
<p>&#x4ECE;Scalable&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x4F8B;&#x5982;&#x8BFB;qps&#x5B9E;&#x5728;&#x592A;&#x9AD8;&#xFF0C;&#x9700;&#x8981;&#x52A0;&#x4E00;&#x4E9B;&#x4ECE;&#x5E93;&#xFF0C;&#x6765;&#x5206;&#x62C5;&#x8BFB;&#x6D41;&#x91CF;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;HA&#xFF0C;&#x8FD8;&#x662F;Scalable&#xFF0C;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;(&#x4E0D;&#x8BBA;&#x662F;proxy&#x6216;&#x8005;smart-client)&#x6765;&#x8BF4;&#xFF0C;&#x53EA;&#x662F;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x66F4;&#x3002; </p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x4F1A;&#x5C06;&#x6240;&#x6709;&#x7684;&#x914D;&#x7F6E;&#x53D8;&#x66F4;&#x4FE1;&#x606F;&#x5199;&#x5230;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#xFF0C;&#x7136;&#x540E;&#x914D;&#x7F6E;&#x5FC3;&#x4E2D;&#x76D1;&#x542C;&#x8FD9;&#x4E2A;&#x914D;&#x7F6E;&#x7684;&#x53D8;&#x66F4;&#xFF0C;&#x4F8B;&#x5982;&#x4E3B;&#x4ECE;&#x5207;&#x6362;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x628A;&#x6700;&#x65B0;&#x7684;&#x4E3B;&#x4ECE;&#x4FE1;&#x606F;&#x8BBE;&#x7F6E;&#x5230;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#xFF1B;&#x589E;&#x52A0;&#x4ECE;&#x5E93;&#xFF0C;&#x628A;&#x65B0;&#x4ECE;&#x5E93;ip&#x3001;port&#x7B49;&#x4FE1;&#x606F;&#x653E;&#x5230;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#x3002;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x901A;&#x8FC7;&#x5BF9;&#x8FD9;&#x4E9B;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x53D8;&#x66F4;&#x8FDB;&#x884C;&#x76D1;&#x542C;&#xFF0C;&#x5F53;&#x914D;&#x7F6E;&#x53D1;&#x751F;&#x53D8;&#x66F4;&#x65F6;&#xFF0C;&#x5B9E;&#x65F6;&#x7684;&#x5E94;&#x7528;&#x6700;&#x65B0;&#x7684;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4E00;&#x4E2A;&#x7B80;&#x5316;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x9AD8;&#x53EF;&#x7528;&#x67B6;&#x6784;&#x901A;&#x5E38;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A; </p>
<p><img src="../assets/1035.png" alt=""></p>
<p>&#x76D1;&#x63A7;&#x670D;&#x52A1;&#x5BF9;&#x96C6;&#x7FA4;&#x8FDB;&#x884C;&#x76D1;&#x63A7;&#xFF0C;&#x5F53;&#x53D1;&#x751F;&#x53D8;&#x66F4;&#x65F6;&#xFF0C;&#x5C06;&#x53D8;&#x66F4;&#x7684;&#x4FE1;&#x606F;push&#x5230;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;(proxy&#x6216;smart-client)&#x63A5;&#x6536;&#x5230;&#x914D;&#x7F6E;&#x53D8;&#x66F4;&#xFF0C;&#x5E94;&#x7528;&#x6700;&#x65B0;&#x7684;&#x914D;&#x7F6E;&#x3002;&#x800C;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x57FA;&#x672C;&#x662F;&#x65E0;&#x611F;&#x77E5;&#x7684;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x4F8B;&#x5982;&#x767E;&#x5EA6;&#x7684;disconf&#x3001;&#x963F;&#x91CC;&#x7684;diamond&#x3001;&#x70B9;&#x8BC4;&#x5F00;&#x6E90;&#x7684;lion&#x3001;&#x643A;&#x7A0B;&#x5F00;&#x6E90;&#x7684;apollo&#x7B49;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;etcd&#x3001;consul&#x3002;&#x901A;&#x5E38;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5386;&#x53F2;&#x5305;&#x88B1;&#x7684;&#x8BDD;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x643A;&#x7A0B;&#x5F00;&#x6E90;&#x7684;apollo&#x3002;</p>
<p>&#x7279;&#x522B;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x901A;&#x5E38;&#x76D1;&#x63A7;&#x670D;&#x52A1;&#x76D1;&#x63A7;&#x5230;&#x96C6;&#x7FA4;&#x4FE1;&#x606F;&#x53D8;&#x66F4;&#xFF0C;&#x63A8;&#x9001;&#x5230;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#xFF0C;&#x518D;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x5FC5;&#x7136;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x5EF6;&#x8FDF;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x573A;&#x666F;&#xFF0C;&#x4F8B;&#x5982;&#x4E3B;&#x4ECE;&#x5207;&#x6362;&#xFF0C;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x505A;&#x5230;&#x5F7B;&#x5E95;&#x7684;&#x4E1A;&#x52A1;&#x65E0;&#x611F;&#x77E5;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5BF9;&#x4E8E;&#x591A;&#x4E2A;&#x4ECE;&#x5E93;&#x4E2D;&#xFF0C;&#x67D0;&#x4E2A;&#x4ECE;&#x5E93;&#x5B95;&#x673A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x662F;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x4E1A;&#x52A1;&#x65E0;&#x611F;&#x77E5;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x67D0;&#x4E2A;&#x4ECE;&#x5E93;&#x5931;&#x8D25;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x81EA;&#x52A8;&#x4ECE;&#x5176;&#x4ED6;&#x6B63;&#x5E38;&#x7684;&#x4ECE;&#x5E93;&#x8FDB;&#x884C;&#x91CD;&#x8BD5;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x4E0A;&#x56FE;&#x4E2D;&#x7684;HA&#x65B9;&#x6848;&#x5F3A;&#x4F9D;&#x8D56;&#x4E8E;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#xFF0C;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x96C6;&#x7FA4;&#x4E0A;&#x5EFA;&#x7ACB;&#x4E86;&#x5F88;&#x591A;&#x5E93;&#xFF0C;&#x8FD9;&#x4E2A;&#x96C6;&#x7FA4;&#x53D1;&#x751F;&#x53D8;&#x66F4;&#x65F6;&#xFF0C;&#x5C06;&#x4F1A;&#x5B58;&#x5728;&#x5927;&#x91CF;&#x7684;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x9700;&#x8981;&#x63A8;&#x9001;&#x3002;&#x53C8;&#x6216;&#x8005;&#xFF0C;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x96C6;&#x7FA4;&#x662F;&#x591A;&#x673A;&#x623F;&#x90E8;&#x7F72;&#x7684;&#xFF0C;&#x5728;&#x67D0;&#x4E2A;&#x673A;&#x623F;&#x6574;&#x4F53;&#x5B95;&#x673A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;(&#x4F8B;&#x5982;&#x5149;&#x7EA4;&#x88AB;&#x6316;&#x65AD;&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x673A;&#x623F;&#x5B95;&#x673A;&#x6F14;&#x7EC3;)&#xFF0C;&#x4E5F;&#x4F1A;&#x5B58;&#x5728;&#x5927;&#x91CF;&#x7684;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x9700;&#x8981;&#x63A8;&#x9001;&#x3002;&#x5982;&#x679C;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#xFF0C;&#x63A8;&#x9001;&#x6709;&#x5EF6;&#x8FDF;&#xFF0C;&#x4E1A;&#x52A1;&#x4F1A;&#x6709;&#x975E;&#x5E38;&#x660E;&#x663E;&#x7684;&#x611F;&#x77E5;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;HA&#x4FDD;&#x969C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6839;&#x636E;&#x6570;&#x636E;&#x5E93;&#x8FD4;&#x56DE;&#x5F02;&#x5E38;&#x7684;sqlstate&#x548C;vendor code&#xFF0C;&#x5224;&#x65AD;&#x5F02;&#x5E38;&#x7684;&#x4E25;&#x91CD;&#x7EA7;&#x522B;&#xFF0C;&#x786E;&#x5B9A;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x4F8B;&#x80FD;&#x5426;&#x6B63;&#x5E38;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#x6B63;&#x5E38;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x5219;&#x81EA;&#x52A8;&#x5C06;&#x5176;&#x8FDB;&#x884C;&#x9694;&#x79BB;&#xFF0C;&#x5E76;&#x542F;&#x52A8;&#x5F02;&#x6B65;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x68C0;&#x6D4B;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x4F8B;&#x662F;&#x5426;&#x6062;&#x590D;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5F88;&#x591A;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x4E5F;&#x4F1A;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x9650;&#x6D41;&#x548C;&#x964D;&#x7EA7;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x8BA1;&#x7B97;sql&#x7684;&#x552F;&#x4E00;&#x6807;&#x8BC6;(&#x6709;&#x4E9B;&#x79F0;&#x4E4B;&#x4E3A;sql&#x6307;&#x7EB9;)&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x70C2;sql&#xFF0C;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x5E93;&#x538B;&#x529B;&#x53D8;&#x5927;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x65F6;&#x7684;&#x8FDB;&#x884C;&#x62E6;&#x622A;&#xFF0C;&#x76F4;&#x63A5;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF0C;&#x4E0D;&#x8BA9;&#x8FD9;&#x4E9B;sql&#x6253;&#x5230;&#x540E;&#x7AEF;&#x6570;&#x636E;&#x5E93;&#x4E0A;&#x53BB;&#x3002; </p>
<h2 id="4-&#x5206;&#x5E93;&#x5206;&#x8868;&#x6838;&#x5FC3;&#x8981;&#x70B9;">4. &#x5206;&#x5E93;&#x5206;&#x8868;&#x6838;&#x5FC3;&#x8981;&#x70B9;</h2>
<p>&#x4ECE;&#x4E1A;&#x52A1;&#x5F00;&#x53D1;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x5176;&#x4E0D;&#x5173;&#x5FC3;&#x5E95;&#x5C42;&#x662F;&#x5426;&#x662F;&#x5206;&#x5E93;&#x5206;&#x8868;&#x4E86;&#xFF0C;&#x5176;&#x8FD8;&#x662F;&#x5E0C;&#x671B;&#x60F3;&#x64CD;&#x4F5C;&#x5355;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x4F8B;&#x90A3;&#x6837;&#x7F16;&#x5199;sql&#xFF0C;&#x90A3;&#x4E48;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x5C31;&#x9700;&#x8981;&#x5BF9;&#x5176;&#x5C4F;&#x853D;&#x6240;&#x6709;&#x5E95;&#x5C42;&#x7684;&#x590D;&#x6742;&#x903B;&#x8F91;&#x3002;</p>
<p>&#x4E0B;&#x56FE;&#x6F14;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x8868;(user&#x8868;)&#x5728;&#x5206;&#x5E93;&#x5206;&#x8868;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x5185;&#x90E8;&#x662F;&#x5982;&#x4F55;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x6279;&#x91CF;&#x63D2;&#x5165;sql&#x7684;&#xFF1A;</p>
<p><img src="../assets/1036.png" alt=""></p>
<p>&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x4E3B;&#x8981;&#x5BF9;&#x5E94;&#x7528;&#x5C4F;&#x853D;&#x4E86;&#x4EE5;&#x4E0B;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<ul>
<li>sql&#x89E3;&#x6790;&#xFF1A;&#x9996;&#x5148;&#x5BF9;sql&#x8FDB;&#x884C;&#x89E3;&#x6790;&#xFF0C;&#x5F97;&#x5230;&#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x6811;&#xFF0C;&#x4ECE;&#x8BED;&#x6CD5;&#x6811;&#x4E2D;&#x5F97;&#x5230;&#x4E00;&#x4E9B;&#x5173;&#x952E;sql&#x4FE1;&#x606F;</li>
<li>sql&#x8DEF;&#x7531;&#xFF1A;sql&#x8DEF;&#x7531;&#x5305;&#x62EC;&#x5E93;&#x8DEF;&#x7531;&#x548C;&#x8868;&#x8DEF;&#x7531;&#x3002;&#x5E93;&#x8DEF;&#x7531;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#x5E94;&#x8BE5;&#x64CD;&#x4F5C;&#x54EA;&#x4E2A;&#x5206;&#x5E93;&#xFF0C;&#x8868;&#x8DEF;&#x7531;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#x5E94;&#x8BE5;&#x64CD;&#x4F5C;&#x54EA;&#x4E2A;&#x5206;&#x8868;&#x3002;</li>
<li>sql&#x6539;&#x5199;&#xFF1A;&#x5C06;sql&#x6539;&#x5199;&#x6210;&#x6B63;&#x786E;&#x7684;&#x6267;&#x884C;&#x65B9;&#x5F0F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x6279;&#x91CF;&#x63D2;&#x5165;sql&#xFF0C;&#x540C;&#x65F6;&#x63D2;&#x5165;4&#x6761;&#x8BB0;&#x5F55;&#x3002;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x7528;&#x6237;&#x5E0C;&#x671B;4&#x4E2A;&#x8BB0;&#x5F55;&#x5206;&#x8868;&#x5B58;&#x50A8;&#x5230;&#x4E00;&#x4E2A;&#x5206;&#x8868;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x5BF9;sql&#x8FDB;&#x884C;&#x6539;&#x5199;&#x6210;4&#x6761;sql&#xFF0C;&#x6BCF;&#x4E2A;sql&#x90FD;&#x53EA;&#x80FD;&#x63D2;&#x5165;1&#x6761;&#x8BB0;&#x5F55;&#x3002;</li>
<li>sql&#x6267;&#x884C;&#xFF1A;&#x4E00;&#x6761;sql&#x7ECF;&#x8FC7;&#x6539;&#x5199;&#x540E;&#x53EF;&#x80FD;&#x53D8;&#x6210;&#x4E86;&#x591A;&#x6761;sql&#xFF0C;&#x4E3A;&#x4E86;&#x63D0;&#x5347;&#x6548;&#x7387;&#x5E94;&#x8BE5;&#x5E76;&#x53D1;&#x7684;&#x53BB;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6309;&#x7167;&#x987A;&#x5E8F;&#x9010;&#x4E00;&#x6267;&#x884C;</li>
<li>&#x7ED3;&#x679C;&#x96C6;&#x5408;&#x5E76;&#xFF1A;&#x6BCF;&#x4E2A;sql&#x6267;&#x884C;&#x4E4B;&#x540E;&#xFF0C;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x7ED3;&#x679C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x7ED3;&#x679C;&#x96C6;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#xFF0C;&#x4ECE;&#x800C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7ED3;&#x679C;&#x3002; </li>
</ul>
<h3 id="41-sql&#x89E3;&#x6790;">4.1 SQL&#x89E3;&#x6790;</h3>
<p>&#x7528;&#x6237;&#x6267;&#x884C;&#x53EA;&#x662F;&#x4E00;&#x6761;sql&#xFF0C;&#x5E76;&#x4F20;&#x5165;&#x76F8;&#x5173;&#x53C2;&#x6570;&#x3002;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x5185;&#x90E8;&#x9700;&#x8981;&#x901A;&#x8FC7;sql&#x89E3;&#x6790;&#x5668;&#xFF0C;&#x5BF9;sql&#x8FDB;&#x884C;&#x89E3;&#x6790;&#x3002;&#x53EF;&#x4EE5;&#x5C06;sql&#x89E3;&#x6790;&#xFF0C;&#x7C7B;&#x6BD4;&#x4E3A;xml&#x89E3;&#x6790;&#xFF0C;xml&#x89E3;&#x6790;&#x7684;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x662F;&#x5F97;&#x5230;&#x4E00;&#x4E2A;document&#x5BF9;&#x8C61;&#xFF0C;&#x800C;sql&#x89E3;&#x6790;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x6811;(AST)&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x8BED;&#x6CD5;&#x6811;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x83B7;&#x53D6;&#x5230;sql&#x7684;&#x4E00;&#x4E9B;&#x6267;&#x884C;&#xFF0C;&#x4F8B;&#x5982;&#x5F53;&#x524D;&#x6267;&#x884C;&#x7684;sql&#x7C7B;&#x578B;&#xFF0C;&#x67E5;&#x8BE2;&#x4E86;&#x90A3;&#x4E9B;&#x5B57;&#x6BB5;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x8868;&#x540D;&#xFF0C;where&#x6761;&#x4EF6;&#xFF0C;sql&#x7684;&#x53C2;&#x6570;&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;sql&#x89E3;&#x6790;&#xFF0C;&#x5185;&#x90E8;&#x9700;&#x8981;&#x7ECF;&#x8FC7;&#x8BCD;&#x6CD5;(lex)&#x89E3;&#x6790;&#x548C;&#x8BED;&#x6CD5;(Syntax)&#x89E3;&#x6790;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x8BED;&#x6CD5;&#x6811;&#x3002; </p>
<p><img src="../assets/1037.png" alt=""></p>
<p>SQL&#x89E3;&#x6790;&#x5668;&#x7684;&#x5185;&#x90E8;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#x5BF9;&#x4E1A;&#x52A1;&#x540C;&#x5B66;&#x662F;&#x5C4F;&#x853D;&#x7684;&#xFF0C;&#x4E1A;&#x52A1;&#x540C;&#x5B66;&#x4E5F;&#x611F;&#x77E5;&#x4E0D;&#x5230;&#x3002;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x91C7;&#x7528;&#x4E86;&#x7B2C;&#x4E09;&#x65B9;&#x5F00;&#x6E90;&#x7684;sql&#x89E3;&#x6790;&#x5668;&#xFF0C;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x81EA;&#x7814;sql&#x89E3;&#x6790;&#x5668;&#x3002;&#x4F8B;&#x5982;mycat&#x3001;zebra&#x91C7;&#x7528;&#x7684;&#x90FD;&#x662F;druid&#x89E3;&#x6790;&#x5668;&#xFF0C;shard-jdbc&#x4E00;&#x5F00;&#x59CB;&#x4E5F;&#x7528;&#x7684;&#x662F;druid&#x89E3;&#x6790;&#x5668;&#xFF0C;&#x540E;&#x9762;&#x81EA;&#x7814;&#x4E86;&#x89E3;&#x6790;&#x5668;&#x3002;&#x76EE;&#x524D;&#x8F83;&#x4E3A;&#x6D41;&#x884C;&#x7684;sql&#x89E3;&#x6790;&#x5668;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>FoundationDB SQL Parser</li>
<li>Jsqlparser</li>
<li>Druid SQL Parser</li>
</ul>
<p>&#x5176;&#x4E2D;&#xFF0C;&#x5176;&#x4E2D;Fdbparser&#x548C;jsqlparser&#x90FD;&#x662F;&#x57FA;&#x4E8E;javacc&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<p>mycat&#x56E2;&#x961F;&#x66FE;&#x7ECF;&#x505A;&#x8FC7;&#x4E00;&#x4E2A;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#xFF0C;druid&#x89E3;&#x6790;&#x5668;&#x7684;&#x89E3;&#x6790;&#x6027;&#x80FD;&#x901A;&#x5E38;&#x80FD;&#x8FBE;&#x5230;&#x57FA;&#x4E8E;javacc&#x751F;&#x6210;&#x7684;sql&#x89E3;&#x6790;&#x5668;10~20&#x500D;&#x3002;&#x672C;&#x4EBA;&#x4E5F;&#x8FDB;&#x884C;&#x8FC7;&#x7C7B;&#x4F3C;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x5F97;&#x51FA;&#x7684;&#x7ED3;&#x8BBA;&#x57FA;&#x672C;&#x4E00;&#x81F4;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x5BF9;&#x6BD4;&#x4E0D;&#x540C;&#x7684;sql&#x89E3;&#x6790;&#x5668;&#x7684;&#x597D;&#x574F;&#x5462;&#xFF1F;&#x4E3B;&#x8981;&#x662F;&#x8003;&#x8651;&#x4EE5;&#x4E0B;&#x4E24;&#x70B9;&#xFF1A;</p>
<p><strong>&#x89E3;&#x6790;&#x6027;&#x80FD;&#xFF1A;</strong>druid&#x6700;&#x597D;&#x3002;</p>
<p>druid&#x91C7;&#x7528;&#x7684;&#x662F;&#x9884;&#x6D4B;&#x5206;&#x6790;&#x6CD5;&#xFF0C;&#x5B83;&#x53EA;&#x9700;&#x8981;&#x4ECE;&#x5B57;&#x7B26;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5230;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x904D;&#x5386;&#x4E00;&#x904D;&#xFF0C;&#x5C31;&#x540C;&#x65F6;&#x5B8C;&#x6210;&#x4E86;&#x8BCD;&#x6CD5;&#x89E3;&#x6790;&#x548C;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#xFF0C;&#x8BED;&#x6CD5;&#x6811;&#x4E5F;&#x5DF2;&#x7ECF;&#x6784;&#x9020;&#x5B8C;&#x6210;&#x3002;</p>
<p><strong>&#x6570;&#x636E;&#x5E93;&#x65B9;&#x8A00;&#xFF1A;</strong>druid&#x652F;&#x6301;&#x7684;&#x6700;&#x591A;&#x3002;</p>
<p>SQL-92&#x3001;SQL-99&#x7B49;&#x90FD;&#x662F;&#x6807;&#x51C6;SQL&#xFF0C;mysql/oracle/pg/sqlserver/odps&#x7B49;&#x90FD;&#x662F;&#x65B9;&#x8A00;&#xFF0C;sql-parser&#x9700;&#x8981;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x8A00;&#x8FDB;&#x884C;&#x7279;&#x522B;&#x5904;&#x7406;&#x3002;Druid&#x7684;sql parser&#x662F;&#x76EE;&#x524D;&#x652F;&#x6301;&#x5404;&#x79CD;&#x6570;&#x636E;&#x8BED;&#x6CD5;&#x6700;&#x5B8C;&#x5907;&#x7684;SQL Parser&#x3002;</p>
<blockquote>
<p>&#x6CE8;&#xFF1A;&#x8FD9;&#x91CC;&#x8BF4;&#x7684;&#x4EC5;&#x4EC5;&#x662F;&#x57FA;&#x4E8E;Java&#x5B9E;&#x73B0;&#x7684;SQL&#x89E3;&#x6790;&#x5668;&#xFF0C;druid&#x662F;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x3002;&#x5927;&#x90E8;&#x5206;&#x540C;&#x5B66;&#x53EF;&#x80FD;&#x77E5;&#x9053;druid&#x662F;&#x4E00;&#x4E2A;&#x4E3A;&#x76D1;&#x63A7;&#x800C;&#x751F;&#x7684;&#x8FDE;&#x63A5;&#x6C60;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;druid&#x53E6;&#x4E00;&#x5927;&#x7279;&#x6027;&#xFF0C;&#x5C31;&#x662F;&#x5B83;&#x7684;SQL&#x89E3;&#x6790;&#x5668;&#x3002;&#x5F88;&#x591A;&#x5F00;&#x6E90;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x4F8B;&#x5982;zebra&#x3001;sharding-jdbc&#x7B49;&#xFF0C;&#x90FD;&#x4F7F;&#x7528;&#x4E86;druid&#x89E3;&#x6790;&#x5668;&#x3002;(sharding-jdbc&#x540E;&#x6765;&#x81EA;&#x7814;&#x4E86;&#x89E3;&#x6790;&#x5668;)&#x3002;&#x867D;&#x7136;SQL&#x89E3;&#x6790;&#x662F;druid&#x7684;&#x4E00;&#x5927;&#x4EAE;&#x70B9;&#xFF0C;&#x4E0D;&#x8FC7;github&#x4E0A;&#x4E5F;&#x56E0;&#x4E3A;SQL&#x89E3;&#x6790;&#x7684;bug&#xFF0C;&#x6536;&#x5230;&#x4E86;&#x4E0D;&#x5C11;issue&#x3002;</p>
</blockquote>
<h3 id="42-sql&#x8DEF;&#x7531;">4.2 SQL&#x8DEF;&#x7531;</h3>
<p>&#x8DEF;&#x7531;&#x89C4;&#x5219;&#x662F;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x5176;&#x89C4;&#x5B9A;&#x4E86;&#x6570;&#x636E;&#x5E94;&#x8BE5;&#x6309;&#x7167;&#x600E;&#x6837;&#x7684;&#x89C4;&#x5219;&#x8DEF;&#x7531;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x5E93;&#x5206;&#x8868;&#x4E2D;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x6765;&#x8BF4;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x652F;&#x6301;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x4EFB;&#x4F55;&#x8DEF;&#x7531;&#x89C4;&#x5219;&#x7684;&#x3002;&#x8DEF;&#x7531;&#x89C4;&#x5219;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x811A;&#x672C;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x901A;&#x8FC7;&#x5185;&#x7F6E;&#x7684;&#x811A;&#x672C;&#x5F15;&#x64CE;&#x5BF9;&#x8868;&#x8FBE;&#x5F0F;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#xFF0C;&#x786E;&#x5B9A;&#x6700;&#x7EC8;&#x8981;&#x64CD;&#x4F5C;&#x54EA;&#x4E9B;&#x5206;&#x5E93;&#x3001;&#x5206;&#x8868;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x8DEF;&#x7531;&#x89C4;&#x5219;&#x5305;&#x62EC;&#x54C8;&#x5E0C;&#x53D6;&#x6A21;&#xFF0C;&#x6309;&#x7167;&#x65E5;&#x671F;&#x7B49;&#x3002;</p>
<p>&#x4E0B;&#x56FE;&#x5C55;&#x793A;&#x4E86;user&#x8868;&#x8FDB;&#x884C;&#x5206;&#x5E93;&#x5206;&#x8868;&#x540E;(2&#x4E2A;&#x5206;&#x5E93;&#xFF0C;&#x6BCF;&#x4E2A;&#x5206;&#x5E93;2&#x4E2A;&#x5206;&#x8868;)&#xFF0C;&#x5E76;&#x5982;&#x4F55;&#x6839;&#x636E;id&#x8FDB;&#x884C;&#x8DEF;&#x7531;&#x7684;&#x89C4;&#x5219;&#xFF1A; </p>
<p><img src="../assets/1038.png" alt=""></p>
<p>&#x8DEF;&#x7531;&#x5206;&#x5219;&#x5206;&#x4E3A;&#xFF1A;</p>
<ul>
<li>&#x5E93;&#x89C4;&#x5219;&#xFF1A;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x5230;&#x54EA;&#x4E00;&#x4E2A;&#x5206;&#x5E93;</li>
<li>&#x8868;&#x89C4;&#x5219;&#xFF1A;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x5230;&#x54EA;&#x4E00;&#x4E2A;&#x5206;&#x8868;</li>
</ul>
<p>&#x5728;&#x4E0A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;id&#x6765;&#x4F5C;&#x4E3A;&#x8BA1;&#x7B97;&#x5206;&#x8868;&#x3001;&#x5206;&#x8868;&#xFF0C;&#x56E0;&#x6B64;&#x628A;id&#x5B57;&#x6BB5;&#x5C31;&#x79F0;&#x4E4B;&#x4E3A;&#x8DEF;&#x7531;&#x5B57;&#x6BB5;&#xFF0C;&#x6216;&#x8005;&#x5206;&#x533A;&#x5B57;&#x6BB5;&#x3002;</p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x4E0D;&#x7BA1;&#x6267;&#x884C;&#x7684;&#x662F;INSERT&#x3001;UPDATE&#x3001;DELETE&#x3001;SELECT&#x8BED;&#x53E5;&#xFF0C;SQL&#x4E2D;&#x90FD;&#x5E94;&#x8BE5;&#x5305;&#x542B;&#x8FD9;&#x4E2A;&#x8DEF;&#x7531;&#x5B57;&#x6BB5;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x5BF9;&#x4E8E;&#x63D2;&#x5165;&#x8BED;&#x53E5;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x4E0D;&#x77E5;&#x9053;&#x63D2;&#x5165;&#x5230;&#x54EA;&#x4E2A;&#x5206;&#x5E93;&#x6216;&#x8005;&#x5206;&#x8868;&#xFF1B;&#x5BF9;&#x4E8E;UPDATE&#x3001;DELETE&#x3001;SELECT&#x8BED;&#x53E5;&#x800C;&#x8A00;&#xFF0C;&#x5219;&#x66F4;&#x4E3A;&#x4E25;&#x91CD;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x77E5;&#x9053;&#x64CD;&#x4F5C;&#x54EA;&#x4E2A;&#x5206;&#x5E93;&#x5206;&#x8868;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x5FC5;&#x987B;&#x8981;&#x5BF9;&#x6240;&#x6709;&#x5206;&#x8868;&#x90FD;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;SELECT&#x805A;&#x5408;&#x6240;&#x6709;&#x5206;&#x8868;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6781;&#x5BB9;&#x6613;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#xFF0C;UPDATE&#x3001;DELETE&#x66F4;&#x65B0;&#x3001;&#x5220;&#x9664;&#x6240;&#x6709;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x8BEF;&#x66F4;&#x65B0;&#x3001;&#x5220;&#x9664;&#x6570;&#x636E;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x5BF9;&#x4E8E;SQL&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x4E9B;&#x9650;&#x5236;&#xFF0C;&#x4F8B;&#x5982;UPDATE&#x3001;DELETE&#x5FC5;&#x987B;&#x8981;&#x5E26;&#x4E0A;&#x5206;&#x533A;&#x5B57;&#x6BB5;&#xFF0C;&#x6216;&#x8005;&#x6307;&#x5B9A;&#x8FC7;&#x6EE4;&#x6761;&#x4EF6;&#x3002; </p>
<h3 id="43-sql&#x6539;&#x5199;">4.3 SQL&#x6539;&#x5199;</h3>
<p>&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x4ECB;&#x7ECD;&#x8FC7;&#xFF0C;&#x5982;&#x4E00;&#x4E2A;&#x6279;&#x91CF;&#x63D2;&#x5165;&#x8BED;&#x53E5;&#xFF0C;&#x5982;&#x679C;&#x8BB0;&#x5F55;&#x8981;&#x63D2;&#x5165;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x5E93;&#x5206;&#x8868;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x5BF9;SQL&#x8FDB;&#x884C;&#x6539;&#x5199;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5C06;&#x4EE5;&#x4E0B;SQL</p>
<pre><code class="lang-sql"><span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> <span class="hljs-keyword">user</span>(<span class="hljs-keyword">id</span>,<span class="hljs-keyword">name</span>) <span class="hljs-keyword">values</span> (<span class="hljs-number">1</span>,&#x201D;tianshouzhi&#x201D;),(<span class="hljs-number">2</span>,&#x201D;huhuamin&#x201D;), (<span class="hljs-number">3</span>,&#x201D;wanghanao&#x201D;),(<span class="hljs-number">4</span>,&#x201D;luyang&#x201D;)
</code></pre>
<p>&#x6539;&#x5199;&#x4E3A;&#xFF1A;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> user_1(<span class="hljs-keyword">id</span>,<span class="hljs-keyword">name</span>) <span class="hljs-keyword">values</span> (<span class="hljs-number">1</span>,&#x201D;tianshouzhi&#x201D;)
<span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> user_2(<span class="hljs-keyword">id</span>,<span class="hljs-keyword">name</span>) <span class="hljs-keyword">values</span> (<span class="hljs-number">2</span>,&#x201D;huhuamin&#x201D;)
<span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> user_3(<span class="hljs-keyword">id</span>,<span class="hljs-keyword">name</span>) <span class="hljs-keyword">values</span> (<span class="hljs-number">3</span>,&#x201D;wanghanao&#x201D;)
<span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> user_0(<span class="hljs-keyword">id</span>,<span class="hljs-keyword">name</span>) <span class="hljs-keyword">values</span>  (<span class="hljs-number">4</span>,&#x201D;luyang&#x201D;)
</code></pre>
<p>&#x8FD9;&#x91CC;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6848;&#x4F8B;&#xFF0C;&#x901A;&#x5E38;&#x5BF9;&#x4E8E;INSERT&#x3001;UPDATE&#x3001;DELETE&#x7B49;&#xFF0C;&#x6539;&#x5199;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#x3002;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x7684;&#x662F;SELECT&#x8BED;&#x53E5;&#x7684;&#x6539;&#x5199;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x7684;SELECT&#x8BED;&#x53E5;&#xFF0C;&#x6539;&#x5199;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x4F18;&#x5316;&#xFF0C;&#x4F8B;&#x5982;&#x5C06;&#x5B50;&#x67E5;&#x8BE2;&#x6539;&#x6210;JOIN&#xFF0C;&#x8FC7;&#x6EE4;&#x6761;&#x4EF6;&#x4E0B;&#x63A8;&#x7B49;&#x3002;&#x56E0;&#x4E3A;SQL&#x6539;&#x5199;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x591A;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x5E76;&#x4E0D;&#x652F;&#x6301;&#x590D;&#x6742;&#x7684;SQL(&#x901A;&#x5E38;&#x6709;&#x4E00;&#x4E2A;&#x652F;&#x6301;&#x7684;SQL)&#xFF0C;&#x53EA;&#x80FD;&#x652F;&#x6301;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;OLTP&#x573A;&#x666F;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x4E0D;&#x6EE1;&#x8DB3;&#x4E8E;&#x53EA;&#x652F;&#x6301;OLTP&#xFF0C;&#x5728;&#x8FC8;&#x5411;OLAP&#x7684;&#x65B9;&#x5411;&#x4E0A;&#x8FDB;&#x884C;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x52AA;&#x529B;&#x3002;&#x4F8B;&#x5982;&#x963F;&#x91CC;&#x7684;TDDL&#x3001;&#x8682;&#x8681;&#x7684;Zdal&#x3001;&#x5927;&#x4F17;&#x70B9;&#x8BC4;&#x7684;zebra&#xFF0C;&#x90FD;&#x5F15;&#x5165;&#x4E86;apache calcite&#xFF0C;&#x5C1D;&#x8BD5;&#x5BF9;&#x590D;&#x6742;&#x7684;&#x67E5;&#x8BE2;SQL(&#x4F8B;&#x5982;&#x5D4C;&#x5957;&#x5B50;&#x67E5;&#x8BE2;&#xFF0C;join&#x7B49;)&#x8FDB;&#x884C;&#x652F;&#x6301;&#xFF0C;&#x901A;&#x8FC7;&#x8FC7;&#x6EE4;&#x6761;&#x4EF6;&#x4E0B;&#x63A8;&#xFF0C;&#x6D41;&#x5F0F;&#x8BFB;&#x53D6;&#xFF0C;&#x5E76;&#x7ED3;&#x5408;RBO(&#x57FA;&#x4E8E;&#x89C4;&#x5219;&#x7684;&#x4F18;&#x5316;)&#x3001;CBO(&#x57FA;&#x4E8E;&#x4EE3;&#x4EF7;&#x7684;&#x4F18;&#x5316;)&#x6765;&#x5BF9;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;OLAP&#x573A;&#x666F;&#x8FDB;&#x884C;&#x652F;&#x6301;&#x3002;</p>
<h3 id="44-sql&#x6267;&#x884C;">4.4 SQL&#x6267;&#x884C;</h3>
<p>&#x5F53;&#x7ECF;&#x8FC7;SQL&#x6539;&#x5199;&#x9636;&#x6BB5;&#x540E;&#xFF0C;&#x4F1A;&#x4EA7;&#x751F;&#x591A;&#x4E2A;SQL&#xFF0C;&#x9700;&#x8981;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x7247;&#x4E0A;&#x53BB;&#x6267;&#x884C;&#xFF0C;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x4F1A;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6C60;&#xFF0C;&#x5C06;&#x6BCF;&#x4E2A;SQL&#x5305;&#x88C5;&#x6210;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x63D0;&#x4EA4;&#x5230;&#x7EBF;&#x7A0B;&#x6C60;&#x91CC;&#x9762;&#x5E76;&#x53D1;&#x7684;&#x53BB;&#x6267;&#x884C;&#xFF0C;&#x4EE5;&#x63D0;&#x5347;&#x6548;&#x7387;&#x3002;</p>
<p><img src="../assets/1039.png" alt=""></p>
<p><strong>&#x8FD9;&#x4E9B;&#x6267;&#x884C;&#x7684;SQL&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E2A;&#x5931;&#x8D25;&#xFF0C;&#x5219;&#x6574;&#x4F53;&#x5931;&#x8D25;&#xFF0C;&#x8FD4;&#x56DE;&#x5F02;&#x5E38;&#x7ED9;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x3002;</strong></p>
<h3 id="45-&#x7ED3;&#x679C;&#x96C6;&#x5408;&#x5E76;">4.5 &#x7ED3;&#x679C;&#x96C6;&#x5408;&#x5E76;</h3>
<p>&#x7ED3;&#x679C;&#x96C6;&#x5408;&#x5E76;&#xFF0C;&#x662F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x4E00;&#x5927;&#x96BE;&#x70B9;&#xFF0C;&#x9700;&#x8981;case by case&#x7684;&#x5206;&#x6790;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x8003;&#x8651;&#x5B9E;&#x73B0;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x4EE5;&#x53CA;&#x6267;&#x884C;&#x7684;&#x6548;&#x7387;&#x95EE;&#x9898;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x7684;SQL&#xFF0C;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x652F;&#x6301;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<p><strong>&#x5BF9;&#x4E8E;&#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#xFF1A;</strong>&#x5927;&#x90E8;&#x5206;&#x4E2D;&#x95F4;&#x4EF6;&#x90FD;&#x652F;&#x6301;=&#x3001;IN&#x4F5C;&#x4E3A;&#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#xFF0C;&#x4E14;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x5206;&#x533A;&#x5B57;&#x6BB5;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;NIT IN&#x3001;BETWEEN&#x2026;AND&#x3001;LIKE,NOT LIKE&#x7B49;&#xFF0C;&#x53EA;&#x80FD;&#x4F5C;&#x4E3A;&#x666E;&#x901A;&#x7684;&#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#xFF0C;&#x56E0;&#x4E3A;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x6761;&#x4EF6;&#xFF0C;&#x65E0;&#x6CD5;&#x8BB0;&#x5F55;&#x5230;&#x5E95;&#x662F;&#x5728;&#x54EA;&#x4E2A;&#x5206;&#x5E93;&#x6216;&#x8005;&#x5206;&#x8868;&#xFF0C;&#x53EA;&#x80FD;&#x5168;&#x8868;&#x626B;&#x63CF;&#x3002;</p>
<p><strong>&#x805A;&#x5408;&#x51FD;&#x6570;&#xFF1A;</strong>&#x5927;&#x90E8;&#x5206;&#x4E2D;&#x95F4;&#x4EF6;&#x90FD;&#x652F;&#x6301;MAX&#x3001;MIN&#x3001;COUNT&#x3001;SUM&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;AVG&#x53EF;&#x80FD;&#x53EA;&#x662F;&#x90E8;&#x5206;&#x652F;&#x6301;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x51FD;&#x6570;&#x5D4C;&#x5957;&#x3001;&#x5206;&#x7EC4;(GROUP BY)&#x805A;&#x5408;&#xFF0C;&#x53EF;&#x80FD;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x4E0D;&#x652F;&#x6301;&#x3002;</p>
<p><strong>&#x5B50;&#x67E5;&#x8BE2;&#xFF1A;</strong>&#x5206;&#x4E3A;FROM&#x90E8;&#x5206;&#x7684;&#x5B50;&#x67E5;&#x8BE2;&#x548C;WHERE&#x90E8;&#x5206;&#x7684;&#x5B50;&#x67E5;&#x8BE2;&#x3002;&#x5927;&#x90E8;&#x5206;&#x4E2D;&#x5BF9;&#x4E8E;&#x5B50;&#x67E5;&#x8BE2;&#x7684;&#x652F;&#x6301;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x6709;&#x9650;&#xFF0C;&#x4F8B;&#x5982;&#x8BED;&#x6CD5;&#x4E0A;&#x517C;&#x5BB9;&#xFF0C;&#x4F46;&#x662F;&#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#x5B50;&#x67E5;&#x8BE2;&#x4E2D;&#x7684;&#x5206;&#x533A;&#x5B57;&#x6BB5;&#xFF0C;&#x6216;&#x8005;&#x8981;&#x6C42;&#x5B50;&#x67E5;&#x8BE2;&#x7684;&#x8868;&#x540D;&#x5FC5;&#x987B;&#x4E0E;&#x5916;&#x90E8;&#x67E5;&#x8BE2;&#x8868;&#x540D;&#x76F8;&#x540C;&#xFF0C;&#x53C8;&#x6216;&#x8005;&#x53EA;&#x80FD;&#x652F;&#x6301;&#x4E00;&#x7EA7;&#x5D4C;&#x5957;&#x5B50;&#x67E5;&#x8BE2;&#x3002;</p>
<p><strong>JOIN&#xFF1A;</strong>&#x5BF9;&#x4E8E;JOIN&#x7684;&#x652F;&#x6301;&#x901A;&#x5E38;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x5982;&#x679C;&#x505A;&#x4E0D;&#x5230;&#x8FC7;&#x6EE4;&#x6761;&#x4EF6;&#x4E0B;&#x63A8;&#x548C;&#x6D41;&#x5F0F;&#x8BFB;&#x53D6;&#xFF0C;&#x5728;&#x4E2D;&#x95F4;&#x4EF6;&#x5C42;&#x9762;&#xFF0C;&#x57FA;&#x672C;&#x65E0;&#x6CD5;&#x5BF9;JOIN&#x8FDB;&#x884C;&#x652F;&#x6301;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x53EF;&#x80FD;&#x628A;&#x4E24;&#x4E2A;&#x8868;&#x7684;&#x6240;&#x6709;&#x5206;&#x8868;&#xFF0C;&#x5168;&#x90E8;&#x62FF;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x6765;&#x8FDB;&#x884C;JOIN&#xFF0C;&#x5185;&#x5B58;&#x65E9;&#x5C31;&#x5D29;&#x4E86;&#x3002;&#x5F53;&#x7136;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x53D6;&#x5DE7;&#x7684;&#x529E;&#x6CD5;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;Binding Table&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x662F;&#x5C0F;&#x8868;&#x5E7F;&#x64AD;(&#x89C1;&#x540E;&#x6587;)&#x3002;</p>
<p><strong>&#x5206;&#x9875;&#x6392;&#x5E8F;&#xFF1A;</strong>&#x901A;&#x5E38;&#x4E2D;&#x95F4;&#x4EF6;&#x90FD;&#x662F;&#x652F;&#x6301;ORDER BY&#x548C;LIMIT&#x7684;&#x3002;&#x4F46;&#x662F;&#x5728;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5206;&#x9875;&#x7684;&#x6548;&#x7387;&#x8F83;&#x4F4E;&#x3002;&#x4F8B;&#x5982;&#x5BF9;&#x4E8E;limit 100&#xFF0C;10 ORDER BY id&#x3002;&#x8868;&#x793A;&#x6309;&#x7167;id&#x6392;&#x5E8F;&#xFF0C;&#x4ECE;&#x7B2C;100&#x4E2A;&#x4F4D;&#x7F6E;&#x5F00;&#x59CB;&#x53D6;10&#x6761;&#x8BB0;&#x5F55;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x8981;&#x4ECE;&#x6BCF;&#x4E2A;&#x5206;&#x8868;&#x90FD;&#x67E5;&#x8BE2;110(100+10)&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x62FF;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x8FDB;&#x884C;&#x91CD;&#x65B0;&#x6392;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x53D6;&#x51FA;10&#x6761;&#x3002;&#x5047;&#x8BBE;&#x6709;10&#x4E2A;&#x5206;&#x8868;&#xFF0C;&#x90A3;&#x4E48;&#x5B9E;&#x9645;&#x4E0A;&#x8981;&#x67E5;&#x8BE2;1100&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x800C;&#x6700;&#x7EC8;&#x53EA;&#x8FC7;&#x6EE4;&#x51FA;&#x4E86;10&#x8BB0;&#x5F55;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x5206;&#x9875;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x901A;&#x5E38;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&quot;where id &gt; ? limit 10&#x201D;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#xFF0C;&#x5E94;&#x7528;&#x8BB0;&#x4F4F;&#x6BCF;&#x6B21;&#x67E5;&#x8BE2;&#x7684;&#x6700;&#x5927;&#x7684;&#x8BB0;&#x5F55;id&#x3002;&#x4E4B;&#x540E;&#x67E5;&#x8BE2;&#x65F6;&#xFF0C;&#x6BCF;&#x4E2A;&#x5206;&#x8868;&#x53EA;&#x9700;&#x8981;&#x4ECE;&#x8FD9;&#x4E2A;id&#x4E4B;&#x540E;&#xFF0C;&#x53D6;10&#x6761;&#x8BB0;&#x5F55;&#x5373;&#x53EF;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x53D6;offset + rows&#x6761;&#x8BB0;&#x5F55;&#x3002; </p>
<p>&#x5173;&#x4E8E;JOIN&#x7684;&#x7279;&#x5C5E;&#x8BF4;&#x660E;&#xFF1A;</p>
<p><strong>Binding Table&#xFF1A;</strong></p>
<p>&#x9002;&#x7528;&#x4E8E;&#x4E24;&#x4E2A;&#x8868;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x5173;&#x8054;&#x5173;&#x7CFB;&#xFF0C;&#x8DEF;&#x7531;&#x89C4;&#x5219;&#x76F8;&#x540C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6709;user&#x8868;&#x548C;user_account&#x8868;&#xFF0C;&#x7531;&#x4E8E;user_account&#x4E0E;user&#x8868;&#x5F3A;&#x5173;&#x8054;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E24;&#x4E2A;&#x8868;&#x7684;&#x8DEF;&#x7531;&#x89C4;&#x5219;&#x8BBE;&#x7F6E;&#x4E3A;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7528;&#x6237;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5176;&#x6240;&#x5728;&#x7684;user&#x5206;&#x8868;&#x548C;user_account&#x5206;&#x8868;&#x5FC5;&#x7136;&#x552F;&#x4E00;&#x540C;&#x4E00;&#x4E2A;&#x5206;&#x5E93;&#x4E0B;&#xFF0C;&#x540E;&#x7F00;&#x540D;&#x76F8;&#x540C;&#x7684;&#x5206;&#x8868;&#x4E2D;&#x3002;&#x5728;join&#x65F6;&#xFF0C;&#x67D0;&#x4E00;&#x4E2A;&#x5206;&#x5E93;&#x5185;&#x7684;join&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x62FF;&#x5230;&#x8FD9;&#x4E2A;&#x7528;&#x6237;&#x4EE5;&#x53CA;&#x8D26;&#x53F7;&#x7684;&#x5B8C;&#x6574;&#x4FE1;&#x606F;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x8DE8;&#x5E93;join&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x628A;&#x7528;&#x6237;&#x7684;&#x6570;&#x636E;&#x5E93;&#x62FF;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x6765;&#x8FDB;&#x884C;join&#x3002; </p>
<p><img src="../assets/1040.png" alt=""></p>
<p><strong>&#x5C0F;&#x8868;&#x5E7F;&#x64AD;&#xFF1A;</strong></p>
<p>&#x5C0F;&#x8868;&#x5E7F;&#x64AD;&#x901A;&#x5E38;&#x662F;&#x67D0;&#x4E00;&#x4E2A;&#x8868;&#x7684;&#x6570;&#x636E;&#x91CF;&#x6BD4;&#x8F83;&#x5C11;&#xFF0C; &#x4F8B;&#x5982;&#x90E8;&#x95E8;&#x8868;department&#x3002;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x8868;&#x6570;&#x636E;&#x91CF;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x4F8B;&#x5982;user&#x3002;&#x6B64;&#x65F6;user&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5206;&#x5E93;&#x5206;&#x8868;&#xFF0C;&#x4F46;&#x662F;department&#x4E0D;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5206;&#x5E93;&#x5206;&#x8868;&#x3002;&#x4E3A;&#x4E86;&#x8FBE;&#x5230;JOIN&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06; department&#x8868;&#x5728;&#x6BCF;&#x4E2A;&#x5206;&#x5E93;&#x5185;&#x90FD;&#x5B9E;&#x65F6;&#x540C;&#x6B65;&#x4E00;&#x4EFD;&#x5B8C;&#x6574;&#x7684;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x5728;JOIN&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x53EA;&#x9700;&#x8981;&#x5C06;&#x5206;&#x5E93;JOIN&#x7684;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x7B80;&#x5355;&#x5408;&#x5E76;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x4E0B;&#x56FE;&#x6F14;&#x793A;&#x4E86;&#x5C0F;&#x8868;&#x5E7F;&#x64AD;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x7528;&#x6237;&#x5728;&#x66F4;&#x65B0;department&#x8868;&#x65F6;&#xFF0C;&#x603B;&#x662F;&#x66F4;&#x65B0;&#x5206;&#x5E93;db0&#x7684;department&#x8868;&#xFF0C;&#x540C;&#x6B65;&#x7EC4;&#x4EF6;&#x5C06;&#x53D8;&#x66F4;&#x4FE1;&#x606F;&#x540C;&#x6B65;&#x5230;&#x5176;&#x4ED6;&#x5206;&#x5E93;&#x4E2D;&#x3002;</p>
<p><img src="../assets/1041.png" alt=""></p>
<p>&#x6CE8;&#xFF1A;&#x56FE;&#x4E2D;&#x7684;&#x540C;&#x6B65;&#x7EC4;&#x4EF6;&#x6307;&#x7684;&#x662F;&#x4E00;&#x822C;&#x662F;&#x4F2A;&#x88C5;&#x6210;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4ECE;&#x5E93;&#xFF0C;&#x89E3;&#x6790;&#x6E90;&#x5E93;binlog&#xFF0C;&#x63D2;&#x5165;&#x76EE;&#x6807;&#x5E93;&#x3002;&#x6709;&#x4E00;&#x4E9B;&#x5F00;&#x6E90;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x5982;canal&#x3001;puma&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x4E9B;&#x7EC4;&#x4EF6;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x975E;&#x5E38;&#x5E7F;&#x6CDB;&#xFF0C;&#x4E0D;&#x4EC5;&#x9650;&#x4E8E;&#x6B64;&#x3002;&#x7B14;&#x8005;&#x66FE;&#x5199;&#x8FC7;&#x4E00;&#x4E2A;&#x7CFB;&#x5217;&#x7684;canal&#x6E90;&#x7801;&#x89E3;&#x6790;&#x6587;&#x7AE0;&#xFF0C;&#x76EE;&#x524D;&#x5B8C;&#x6210;&#x4E86;&#x5927;&#x90E8;&#x5206;&#x3002;</p>
<h3 id="46-&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;">4.6 &#x4E8C;&#x7EA7;&#x7D22;&#x5F15;</h3>
<p>&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5206;&#x533A;&#x5B57;&#x6BB5;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x3002;&#x4F8B;&#x5982;&#x5BF9;&#x4E8E;&#x7528;&#x6237;&#x8868;user&#xFF0C;&#x6309;&#x7167;user_id&#x5B57;&#x6BB5;&#x8FDB;&#x884C;&#x5206;&#x533A;&#xFF0C;&#x90A3;&#x4E48;&#x4E4B;&#x540E;&#x67E5;&#x8BE2;&#x67D0;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x53EA;&#x80FD;&#x6839;&#x636E;user_id&#x4F5C;&#x4E3A;&#x5206;&#x533A;&#x5B57;&#x6BB5;&#x3002;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x5B57;&#x6BB5;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x626B;&#x63CF;&#x6240;&#x6709;&#x5206;&#x8868;&#xFF0C;&#x6548;&#x7387;&#x5F88;&#x4F4E;&#x3002;&#x4F46;&#x662F;&#x53C8;&#x6709;&#x6839;&#x636E;&#x5176;&#x4ED6;&#x5B57;&#x6BB5;&#x67E5;&#x8BE2;&#x67D0;&#x4E2A;&#x7528;&#x6237;&#x4FE1;&#x606F;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4F8B;&#x5982;&#x6839;&#x636E;&#x624B;&#x673A;&#x53F7;phone_id&#x3002;</p>
<p>&#x6B64;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x6309;&#x7167;user_id&#x63D2;&#x5165;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FDB;&#x884C;&#x4E00;&#x4EFD;&#x5168;&#x91CF;&#x62F7;&#x8D1D;&#x3002;&#x901A;&#x8FC7;&#x540C;&#x6B65;&#x7EC4;&#x4EF6;&#xFF0C;&#x91CD;&#x65B0;&#x6309;&#x7167;phone_id&#x63D2;&#x5165;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x5206;&#x5E93;&#x5206;&#x8868;&#x96C6;&#x7FA4;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x96C6;&#x7FA4;&#x5C31;&#x6210;&#x4E3A;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;&#xFF0C;&#x6216;&#x8005;&#x53EB;&#x8F85;&#x7EF4;&#x5EA6;&#x540C;&#x6B65;&#x3002;&#x6B64;&#x540E;&#xFF0C;&#x5BF9;&#x4E8E;&#x6839;&#x636E;user_id&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5C31;&#x5728;&#x539F;&#x6765;&#x7684;&#x5206;&#x5E93;&#x5206;&#x8868;&#x96C6;&#x7FA4;&#x4E2D;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF1B;&#x6839;&#x636E;phone_id&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5C31;&#x5230;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;&#x96C6;&#x7FA4;&#x4E2D;&#x53BB;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#xFF0C;&#x53EA;&#x80FD;&#x64CD;&#x4F5C;&#x539F;&#x96C6;&#x7FA4;&#xFF0C;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;&#x96C6;&#x7FA4;&#x53EA;&#x80FD;&#x6267;&#x884C;&#x67E5;&#x8BE2;&#x64CD;&#x4F5C;&#x3002;&#x539F;&#x96C6;&#x7FA4;&#x7684;&#x589E;&#x91CF;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x4FE1;&#x606F;&#xFF0C;&#x5B9E;&#x65F6;&#x7684;&#x901A;&#x8FC7;&#x540C;&#x6B65;&#x7EC4;&#x4EF6;&#xFF0C;&#x540C;&#x6B65;&#x5230;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;&#x96C6;&#x7FA4;&#x4E2D;&#x3002; </p>
<p><img src="../assets/1042.png" alt=""></p>
<p>&#x6CE8;&#xFF1A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#x9762;&#x8BD5;&#x9898;&#x3002;&#x963F;&#x91CC;&#x7684;&#x4E00;&#x4E9B;&#x9762;&#x8BD5;&#x5B98;&#xFF0C;&#x6BD4;&#x8F83;&#x559C;&#x6B22;&#x95EE;&#x3002;&#x4E00;&#x4E9B;&#x9762;&#x8BD5;&#x8005;&#xFF0C;&#x53EF;&#x80FD;&#x81EA;&#x5DF1;&#x60F3;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#xFF0C;&#x56E0;&#x4E3A;&#x8003;&#x8651;&#x5230;&#x8FD9;&#x6837;&#x6BD4;&#x8F83;&#x6D6A;&#x8D39;&#x8D44;&#x6E90;&#xFF0C;&#x5C31;&#x81EA;&#x884C;&#x6392;&#x9664;&#x4E86;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8FD9;&#x70B9;&#x8D44;&#x6E90;&#x76F8;&#x5BF9;&#x4E8E;&#x6EE1;&#x8DB3;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x6765;&#x8BF4;&#xFF0C;&#x90FD;&#x4E0D;&#x662F;&#x4E8B;&#x3002;</p>
<h3 id="47-&#x5206;&#x5E03;&#x5F0F;id&#x751F;&#x6210;&#x5668;">4.7 &#x5206;&#x5E03;&#x5F0F;id&#x751F;&#x6210;&#x5668;</h3>
<p>&#x5728;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x81EA;&#x589E;&#x4E3B;&#x952E;&#x5DF2;&#x7ECF;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x3002;&#x6240;&#x4EE5;&#x8981;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7684;id&#x751F;&#x6210;&#x5668;&#x3002;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;id&#x751F;&#x6210;&#x5668;&#x8981;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B;&#x6761;&#x4EF6;&#xFF1A;&#x552F;&#x4E00;&#x3001;&#x8D8B;&#x52BF;&#x9012;&#x589E;(&#x51CF;&#x5C11;&#x843D;&#x5E93;&#x65F6;&#x7684;&#x7D22;&#x5F15;&#x5F00;&#x9500;)&#x3001;&#x9AD8;&#x6027;&#x80FD;&#x3001;&#x9AD8;&#x53EF;&#x7528;&#x3002;</p>
<p>&#x76EE;&#x524D;&#x4E3B;&#x6D41;&#x7684;&#x5206;&#x5E03;&#x5F0F;id&#x751F;&#x6210;&#x65B9;&#x6848;&#x90FD;&#x6709;&#x7B2C;&#x4E09;&#x65B9;&#x7EC4;&#x4EF6;&#x4F9D;&#x8D56;&#xFF0C;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x57FA;&#x4E8E;zk</li>
<li>&#x57FA;&#x4E8E;mysql</li>
<li>&#x57FA;&#x4E8E;&#x7F13;&#x5B58;</li>
</ul>
<p>twitter&#x7684;snowflake&#x7B97;&#x6CD5;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x5206;&#x5E03;&#x5F0F;id&#x7B97;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x9650;&#x5236;workid&#x6700;&#x591A;&#x80FD;&#x6709;1024&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5E94;&#x7528;&#x89C4;&#x6A21;&#x4E0D;&#x80FD;&#x8D85;&#x8FC7;1024&#x3002;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x7EC6;&#x5FAE;&#x7684;&#x8C03;&#x6574;&#xFF0C;&#x4F46;&#x662F;&#x603B;&#x662F;&#x6709;&#x6570;&#x91CF;&#x7684;&#x9650;&#x5236;&#x3002; </p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x7F8E;&#x56E2;&#x4E4B;&#x524D;&#x5728;github&#x5F00;&#x6E90;&#x4E86;&#x4E00;&#x4E2A;leaf&#x7EC4;&#x4EF6;&#xFF0C;&#x662F;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x5206;&#x5E03;&#x5F0F;id&#x7684;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x7814;&#x7A76;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x63D0;&#x51FA;&#x4E00;&#x79CD;&#x652F;&#x6301;&#x52A8;&#x6001;&#x6269;&#x5BB9;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5206;&#x5E03;&#x5F0F;id&#x751F;&#x6210;&#x65B9;&#x6848;&#xFF0C;&#x6B64;&#x65B9;&#x6848;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x9664;&#x4E86;&#x4FDD;&#x8BC1;&#x552F;&#x4E00;&#x3001;&#x8D8B;&#x52BF;&#x9012;&#x589E;&#xFF0C;&#x6CA1;&#x6709;&#x7B2C;&#x4E09;&#x65B9;&#x4F9D;&#x8D56;&#xFF0C;&#x652F;&#x6301;&#x5B58;&#x50A8;&#x7684;&#x52A8;&#x6001;&#x6269;&#x5BB9;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x4F18;&#x52BF;&#xFF1A;</p>
<p>&#x652F;&#x6301;&#x6309;&#x7167;&#x65F6;&#x95F4;&#x8303;&#x56F4;&#x67E5;&#x8BE2;&#xFF0C;&#x6216;&#x8005; &#x65F6;&#x95F4;&#x8303;&#x56F4;+ip&#x67E5;&#x8BE2;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8D70;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#xFF1B;</p>
<p>&#x6BCF;&#x79D2;&#x7684;&#x6700;&#x5927;&#x5E8F;&#x5217;id&#x5C31;&#x662F;&#x67D0;&#x4E2A;ip&#x7684;qps&#x7B49;</p>
<pre><code class="lang-log"> 12&#x4F4D;&#x65E5;&#x671F;+10&#x4F4D;IP+6&#x4F4D;&#x5E8F;&#x5217;ID+4&#x4F4D;&#x6570;&#x636E;&#x5E93;&#x6269;&#x5C55;&#x4F4D;
</code></pre>
<p>&#x5176;&#x4E2D;&#xFF1A;</p>
<p>12&#x4F4D;&#x65E5;&#x671F;&#xFF1A;&#x683C;&#x5F0F;&#x4E3A;yyMMddHHmmss&#xFF0C;&#x610F;&#x5473;&#x7740;&#x672C;&#x65B9;&#x6848;&#x7684;id&#x751F;&#x6210;&#x7B56;&#x7565;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5230;2099&#x5E74;&#xFF0C;&#x628A;&#x65F6;&#x95F4;&#x90E8;&#x5206;&#x524D;&#x7F6E;&#xFF0C;&#x4ECE;&#x800C;&#x4FDD;&#x8BC1;&#x8D8B;&#x52BF;&#x9012;&#x589E;&#x3002;</p>
<p>10&#x4F4D;ip&#xFF1A;&#x5229;&#x7528;ip to decimal&#x7B97;&#x6CD5;&#x5C06;12&#x4F4D;&#x7684;ip&#x8F6C;&#x4E3A;10&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x3002;&#x901A;&#x8FC7;ip&#x5730;&#x5740;&#xFF0C;&#x6765;&#x4FDD;&#x8BC1;&#x5168;&#x5C40;&#x552F;&#x4E00;&#x3002;&#x5982;&#x679C;ip&#x5730;&#x5740;&#x88AB;&#x56DE;&#x6536;&#x91CD;&#x590D;&#x5229;&#x7528;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;id&#x7684;&#x552F;&#x4E00;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x65E5;&#x671F;&#x90E8;&#x5206;&#x8FD8;&#x5728;&#x53D8;&#x5316;&#x3002;</p>
<p>6&#x4F4D;&#x5E8F;&#x5217;id&#xFF1A;&#x610F;&#x5473;&#x7740;&#x6BCF;&#x79D2;&#x6700;&#x591A;&#x652F;&#x6301;&#x751F;&#x6210;100&#x767E;&#x4E07;&#x4E2A;id(0~999999)&#x3002;&#x4E0D;&#x8DB3;6&#x4F4D;&#x524D;&#x7F6E;&#x8865;0&#xFF0C;&#x5982;000123&#x3002;</p>
<p>4&#x4F4D;&#x6570;&#x636E;&#x5E93;&#x6269;&#x5C55;&#x4F4D;&#xFF1A;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x4E0D;&#x8FC1;&#x79FB;&#x6570;&#x636E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B9E;&#x73B0;&#x52A8;&#x6001;&#x6269;&#x5BB9;&#xFF0C;&#x5176;&#x4E2D;2&#x4F4D;&#x8868;&#x793A;DB&#xFF0C;2&#x4F4D;&#x8868;&#x793A;TB&#xFF0C;&#x6700;&#x591A;&#x53EF;&#x6269;&#x5BB9;&#x5230;10000&#x5F20;&#x8868;&#x3002;&#x5047;&#x8BBE;&#x6BCF;&#x5F20;&#x8868;&#x5B58;&#x50A8;1000&#x4E07;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x603B;&#x5171;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x5B58;&#x50A8;1000&#x4EBF;&#x6761;&#x6570;&#x636E;&#x3002; </p>
<p>&#x5173;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x6269;&#x5C55;&#x4F4D;&#x5B9E;&#x73B0;&#x52A8;&#x6001;&#x6269;&#x5BB9;&#x56FE;&#x89E3;&#xFF1A;</p>
<p><img src="../assets/1043.png" alt=""></p>
<p>&#x9996;&#x5148;&#x660E;&#x786E;&#x4E00;&#x70B9;&#xFF0C;&#x8DEF;&#x7531;&#x7B56;&#x7565;&#x59CB;&#x7EC8;&#x6839;&#x636E;&#x6570;&#x636E;&#x5E93;&#x6700;&#x540E;&#x56DB;&#x4F4D;&#xFF0C;&#x786E;&#x5B9A;&#x67D0;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x8981;&#x5230;&#x54EA;&#x4E2A;&#x5206;&#x5E93;&#x7684;&#x54EA;&#x4E2A;&#x5206;&#x8868;&#x4E2D;&#x3002;&#x4F8B;&#x5982;xxxx0001&#xFF0C;&#x610F;&#x5473;&#x7740;&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#x80AF;&#x5B9A;&#x662F;&#x5728;00&#x5206;&#x5E93;&#x7684;01&#x5206;&#x8868;&#x4E0A;&#x3002;</p>
<p>&#x63A5;&#x7740;&#xFF0C;&#x5C31;&#x8981;&#x5728;id&#x7684;&#x751F;&#x6210;&#x7B56;&#x7565;&#x4E0A;&#x505A;&#x6587;&#x7AE0;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x521D;&#x59CB;&#x72B6;&#x6001;&#x4E3A;&#x4E24;&#x4E2A;&#x5206;&#x5E93;db_00,db_01&#xFF0C;&#x6BCF;&#x4E2A;&#x5206;&#x5E93;&#x91CC;&#x9762;&#x6709;10&#x5F20;&#x5206;&#x8868;&#xFF0C;tb_00~tb_09&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x4E1A;&#x52A1;&#x8981;&#x4FDD;&#x8BC1;&#x751F;&#x6210;id&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x59CB;&#x7EC8;&#x4FDD;&#x8BC1;db&#x7684;&#x4E24;&#x4F4D;&#x5728;00~01&#x4E4B;&#x95F4;&#xFF0C;tb&#x7684;&#x4E24;&#x4F4D;&#x59CB;&#x7EC8;&#x5728;00~09&#x4E4B;&#x95F4;&#x3002;&#x8DEF;&#x7531;&#x7B56;&#x7565;&#x6839;&#x636E;&#x8FD9;&#x4E9B;id&#xFF0C;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x6B63;&#x786E;&#x7684;&#x5206;&#x5E93;&#x5206;&#x8868;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x9700;&#x8981;&#x6269;&#x5BB9;&#x5230;10&#x4E2A;&#x5206;&#x5E93;&#xFF0C;&#x6BCF;&#x4E2A;&#x5206;&#x8868;10&#x4E2A;&#x5206;&#x8868;&#x3002;&#x90A3;&#x4E48;DBA&#x9996;&#x5148;&#x5C06;&#x65B0;&#x589E;&#x7684;&#x5206;&#x5E93;&#xFF1A;db_02~db_09&#x521B;&#x5EFA;&#x597D;&#xFF0C;&#x6BCF;&#x4E2A;&#x5206;&#x5E93;&#x91CC;&#x9762;&#x518D;&#x521B;&#x5EFA;10&#x4E2A;&#x5206;&#x8868;&#xFF1A;tb_01~tb_09&#x3002;&#x4E1A;&#x52A1;&#x540C;&#x5B66;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5C06;id&#x751F;&#x6210;&#x7B56;&#x7565;&#x6539;&#x6210;&#xFF1A;db&#x7684;&#x4E24;&#x4F4D;&#x5728;00~09&#x4E4B;&#x95F4;&#xFF0C;tb&#x7684;&#x4E24;&#x4F4D;&#x89C4;&#x5219;&#x7EF4;&#x6301;&#x4E0D;&#x53D8;(&#x53EA;&#x662F;&#x5206;&#x5E93;&#x6570;&#x53D8;&#x4E86;&#xFF0C;&#x6BCF;&#x4E2A;&#x5206;&#x5E93;&#x7684;&#x5206;&#x8868;&#x6570;&#x6CA1;&#x53D8;)&#x3002;&#x800C;&#x7531;&#x4E8E;&#x8DEF;&#x7531;&#x4ECE;&#x7B56;&#x7565;&#x662F;&#x6839;&#x636E;&#x6700;&#x540E;&#x56DB;&#x4F4D;&#x786E;&#x5B9A;&#x5230;&#x54EA;&#x4E2A;&#x5206;&#x5E93;&#xFF0C;&#x54EA;&#x4E2A;&#x5206;&#x8868;&#xFF0C;&#x5F53;&#x8FD9;&#x4E9B;&#x65B0;&#x7684;&#x5206;&#x5E93;&#x5206;&#x8868;&#x6269;&#x5C55;&#x4F4D;id&#x51FA;&#x73B0;&#x65F6;&#xFF0C;&#x81EA;&#x7136;&#x53EF;&#x4EE5;&#x63D2;&#x5165;&#x5230;&#x65B0;&#x7684;&#x5206;&#x5E93;&#x5206;&#x8868;&#x4E2D;&#x3002;&#x4E5F;&#x5C31;&#x5B9E;&#x73B0;&#x4E86;&#x52A8;&#x6001;&#x6269;&#x5BB9;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x8FC1;&#x79FB;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x65B0;&#x7684;&#x5206;&#x5E93;&#x5206;&#x8868;&#x4E2D;&#xFF0C;&#x4E00;&#x5F00;&#x59CB;&#x6570;&#x636E;&#x662F;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6570;&#x636E;&#x662F;&#x4E0D;&#x5747;&#x5300;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x8C03;&#x6574;id&#x6269;&#x5C55;&#x4F4D;&#x4E2D;db&#x548C;tb&#x751F;&#x6210;&#x67D0;&#x4E2A;&#x503C;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x4F7F;&#x5F97;&#x843D;&#x5230;&#x65B0;&#x7684;&#x5206;&#x5E93;&#x5206;&#x8868;&#x4E2D;&#x7684;&#x6982;&#x7387;&#x76F8;&#x5BF9;&#x5927;&#x4E00;&#x70B9;&#x70B9;(&#x4E0D;&#x5B9C;&#x592A;&#x5927;)&#xFF0C;&#x7B49;&#x5230;&#x6570;&#x636E;&#x5747;&#x5300;&#x540E;&#xFF0C;&#x518D;&#x91CD;&#x65B0;&#x8C03;&#x6574;&#x6210;&#x5B8C;&#x5168;&#x968F;&#x673A;&#x3002;</p>
<p>&#x6B64;&#x65B9;&#x6848;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#xFF0C;&#x9884;&#x5206;&#x914D;&#x672A;&#x6765;&#x7684;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x6700;&#x5927;&#x8D44;&#x6E90;&#x6570;&#x91CF;&#x3002;&#x901A;&#x5E38;&#xFF0C;100&#x4E2A;&#x5206;&#x5E93;&#xFF0C;&#x6BCF;&#x4E2A;&#x5206;&#x5E93;100&#x5F20;&#x5206;&#x8868;&#xFF0C;&#x80FD;&#x6EE1;&#x8DB3;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x5E94;&#x7528;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x3002;&#x5982;&#x679C;100&#x4E2A;&#x5206;&#x5E93;&#x90FD;&#x5728;&#x4E0D;&#x540C;&#x7684;mysql&#x5B9E;&#x4F8B;&#x4E0A;&#xFF0C;&#x5047;&#x8BBE;&#x6BCF;&#x4E2A;mysql&#x5B9E;&#x4F8B;&#x90FD;&#x662F;4T&#x7684;&#x78C1;&#x76D8;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;400T&#x7684;&#x6570;&#x636E;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x4E1A;&#x52A1;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x4E0D;&#x5B8C;&#x7F8E;&#x3002;&#x5982;&#x679C;&#x8D85;&#x8FC7;&#x8FD9;&#x4E2A;&#x503C;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6848;&#x53EF;&#x80FD;&#x5C31;&#x4E0D;&#x53EF;&#x884C;&#x4E86;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x901A;&#x5E38;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x65B9;&#x6848;&#xFF0C;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x5728;5~10&#x5E74;&#x4E4B;&#x95F4;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x67B6;&#x6784;&#x4E0A;&#x505A;&#x53D8;&#x52A8;&#xFF0C;&#x5E94;&#x8BE5;&#x5C31;&#x7B97;&#x7684;&#x4E0A;&#x4E00;&#x4E2A;&#x597D;&#x65B9;&#x6848;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8FFD;&#x6C42;&#x7684;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x53EF;&#x80FD;&#x7C7B;&#x4F3C;&#x4E8E;TIDB&#x8FD9;&#x79CD;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x81EA;&#x52A8;&#x6269;&#x5BB9;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4EA7;&#x54C1;&#x66F4;&#x9002;&#x5408;&#xFF0C;&#x4E0D;&#x8FC7;&#x76EE;&#x524D;&#x6765;&#x8BF4;&#xFF0C;TIDB&#x7B49;&#x7C7B;&#x4F3C;&#x4EA7;&#x54C1;&#x8FD8;&#x662F;&#x65E0;&#x6CD5;&#x53D6;&#x4EE3;&#x4F20;&#x7EDF;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x3002;&#x8BF4;&#x4E0D;&#x5B9A;&#x7B49;&#x5230;5~10&#x5E74;&#x540E;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EA7;&#x54C1;&#x66F4;&#x6210;&#x719F;&#x4E86;&#xFF0C;&#x4F60;&#x518D;&#x8FC1;&#x79FB;&#x8FC7;&#x53BB;&#x4E5F;&#x4E0D;&#x8FDF;&#x3002;</p>
<h3 id="48-&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;">4.8 &#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;</h3>
<p>&#x5728;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;&#x64CD;&#x4F5C;&#x591A;&#x4E2A;&#x5206;&#x5E93;&#xFF0C;&#x6B64;&#x65F6;&#x5C31;&#x6D89;&#x53CA;&#x5230;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x3002;&#x4F8B;&#x5982;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x6279;&#x91CF;&#x63D2;&#x5165;SQL&#xFF0C;&#x5982;&#x679C;&#x8BB0;&#x5F55;&#x8981;&#x63D2;&#x5165;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x5E93;&#x4E2D;&#xFF0C;&#x5C31;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x53EA;&#x4F1A;&#x4FDD;&#x8BC1;&#x5355;&#x4E2A;&#x5206;&#x5E93;&#x7684;&#x4E8B;&#x52A1;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E1A;&#x52A1;&#x65B9;&#x5728;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x4FDD;&#x8BC1;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#xFF0C;&#x5FC5;&#x987B;&#x6700;&#x7EC8;&#x90FD;&#x5728;&#x4E00;&#x4E2A;&#x5206;&#x5E93;&#x4E2D;&#x6267;&#x884C;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x67B6;&#x6784;&#x4E0B;&#xFF0C;&#x4E8B;&#x52A1;&#x7684;&#x95EE;&#x9898;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;</p>
<p><img src="../assets/1044.png" alt=""></p>
<p>Service A&#x5728;&#x6267;&#x884C;&#x67D0;&#x4E2A;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x540C;&#x65F6;&#x8C03;&#x7528;Service B&#x548C;Service C&#xFF0C;Service B&#x5E95;&#x5C42;&#x64CD;&#x4F5C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x662F;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#xFF0C;Service C&#x4E5F;&#x8981;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x5E93;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E8B;&#x52A1;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x5C31;&#x975E;&#x5E38;&#x9EBB;&#x70E6;&#x3002;&#x4E00;&#x4E9B;&#x5E38;&#x7528;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x7B97;&#x6CD5;&#x5982;&#xFF1A;paxios&#x534F;&#x8BAE;&#x3001;raft&#x534F;&#x8BAE;&#x4E5F;&#x65E0;&#x6CD5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x534F;&#x8BAE;&#x90FD;&#x662F;&#x8D44;&#x6E90;&#x5C42;&#x9762;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x4E0B;&#xFF0C;&#x5DF2;&#x7ECF;&#x5C06;&#x4E8B;&#x52A1;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x4E0A;&#x5347;&#x5230;&#x4E86;&#x4E1A;&#x52A1;&#x7684;&#x5C42;&#x9762;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4EC5;&#x4EC5;&#x8003;&#x8651;&#x5206;&#x5E93;&#x5206;&#x8868;&#xFF0C;&#x4E00;&#x4E9B;&#x540C;&#x5B66;&#x53EF;&#x80FD;&#x4F1A;&#x60F3;&#x5230;XA&#xFF0C;&#x4F46;&#x662F;&#x6027;&#x80FD;&#x5F88;&#x5DEE;&#xFF0C;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7684;&#x7248;&#x672C;&#x4E5F;&#x6709;&#x8981;&#x6C42;&#xFF0C;&#x4F8B;&#x5982;&#x5FC5;&#x987B;&#x4F7F;&#x7528;mysql 5.7&#xFF0C;&#x5B98;&#x65B9;&#x8FD8;&#x5EFA;&#x8BAE;&#x5C06;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x8BBE;&#x7F6E;&#x4E3A;&#x4E32;&#x884C;&#x5316;&#xFF0C;&#x8FD9;&#x662F;&#x65E0;&#x6CD5;&#x5BB9;&#x5FCD;&#x7684;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x4EC5;&#x4EC5;&#x5206;&#x5E93;&#x5206;&#x8868;&#xFF0C;&#x56E0;&#x6B64;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x4E13;&#x95E8;&#x7684;&#x56E2;&#x961F;&#x6765;&#x505A;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#xFF0C;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x56E2;&#x961F;&#x6765;&#x505A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;sharding-jdbc&#x5C31;&#x4F7F;&#x7528;&#x4E86;&#x534E;&#x4E3A;&#x5F00;&#x6E90;&#x7684;&#x4E00;&#x5957;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x89E3;&#x51B3;&#x65B9;&#x6848;service comb&#x4E2D;&#x7684;saga&#x7EC4;&#x4EF6;&#xFF0C;&#x6765;&#x5B9E;&#x73B0;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x963F;&#x91CC;&#x4E5F;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x5728;&#x5185;&#x90E8;&#x53EB;TXC&#xFF0C;&#x5728;&#x963F;&#x91CC;&#x4E91;&#x4E0A;&#x53EB;GTS&#xFF0C;&#x6700;&#x8FD1;&#x5F00;&#x6E90;&#x5230;&#x4E86;GitHub&#x4E0A;&#x53EB;fescar&#xFF08;Fast &amp; Easy Commit And Rollback)&#x3002;&#x8682;&#x8681;&#x91D1;&#x670D;&#x4E5F;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x53EB;DTX&#xFF0C;&#x652F;&#x6301;FMT&#x6A21;&#x5F0F;&#x548C;TCC&#x6A21;&#x5F0F;&#x3002;&#x5176;&#x4E2D;FMT&#x6A21;&#x5F0F;&#x5C31;&#x7C7B;&#x4F3C;&#x4E8E;TXC&#x3002;</p>
<p>&#x603B;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;TCC&#x66F4;&#x80FD;&#x6EE1;&#x8DB3;&#x4E1A;&#x52A1;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x867D;&#x7136;&#x63A5;&#x5165;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x3002;&#x5173;&#x4E8E;fescar&#xFF0C;&#x6700;&#x8FD1;&#x6BD4;&#x8F83;&#x706B;&#xFF0C;&#x8FD9;&#x662F;java&#x5199;&#x7684;&#xFF0C;&#x5177;&#x4F53;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#xFF1A;<a href="https://github.com/alibaba/fescar" target="_blank">https://github.com/alibaba/fescar</a></p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x672C;&#x4EBA;&#x66FE;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x7CFB;&#x5217;&#x6559;&#x7A0B;&#xFF0C;&#x6B63;&#x51C6;&#x5907;&#x6253;&#x7B97;&#x653E;&#x5230;&#x516C;&#x4F17;&#x53F7;&#x4E0A;&#x3002;&#x4E0D;&#x8FC7;&#x7531;&#x4E8E;&#x6587;&#x7AE0;&#x88AB;&#x4EBA;&#x4E00;&#x5B57;&#x4E0D;&#x6F0F;&#x7684;&#x6284;&#x88AD;&#x4E86;&#xFF0C;&#x6B63;&#x5728;&#x6295;&#x8BC9;&#x5904;&#x7406;&#x4E2D;&#xFF0C;&#x7B49;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x540E;&#xFF0C;&#x5C06;&#x4F1A;&#x653E;&#x4E0A;&#x6765;&#x3002;</p>
<p>&#x5982;&#x679C;&#x89C9;&#x5F97;&#x672C;&#x6587;&#x4E0D;&#x9519;&#xFF0C;&#x8BB0;&#x5F97;&#x53F3;&#x4E0B;&#x89D2;&#x8FDB;&#x53BB;&#x5173;&#x6CE8;&#x7530;&#x5B88;&#x679D;&#x7684;&#x6280;&#x672F;&#x535A;&#x5BA2;~~</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; wu_mingsheng@126.com 2017 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x4EF6;&#x6700;&#x540E;&#x4FEE;&#x6539;&#x65F6;&#x95F4;&#xFF1A;
2019-12-05 19:23:54
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="002.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 一文读懂分库分表的技术演进（最佳实践）">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"数据库中间件详解 | 珍藏版","level":"1.1.3","depth":2,"previous":{"title":"一文读懂分库分表的技术演进（最佳实践）","level":"1.1.2","depth":2,"path":"part-db-table/002.md","ref":"part-db-table/002.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["-lunr","-search","search-pro","theme-comscore","chapter-fold","splitter","tbfed-pagefooter","code","page-toc-button","popup","back-to-top-button","emphasize"],"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy wu_mingsheng@126.com 2017","modify_label":"该文件最后修改时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"emphasize":{},"splitter":{},"search-pro":{},"popup":{},"code":{"copyButtons":true},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"theme-comscore":{},"page-toc-button":{"maxTocDepth":2,"minTocSize":2},"back-to-top-button":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"part-db-table/003.md","mtime":"2019-12-05T11:23:54.311Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-12-05T11:29:11.114Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

