
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>数据库中间件详解 | 珍藏版 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-emphasize/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="002.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    分库分表
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.1" data-path="001.html">
            
                <a href="001.html">
            
                    
                    MySQL数据库之互联网常用分库分表方案
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.2" data-path="002.html">
            
                <a href="002.html">
            
                    
                    一文读懂分库分表的技术演进（最佳实践）
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.1.3" data-path="003.html">
            
                <a href="003.html">
            
                    
                    数据库中间件详解 | 珍藏版
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >数据库中间件详解 | 珍藏版</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x8BE6;&#x89E3;--&#x73CD;&#x85CF;&#x7248;">&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x8BE6;&#x89E3; | &#x73CD;&#x85CF;&#x7248;</h1>
<h2 id="1-&#x6570;&#x636E;&#x5E93;&#x62C6;&#x5206;&#x8FC7;&#x7A0B;&#x53CA;&#x6311;&#x6218;">1. &#x6570;&#x636E;&#x5E93;&#x62C6;&#x5206;&#x8FC7;&#x7A0B;&#x53CA;&#x6311;&#x6218;</h2>
<p>&#x4E92;&#x8054;&#x7F51;&#x5F53;&#x4E0B;&#x7684;&#x6570;&#x636E;&#x5E93;&#x62C6;&#x5206;&#x8FC7;&#x7A0B;&#x57FA;&#x672C;&#x9075;&#x5FAA;&#x7684;&#x987A;&#x5E8F;&#x662F;&#xFF1A;<strong>&#x5782;&#x76F4;&#x62C6;&#x5206;</strong>&#x3001;<strong>&#x8BFB;&#x5199;&#x5206;&#x79BB;</strong>&#x3001;<strong>&#x5206;&#x5E93;&#x5206;&#x8868;(&#x6C34;&#x5E73;&#x62C6;&#x5206;)</strong>&#x3002;&#x6BCF;&#x4E2A;&#x62C6;&#x5206;&#x8FC7;&#x7A0B;&#x90FD;&#x80FD;&#x89E3;&#x51B3;&#x4E1A;&#x52A1;&#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#x4E5F;&#x9762;&#x4E34;&#x4E86;&#x4E00;&#x4E9B;&#x6311;&#x6218;&#x3002; </p>
<h3 id="11-&#x5782;&#x76F4;&#x62C6;&#x5206;">1.1 &#x5782;&#x76F4;&#x62C6;&#x5206;</h3>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x521A;&#x4E0A;&#x7EBF;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x9879;&#x76EE;&#x6765;&#x8BF4;&#xFF0C;&#x7531;&#x4E8E;&#x524D;&#x671F;&#x6D3B;&#x8DC3;&#x7528;&#x6237;&#x6570;&#x91CF;&#x5E76;&#x4E0D;&#x591A;&#xFF0C;&#x5E76;&#x53D1;&#x91CF;&#x4E5F;&#x76F8;&#x5BF9;&#x8F83;&#x5C0F;&#xFF0C;&#x6240;&#x4EE5;&#x6B64;&#x65F6;&#x4F01;&#x4E1A;&#x4E00;&#x822C;&#x90FD;&#x4F1A;&#x9009;&#x62E9;&#x5C06;&#x6240;&#x6709;&#x6570;&#x636E;&#x5B58;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93; &#x4E2D;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#x64CD;&#x4F5C;&#x3002;&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7535;&#x5546;&#x7CFB;&#x7EDF;&#xFF0C;&#x5176;&#x7528;&#x6237;&#x6A21;&#x5757;&#x548C;&#x4EA7;&#x54C1;&#x6A21;&#x5757;&#x7684;&#x8868;&#x521A;&#x5F00;&#x59CB;&#x90FD;&#x662F;&#x4F4D;&#x4E8E;&#x4E00;&#x4E2A;&#x5E93;&#x4E2D;&#x3002;</p>
<p><img src="../assets/1023.png" alt=""></p>
<p>&#x5176;&#x4E2D;&#xFF1A;user&#x3001;useraccount&#x8868;&#x5C5E;&#x4E8E;&#x7528;&#x6237;&#x6A21;&#x5757;&#xFF0C;productcategory&#x3001;product&#x8868;&#x5C5E;&#x4E8E;&#x4EA7;&#x54C1;&#x6A21;&#x5757;</p>
<p>&#x521A;&#x5F00;&#x59CB;&#xFF0C;&#x53EF;&#x80FD;&#x516C;&#x53F8;&#x7684;&#x6280;&#x672F;&#x56E2;&#x961F;&#x89C4;&#x6A21;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x90FD;&#x4F4D;&#x4E8E;&#x4E00;&#x4E2A;&#x5E93;&#x4E2D;&#x3002;&#x968F;&#x7740;&#x516C;&#x53F8;&#x4E1A;&#x52A1;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x6280;&#x672F;&#x56E2;&#x961F;&#x4EBA;&#x5458;&#x4E5F;&#x5F97;&#x5230;&#x4E86;&#x6269;&#x5F20;&#xFF0C;&#x5212;&#x5206;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x6280;&#x672F;&#x5C0F;&#x7EC4;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5C0F;&#x7EC4;&#x8D1F;&#x8D23;&#x4E0D;&#x540C;&#x7684;&#x4E1A;&#x52A1;&#x6A21;&#x5757;&#x3002;&#x4F8B;&#x5982;A&#x5C0F;&#x7EC4;&#x8D1F;&#x8D23;&#x7528;&#x6237;&#x6A21;&#x5757;&#xFF0C;B&#x5C0F;&#x7EC4;&#x8D1F;&#x8D23;&#x4EA7;&#x54C1;&#x6A21;&#x5757;&#x3002;&#x6B64;&#x65F6;&#x6570;&#x636E;&#x5E93;&#x4E5F;&#x8FCE;&#x6765;&#x4E86;&#x7B2C;&#x4E00;&#x6B21;&#x62C6;&#x5206;&#xFF1A;&#x5782;&#x76F4;&#x62C6;&#x5206;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x7684;&#x5782;&#x76F4;&#x62C6;&#x5206;&#xFF0C;&#x6307;&#x7684;&#x662F;&#x5C06;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E86;&#x5F88;&#x591A;&#x8868;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6839;&#x636E;&#x8868;&#x7684;&#x529F;&#x80FD;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x62C6;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6BCF;&#x4E2A;&#x5E93;&#x5305;&#x542B;&#x90E8;&#x5206;&#x8868;&#x3002;&#x4E0B;&#x56FE;&#x6F14;&#x793A;&#x5C06;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;db_eshop&#x5E93;&#xFF0C;&#x62C6;&#x5206;&#x4E3A;db_user&#x5E93;&#x548C;db_product&#x5E93;&#x3002;</p>
<p><img src="../assets/1024.png" alt=""></p>
<p>&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x5782;&#x76F4;&#x62C6;&#x5206;&#xFF0C;&#x90FD;&#x662F;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x6765;&#x5BF9;&#x4E00;&#x4E2A;&#x5E93;&#x4E2D;&#x7684;&#x8868;&#x8FDB;&#x884C;&#x62C6;&#x5206;&#x7684;&#x3002;&#x5173;&#x4E8E;&#x5782;&#x76F4;&#x62C6;&#x5206;&#xFF0C;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x5C06;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E86;&#x5F88;&#x591A;&#x5B57;&#x6BB5;&#x7684;&#x5927;&#x8868;&#x62C6;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x5C0F;&#x8868;&#xFF0C;&#x6BCF;&#x4E2A;&#x8868;&#x5305;&#x542B;&#x90E8;&#x5206;&#x5B57;&#x6BB5;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5728;&#x5B9E;&#x9645;&#x5F00;&#x53D1;&#x4E2D;&#x57FA;&#x672C;&#x5F88;&#x5C11;&#x9047;&#x5230;&#x3002;</p>
<p>&#x5782;&#x76F4;&#x62C6;&#x5206;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x5E94;&#x7528;&#x573A;&#x666F;&#x662F;&#x670D;&#x52A1;&#x5316;(SOA)&#x6539;&#x9020;&#x3002;&#x5728;&#x670D;&#x52A1;&#x5316;&#x7684;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x9664;&#x4E86;&#x4E1A;&#x52A1;&#x4E0A;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x62C6;&#x5206;&#xFF0C;&#x5E95;&#x5C42;&#x7684;&#x5B58;&#x50A8;&#x4E5F;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x9694;&#x79BB;&#x3002; &#x5782;&#x76F4;&#x62C6;&#x5206;&#x4F1A;&#x4F7F;&#x5F97;&#x5355;&#x4E2A;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x53D8;&#x957F;&#xFF0C;&#x539F;&#x56E0;&#x5728;&#x4E8E;&#xFF0C;&#x5728;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x7684;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x4E1A;&#x52A1;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5185;&#x90E8;&#x5B8C;&#x6210;&#xFF0C;&#x800C;&#x5782;&#x76F4;&#x62C6;&#x5206;&#x4E4B;&#x540E;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x9700;&#x8981;&#x8FDB;&#x884C;RPC&#x8C03;&#x7528;&#x3002;&#x7136;&#x540E;&#x867D;&#x7136;&#x5355;&#x4E2A;&#x8BF7;&#x6C42;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x589E;&#x52A0;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6574;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x541E;&#x5410;&#x91CF;&#x786E;&#x4F1A;&#x5927;&#x5927;&#x7684;&#x589E;&#x52A0;&#x3002;</p>
<h3 id="12-&#x8BFB;&#x5199;&#x5206;&#x79BB;">1.2 &#x8BFB;&#x5199;&#x5206;&#x79BB;</h3>
<p>&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x7684;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#xFF0C;&#x7528;&#x6237;&#x6570;&#x91CF;&#x548C;&#x5E76;&#x53D1;&#x91CF;&#x4E0D;&#x65AD;&#x4E0A;&#x5347;&#x3002;&#x8FD9;&#x65F6;&#x5982;&#x679C;&#x4EC5;&#x9760;&#x5355;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x4F8B;&#x6765;&#x652F;&#x6491;&#x6240;&#x6709;&#x8BBF;&#x95EE;&#x538B;&#x529B;,&#x51E0;&#x4E4E;&#x662F;&#x5728; &#x81EA;&#x5BFB;&#x6B7B;&#x8DEF; &#x3002;&#x4EE5;&#x4EA7;&#x54C1;&#x5E93;&#x4E3A;&#x4F8B;&#xFF0C;&#x53EF;&#x80FD;&#x5E93;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x51E0;&#x4E07;&#x79CD;&#x5546;&#x54C1;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x5929;&#x65B0;&#x589E;&#x51E0;&#x5341;&#x79CD;&#xFF0C;&#x800C;&#x4EA7;&#x54C1;&#x5E93;&#x6BCF;&#x5929;&#x7684;&#x8BBF;&#x95EE;&#x4E86;&#x53EF;&#x80FD;&#x6709;&#x51E0;&#x4EBF;&#x751A;&#x81F3;&#x51E0;&#x5341;&#x4EBF;&#x6B21;&#x3002;&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x7684;&#x538B;&#x529B;&#x592A;&#x5927;&#xFF0C;&#x5355;&#x53F0;mysql&#x5B9E;&#x4F8B;&#x625B;&#x4E0D;&#x4F4F;&#xFF0C;&#x6B64;&#x65F6;&#x5927;&#x90E8;&#x5206; Mysql DBA &#x5C31;&#x4F1A;&#x5C06;&#x6570;&#x636E;&#x5E93;&#x8BBE;&#x7F6E;&#x6210; &#x8BFB;&#x5199;&#x5206;&#x79BB;&#x72B6;&#x6001; &#x3002;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A; Master &#x8282;&#x70B9;(&#x4E3B;&#x5E93;)&#x5BF9;&#x5E94;&#x591A;&#x4E2A; Salve &#x8282;&#x70B9;(&#x4ECE;&#x5E93;)&#x3002;&#x53EF;&#x4EE5;&#x5C06;slave&#x8282;&#x70B9;&#x7684;&#x6570;&#x636E;&#x7406;&#x89E3;&#x4E3A;master&#x8282;&#x70B9;&#x6570;&#x636E;&#x7684;&#x5168;&#x91CF;&#x5907;&#x4EFD;&#x3002;</p>
<p><img src="../assets/1025.png" alt=""></p>
<p>master&#x8282;&#x70B9;&#x63A5;&#x6536;&#x7528;&#x6237;&#x7684;&#x5199;&#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x5199;&#x5165;&#x5230;&#x672C;&#x5730;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;(binary log)&#x4E2D;&#x3002;slave&#x901A;&#x8FC7;&#x4E00;&#x4E2A;I/O&#x7EBF;&#x7A0B;&#x4E0E;Master&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x53D1;&#x9001;binlog dump&#x6307;&#x4EE4;&#x3002;Master&#x4F1A;&#x5C06;binlog&#x6570;&#x636E;&#x63A8;&#x9001;&#x7ED9;slave&#xFF0C;slave&#x5C06;&#x63A5;&#x6536;&#x5230;&#x7684;binlog&#x4FDD;&#x5B58;&#x5230;&#x672C;&#x5730;&#x7684;&#x4E2D;&#x7EE7;&#x65E5;&#x5FD7;(relay log)&#x4E2D;&#xFF0C;&#x6700;&#x540E;&#xFF0C;slave&#x901A;&#x8FC7;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;SQL thread&#x5E94;&#x7528;&#x672C;&#x5730;&#x7684;relay log&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x540C;&#x6B65;&#x5230;slave&#x5E93;&#x4E2D;&#x3002;</p>
<p>&#x5173;&#x4E8E;mysql&#x4E3B;&#x4ECE;&#x590D;&#x5236;&#xFF0C;&#x5185;&#x90E8;&#x5305;&#x542B;&#x5F88;&#x591A;&#x7EC6;&#x8282;&#x3002;&#x4F8B;&#x5982;binlog &#x683C;&#x5F0F;&#x5206;&#x4E3A;statement&#x3001;row&#x548C;mixed&#xFF0C;binlog&#x540C;&#x6B65;&#x65B9;&#x5F0F;&#x53C8;&#x53EF;&#x4EE5;&#x5212;&#x5206;&#x4E3A;&#xFF1A;&#x5F02;&#x6B65;&#x3001;&#x534A;&#x540C;&#x6B65;&#x548C;&#x540C;&#x6B65;&#x3002;&#x590D;&#x5236;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;binlogFile+position&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;GTID&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;DBA&#x8D1F;&#x8D23;&#x7EF4;&#x62A4;&#x7684;&#xFF0C;&#x4E1A;&#x52A1;RD&#x65E0;&#x611F;&#x77E5;&#x3002;</p>
<blockquote>
<ol>
<li>PM: Product Manager -- &#x4EA7;&#x54C1;&#x7ECF;&#x7406;</li>
<li>RD: Research and Development engineer -- &#x7814;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;</li>
<li>QA: Quality Assurance -- &#x6D4B;&#x8BD5;</li>
<li>OP: Operator -- &#x8FD0;&#x7EF4;</li>
</ol>
</blockquote>
<p>&#x5728;DBA&#x5C06;mysql&#x914D;&#x7F6E;&#x6210;&#x4E3B;&#x4ECE;&#x590D;&#x5236;&#x96C6;&#x7FA4;&#x7684;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x5F00;&#x53D1;&#x540C;&#x5B66;&#x6240;&#x9700;&#x8981;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#xFF1A;&#x5F53;&#x66F4;&#x65B0;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x5C06;&#x6570;&#x636E;&#x5199;&#x5165;master&#x4E3B;&#x5E93;&#xFF0C;&#x4E3B;&#x5E93;&#x5C06;&#x6570;&#x636E;&#x540C;&#x6B65;&#x7ED9;&#x591A;&#x4E2A;slave&#x4ECE;&#x5E93;&#x3002;&#x5F53;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x9009;&#x62E9;&#x67D0;&#x4E2A;slave&#x8282;&#x70B9;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x3002;</p>
<p><img src="../assets/1026.png" alt=""></p>
<h4 id="121-&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x7684;&#x4F18;&#x70B9;">1.2.1 &#x8BFB;&#x5199;&#x5206;&#x79BB;&#x7684;&#x4F18;&#x70B9;</h4>
<p>&#x8FD9;&#x6837;&#x901A;&#x8FC7;&#x914D;&#x7F6E;&#x591A;&#x4E2A;slave&#x8282;&#x70B9;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x7684;&#x907F;&#x514D;&#x8FC7;&#x5927;&#x7684;&#x8BBF;&#x95EE;&#x91CF;&#x5BF9;&#x5355;&#x4E2A;&#x5E93;&#x9020;&#x6210;&#x7684;&#x538B;&#x529B;&#x3002;</p>
<h4 id="122-&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x7684;&#x6311;&#x6218;">1.2.2 &#x8BFB;&#x5199;&#x5206;&#x79BB;&#x7684;&#x6311;&#x6218;</h4>
<p><strong>&#x5BF9;&#x4E8E;DBA&#x800C;&#x8A00;&#xFF0C;&#x591A;&#x4E86;&#x5F88;&#x591A;&#x96C6;&#x7FA4;&#x8FD0;&#x7EF4;&#x5DE5;&#x4F5C;:</strong></p>
<p>&#x4F8B;&#x5982;&#x96C6;&#x7FA4;&#x642D;&#x5EFA;&#x3001;&#x4E3B;&#x4ECE;&#x5207;&#x6362;&#x3001;&#x4ECE;&#x5E93;&#x6269;&#x5BB9;&#x3001;&#x7F29;&#x5BB9;&#x7B49;&#x3002;&#x4F8B;&#x5982;master&#x914D;&#x7F6E;&#x4E86;&#x591A;&#x4E2A;slave&#x8282;&#x70B9;&#xFF0C;&#x5982;&#x679C;&#x5176;&#x4E2D;&#x67D0;&#x4E2A;slave&#x8282;&#x70B9;&#x6302;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x4E4B;&#x540E;&#x7684;&#x8BFB;&#x8BF7;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x7528;&#x5C06;&#x5176;&#x8F6C;&#x53D1;&#x5230;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x7684;slave&#x8282;&#x70B9;&#x4E0A;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x65B0;&#x589E;&#x4E86;slave&#x8282;&#x70B9;&#xFF0C;&#x5E94;&#x7528;&#x4E5F;&#x5E94;&#x8BE5;&#x611F;&#x77E5;&#x5230;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8BFB;&#x8BF7;&#x6C42;&#x8F6C;&#x53D1;&#x5230;&#x65B0;&#x7684;slave&#x8282;&#x70B9;&#x4E0A;&#x3002;</p>
<p><strong>&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x800C;&#x8A00;:</strong></p>
<p>&#x57FA;&#x672C;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x529F;&#x80FD;&#xFF1A;&#x5BF9;sql&#x7C7B;&#x578B;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#xFF0C;&#x5982;&#x679C;&#x662F;select&#x7B49;&#x8BFB;&#x8BF7;&#x6C42;&#xFF0C;&#x5C31;&#x8D70;&#x4ECE;&#x5E93;&#xFF0C;&#x5982;&#x679C;&#x662F;insert&#x3001;update&#x3001;delete&#x7B49;&#x5199;&#x8BF7;&#x6C42;&#xFF0C;&#x5C31;&#x8D70;&#x4E3B;&#x5E93;&#x3002;</p>
<p>&#x4E3B;&#x4ECE;&#x6570;&#x636E;&#x540C;&#x6B65;&#x5EF6;&#x8FDF;&#x95EE;&#x9898;&#xFF1A;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x662F;&#x4ECE;master&#x8282;&#x70B9;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x540C;&#x6B65;&#x7ED9;&#x591A;&#x4E2A;slave&#x8282;&#x70B9;&#xFF0C;&#x56E0;&#x6B64;&#x5FC5;&#x7136;&#x5B58;&#x5728;&#x5EF6;&#x8FDF;&#x3002;&#x56E0;&#x6B64;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x6211;&#x4EEC;&#x5728;master&#x8282;&#x70B9;&#x4E2D;&#x5DF2;&#x7ECF;&#x63D2;&#x5165;&#x4E86;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;slave&#x8282;&#x70B9;&#x5374;&#x8BFB;&#x53D6;&#x4E0D;&#x5230;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#xFF0C;&#x8981;&#x6C42;&#x63D2;&#x5165;&#x540E;&#x5FC5;&#x987B;&#x80FD;&#x8BFB;&#x53D6;&#x5230;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x8BA9;&#x8BFB;&#x8BF7;&#x6C42;&#x4E5F;&#x53EF;&#x4EE5;&#x8D70;&#x4E3B;&#x5E93;&#xFF0C;&#x800C;&#x4E3B;&#x5E93;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x5FC5;&#x7136;&#x662F;&#x6700;&#x65B0;&#x7684;&#x3002;</p>
<p>&#x4E8B;&#x52A1;&#x95EE;&#x9898;&#xFF1A;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#x540C;&#x65F6;&#x5305;&#x542B;&#x4E86;&#x8BFB;&#x8BF7;&#x6C42;(&#x5982;select)&#x548C;&#x5199;&#x8BF7;&#x6C42;(&#x5982;insert)&#xFF0C;&#x5982;&#x679C;&#x8BFB;&#x8BF7;&#x6C42;&#x8D70;&#x4ECE;&#x5E93;&#xFF0C;&#x5199;&#x8BF7;&#x6C42;&#x8D70;&#x4E3B;&#x5E93;&#xFF0C;&#x7531;&#x4E8E;&#x8DE8;&#x4E86;&#x591A;&#x4E2A;&#x5E93;&#xFF0C;&#x90A3;&#x4E48;&#x672C;&#x5730;&#x4E8B;&#x52A1;&#x5DF2;&#x7ECF;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#xFF0C;&#x5C5E;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x7684;&#x8303;&#x7574;&#x3002;&#x800C;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x975E;&#x5E38;&#x590D;&#x6742;&#x4E14;&#x6548;&#x7387;&#x8F83;&#x4F4E;&#x3002;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#xFF0C;&#x76EE;&#x524D;&#x4E3B;&#x6D41;&#x7684;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x6240;&#x6709;sql&#x7EDF;&#x4E00;&#x90FD;&#x8D70;&#x4E3B;&#x5E93;&#xFF0C;&#x7531;&#x4E8E;&#x53EA;&#x6D89;&#x53CA;&#x5230;&#x4E00;&#x4E2A;&#x5E93;&#xFF0C;&#x672C;&#x5730;&#x4E8B;&#x52A1;&#x5C31;&#x53EF;&#x4EE5;&#x641E;&#x5B9A;&#x3002;</p>
<p>&#x611F;&#x77E5;&#x96C6;&#x7FA4;&#x4FE1;&#x606F;&#x53D8;&#x66F4;&#xFF1A;&#x5982;&#x679C;&#x8BBF;&#x95EE;&#x7684;&#x6570;&#x636E;&#x5E93;&#x96C6;&#x7FA4;&#x4FE1;&#x606F;&#x53D8;&#x66F4;&#x4E86;&#xFF0C;&#x4F8B;&#x5982;&#x4E3B;&#x4ECE;&#x5207;&#x6362;&#x4E86;&#xFF0C;&#x5199;&#x6D41;&#x91CF;&#x5C31;&#x8981;&#x5230;&#x65B0;&#x7684;&#x4E3B;&#x5E93;&#x4E0A;&#xFF1B;&#x53C8;&#x4F8B;&#x5982;&#x589E;&#x52A0;&#x4E86;&#x4ECE;&#x5E93;&#x6570;&#x91CF;&#xFF0C;&#x6D41;&#x91CF;&#x9700;&#x8981;&#x53EF;&#x4EE5;&#x6253;&#x5230;&#x65B0;&#x7684;&#x4ECE;&#x5E93;&#x4E0A;&#xFF1B;&#x53C8;&#x6216;&#x8005;&#x67D0;&#x4E2A;&#x4ECE;&#x5E93;&#x5EF6;&#x8FDF;&#x6216;&#x8005;&#x5931;&#x8D25;&#x7387;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x5E94;&#x8BE5;&#x5C06;&#x8FD9;&#x4E2A;&#x4ECE;&#x5E93;&#x8FDB;&#x884C;&#x9694;&#x79BB;&#xFF0C;&#x8BFB;&#x6D41;&#x91CF;&#x5C3D;&#x91CF;&#x6253;&#x5230;&#x6B63;&#x5E38;&#x7684;&#x4ECE;&#x5E93;&#x4E0A;</p>
<h3 id="13-&#x5206;&#x5E93;&#x5206;&#x8868;">1.3 &#x5206;&#x5E93;&#x5206;&#x8868;</h3>
<p>&#x7ECF;&#x8FC7;&#x5782;&#x76F4;&#x5206;&#x533A;&#x540E;&#x7684; Master/Salve &#x6A21;&#x5F0F;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x627F;&#x53D7;&#x4F4F;&#x96BE;&#x4EE5;&#x60F3;&#x8C61;&#x7684;&#x9AD8;&#x5E76;&#x53D1;&#x8BBF;&#x95EE;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x6C38;&#x8FDC; &#x9AD8;&#x6795;&#x65E0;&#x5FE7; &#x4E86;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x5426;&#x5B9A;&#x7684;&#xFF0C;&#x4E00;&#x65E6;&#x4E1A;&#x52A1;&#x8868;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x91CF;&#x5927;&#x4E86;&#xFF0C;&#x4ECE;&#x7EF4;&#x62A4;&#x548C;&#x6027;&#x80FD;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x4EFB;&#x4F55;&#x7684; CRUD &#x64CD;&#x4F5C;&#xFF0C;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x800C;&#x8A00;&#x90FD;&#x662F;&#x4E00;&#x4EF6;&#x6781;&#x5176;&#x8017;&#x8D39;&#x8D44;&#x6E90;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5373;&#x4FBF;&#x8BBE;&#x7F6E;&#x4E86;&#x7D22;&#x5F15;&#xFF0C; &#x4ECD;&#x7136;&#x65E0;&#x6CD5;&#x63A9;&#x76D6;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x91CF;&#x8FC7;&#x5927;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x7684;&#x6570;&#x636E;&#x5E93;&#x6027;&#x80FD;&#x4E0B;&#x964D;&#x7684;&#x4E8B;&#x5B9E; &#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x4E2A;&#x65F6;&#x5019; Mysql DBA &#x6216;&#x8BB8;&#x5C31;&#x8BE5;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C; &#x6C34;&#x5E73;&#x5206;&#x533A; &#xFF08;sharding&#xFF0C;&#x5373;&#x5206;&#x5E93;&#x5206;&#x8868; &#xFF09;&#x3002;&#x7ECF;&#x8FC7;&#x6C34;&#x5E73;&#x5206;&#x533A;&#x8BBE;&#x7F6E;&#x540E;&#x7684;&#x4E1A;&#x52A1;&#x8868;&#xFF0C;&#x5FC5;&#x7136;&#x80FD;&#x591F;&#x5C06;&#x539F;&#x672C;&#x4E00;&#x5F20;&#x8868;&#x7EF4;&#x62A4;&#x7684;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x5206;&#x914D;&#x7ED9; N &#x4E2A;&#x5B50;&#x8868;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#x548C;&#x7EF4;&#x62A4;&#x3002;</p>
<p>&#x6C34;&#x5E73;&#x5206;&#x8868;&#x4ECE;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x4E0A;&#x53C8;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;3&#x79CD;&#xFF1A;&#x53EA;&#x5206;&#x8868;&#x3001;&#x53EA;&#x5206;&#x5E93;&#x3001;&#x5206;&#x5E93;&#x5206;&#x8868;&#xFF0C;&#x4E0B;&#x56FE;&#x5C55;&#x793A;&#x4E86;&#x8FD9;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;</p>
<p><img src="../assets/1027.png" alt=""></p>
<p><strong>&#x53EA;&#x5206;&#x8868;&#xFF1A;</strong></p>
<p>&#x5C06;db&#x5E93;&#x4E2D;&#x7684;user&#x8868;&#x62C6;&#x5206;&#x4E3A;2&#x4E2A;&#x5206;&#x8868;&#xFF0C;user_0&#x548C;user_1&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x8868;&#x8FD8;&#x4F4D;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x5E93;&#x4E2D;&#x3002;&#x9002;&#x7528;&#x573A;&#x666F;&#xFF1A;&#x5982;&#x679C;&#x5E93;&#x4E2D;&#x7684;&#x591A;&#x4E2A;&#x8868;&#x4E2D;&#x53EA;&#x6709;&#x67D0;&#x5F20;&#x8868;&#x6216;&#x8005;&#x5C11;&#x6570;&#x8868;&#x6570;&#x636E;&#x91CF;&#x8FC7;&#x5927;&#xFF0C;&#x90A3;&#x4E48;&#x53EA;&#x9700;&#x8981;&#x9488;&#x5BF9;&#x8FD9;&#x4E9B;&#x8868;&#x8FDB;&#x884C;&#x62C6;&#x5206;&#xFF0C;&#x5176;&#x4ED6;&#x8868;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;</p>
<p><strong>&#x53EA;&#x5206;&#x5E93;&#xFF1A;</strong></p>
<p>&#x5C06;db&#x5E93;&#x62C6;&#x5206;&#x4E3A;db_0&#x548C;db_1&#x4E24;&#x4E2A;&#x5E93;&#xFF0C;&#x540C;&#x65F6;&#x5728;db_0&#x548C;db_1&#x5E93;&#x4E2D;&#x5404;&#x81EA;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;user&#x8868;&#xFF0C;db_0.user&#x8868;&#x548C;db_1.user&#x8868;&#x4E2D;&#x5404;&#x81EA;&#x53EA;&#x5B58;&#x539F;&#x6765;&#x7684;db.user&#x8868;&#x4E2D;&#x7684;&#x90E8;&#x5206;&#x6570;&#x636E;&#x3002;</p>
<p><strong>&#x5206;&#x5E93;&#x5206;&#x8868;&#xFF1A;</strong></p>
<p>&#x5C06;db&#x5E93;&#x62C6;&#x5206;&#x4E3A;db_0&#x548C;db_1&#x4E24;&#x4E2A;&#x5E93;&#xFF0C;db_0&#x4E2D;&#x5305;&#x542B;user_0&#x3001;user_1&#x4E24;&#x4E2A;&#x5206;&#x8868;&#xFF0C;db_1&#x4E2D;&#x5305;&#x542B;user_2&#x3001;user_3&#x4E24;&#x4E2A;&#x5206;&#x8868;&#x3002;&#x4E0B;&#x56FE;&#x6F14;&#x793A;&#x4E86;&#x5728;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6570;&#x636E;&#x662F;&#x5982;&#x4F55;&#x62C6;&#x5206;&#x7684;&#xFF1A;&#x5047;&#x8BBE;db&#x5E93;&#x7684;user&#x8868;&#x4E2D;&#x539F;&#x6765;&#x6709;4000W&#x6761;&#x6570;&#x636E;&#xFF0C;&#x73B0;&#x5728;&#x5C06;db&#x5E93;&#x62C6;&#x5206;&#x4E3A;2&#x4E2A;&#x5206;&#x5E93;db_0&#x548C;db_1&#xFF0C;user&#x8868;&#x62C6;&#x5206;&#x4E3A;user_0&#x3001;user_1&#x3001;user_2&#x3001;user_3&#x56DB;&#x4E2A;&#x5206;&#x8868;&#xFF0C;&#x6BCF;&#x4E2A;&#x5206;&#x8868;&#x5B58;&#x50A8;1000W&#x6761;&#x6570;&#x636E;&#x3002;</p>
<p><img src="../assets/1028.png" alt=""></p>
<h4 id="131-&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x597D;&#x5904;">1.3.1 &#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x597D;&#x5904;</h4>
<p><strong>&#x5982;&#x679C;&#x8BF4;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x5B9E;&#x73B0;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x80FD;&#x529B;&#x7684;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#xFF0C;&#x90A3;&#x4E48;&#x5206;&#x5E93;&#x5206;&#x8868;&#x5C31;&#x662F;&#x5B9E;&#x73B0;&#x4E86;&#x5199;&#x80FD;&#x529B;&#x7684;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#x3002;</strong>  </p>
<ul>
<li>&#x5B58;&#x50A8;&#x80FD;&#x529B;&#x7684;&#x6C34;&#x5E73;&#x6269;&#x5C55;</li>
</ul>
<p>&#x5728;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;master&#x548C;slave&#x57FA;&#x672C;&#x4E0A;&#x6570;&#x636E;&#x662F;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x4ECE;&#x5B58;&#x50A8;&#x80FD;&#x529B;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x5B58;&#x5728;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x80FD;&#x7531;&#x4E8E;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x65E0;&#x6CD5;&#x5B58;&#x50A8;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x3002;&#x800C;&#x5728;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x642D;&#x5EFA;&#x591A;&#x4E2A;mysql&#x4E3B;&#x4ECE;&#x590D;&#x5236;&#x96C6;&#x7FA4;&#xFF0C;&#x6BCF;&#x4E2A;&#x96C6;&#x7FA4;&#x53EA;&#x5B58;&#x50A8;&#x90E8;&#x5206;&#x5206;&#x7247;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5B9E;&#x73B0;&#x5B58;&#x50A8;&#x80FD;&#x529B;&#x7684;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#x3002;</p>
<ul>
<li>&#x5199;&#x80FD;&#x529B;&#x7684;&#x6C34;&#x5E73;&#x6269;&#x5C55;</li>
</ul>
<p>&#x5728;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x96C6;&#x7FA4;&#x53EA;&#x6709;&#x4E00;&#x4E2A;master&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x538B;&#x529B;&#x90FD;&#x96C6;&#x4E2D;&#x5728;&#x8FD9;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x5728;&#x5199;&#x5165;&#x5E76;&#x53D1;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x91CC;&#x4F1A;&#x6210;&#x4E3A;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x74F6;&#x9888;&#x3002;</p>
<p>&#x800C;&#x5728;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x5206;&#x7247;&#x6240;&#x5C5E;&#x7684;&#x96C6;&#x7FA4;&#x90FD;&#x6709;&#x4E00;&#x4E2A;master&#x8282;&#x70B9;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#xFF0C;&#x5B9E;&#x73B0;&#x5199;&#x80FD;&#x529B;&#x7684;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#x3002;&#x6B64;&#x5916;&#x51CF;&#x5C0F;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x5F00;&#x9500;&#xFF0C;&#x964D;&#x4F4E;&#x5199;&#x64CD;&#x4F5C;&#x7684;&#x9501;&#x64CD;&#x4F5C;&#x8017;&#x65F6;&#x7B49;&#xFF0C;&#x90FD;&#x4F1A;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x663E;&#x7136;&#x7684;&#x597D;&#x5904;&#x3002; </p>
<h4 id="132-&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x6311;&#x6218;">1.3.2 &#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x6311;&#x6218;</h4>
<p>&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x6311;&#x6218;&#x4E3B;&#x8981;&#x4F53;&#x73B0;&#x5728;4&#x4E2A;&#x65B9;&#x9762;&#xFF1A;<strong>&#x57FA;&#x672C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x589E;&#x5220;&#x6539;&#x529F;&#x80FD;</strong>&#xFF0C;<strong>&#x5206;&#x5E03;&#x5F0F;id</strong>&#xFF0C;<strong>&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;</strong>&#xFF0C;<strong>&#x52A8;&#x6001;&#x6269;&#x5BB9;</strong>&#xFF0C;&#x4E0B;&#x9762;&#x9010;&#x4E00;&#x8FDB;&#x884C;&#x8BB2;&#x8FF0;&#x3002; </p>
<p><strong>&#x6311;&#x6218;1&#xFF1A;&#x57FA;&#x672C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x589E;&#x5220;&#x6539;&#x529F;&#x80FD;</strong>   </p>
<p>&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x800C;&#x8A00;&#xFF0C;&#x867D;&#x7136;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x8FD8;&#x662F;&#x5E0C;&#x671B;&#x80FD;&#x548C;&#x5355;&#x5E93;&#x5355;&#x8868;&#x90A3;&#x6837;&#x7684;&#x53BB;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x5E93;&#x3002;&#x4F8B;&#x5982;&#x6211;&#x4EEC;&#x8981;&#x6279;&#x91CF;&#x63D2;&#x5165;&#x56DB;&#x6761;&#x7528;&#x6237;&#x8BB0;&#x5F55;&#xFF0C;&#x5E76;&#x4E14;&#x5E0C;&#x671B;&#x6839;&#x636E;&#x7528;&#x6237;&#x7684;id&#x5B57;&#x6BB5;&#xFF0C;&#x786E;&#x5B9A;&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#x63D2;&#x5165;&#x54EA;&#x4E2A;&#x5E93;&#x7684;&#x54EA;&#x5F20;&#x8868;&#x3002;&#x4F8B;&#x5982;1&#x53F7;&#x8BB0;&#x5F55;&#x63D2;&#x5165;user1&#x8868;&#xFF0C;2&#x53F7;&#x8BB0;&#x5F55;&#x63D2;&#x5165;user2&#x8868;&#xFF0C;3&#x53F7;&#x8BB0;&#x5F55;&#x63D2;&#x5165;user3&#x8868;&#xFF0C;4&#x53F7;&#x8BB0;&#x5F55;&#x63D2;&#x5165;user0&#x8868;&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;sql&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> <span class="hljs-keyword">user</span>(<span class="hljs-keyword">id</span>,<span class="hljs-keyword">name</span>) <span class="hljs-keyword">values</span> (<span class="hljs-number">1</span>,&#x201D;tianshouzhi&#x201D;),(<span class="hljs-number">2</span>,&#x201D;huhuamin&#x201D;), (<span class="hljs-number">3</span>,&#x201D;wanghanao&#x201D;),(<span class="hljs-number">4</span>,&#x201D;luyang&#x201D;)
</code></pre>
<p>&#x8FD9;&#x6837;&#x7684;sql&#x660E;&#x663E;&#x662F;&#x65E0;&#x6CD5;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5BF9;&#x5E93;&#x548C;&#x8868;&#x8FDB;&#x884C;&#x4E86;&#x62C6;&#x5206;,&#x8FD9;&#x79CD;sql&#x8BED;&#x6CD5;&#x53EA;&#x80FD;&#x64CD;&#x4F5C;mysql&#x7684;&#x5355;&#x4E2A;&#x5E93;&#x548C;&#x5355;&#x4E2A;&#x8868;&#x3002;&#x6240;&#x4EE5;&#x5FC5;&#x987B;&#x5C06;sql&#x6539;&#x6210;4&#x6761;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF0C;&#x7136;&#x540E;&#x5206;&#x522B;&#x5230;&#x6BCF;&#x4E2A;&#x5E93;&#x4E0A;&#x53BB;&#x6267;&#x884C;&#x3002;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> user0(<span class="hljs-keyword">id</span>,<span class="hljs-keyword">name</span>) <span class="hljs-keyword">values</span> (<span class="hljs-number">4</span>,&#x201D;luyang&#x201D;)
<span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> user1(<span class="hljs-keyword">id</span>,<span class="hljs-keyword">name</span>) <span class="hljs-keyword">values</span> (<span class="hljs-number">1</span>,&#x201D;tianshouzhi&#x201D;)
<span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> user2(<span class="hljs-keyword">id</span>,<span class="hljs-keyword">name</span>) <span class="hljs-keyword">values</span> (<span class="hljs-number">2</span>,&#x201D;huhuamin&#x201D;)
<span class="hljs-keyword">insert</span> <span class="hljs-keyword">into</span> user3(<span class="hljs-keyword">id</span>,<span class="hljs-keyword">name</span>) <span class="hljs-keyword">values</span> (<span class="hljs-number">3</span>,&#x201D;wanghanao&#x201D;)
</code></pre>
<p>&#x5177;&#x4F53;&#x6D41;&#x7A0B;&#x53EF;&#x4EE5;&#x7528;&#x4E0B;&#x56FE;&#x8FDB;&#x884C;&#x63CF;&#x8FF0;&#xFF1A;</p>
<p><img src="../assets/1029.png" alt=""></p>
<p><strong>&#x89E3;&#x91CA;&#x5982;&#x4E0B;&#xFF1A;</strong></p>
<ol>
<li><strong>sql&#x89E3;&#x6790;&#xFF1A;</strong>&#x9996;&#x5148;&#x5BF9;sql&#x8FDB;&#x884C;&#x89E3;&#x6790;&#xFF0C;&#x5F97;&#x5230;&#x9700;&#x8981;&#x63D2;&#x5165;&#x7684;&#x56DB;&#x6761;&#x8BB0;&#x5F55;&#x7684;id&#x5B57;&#x6BB5;&#x7684;&#x503C;&#x5206;&#x522B;&#x4E3A;1,2,3,4</li>
<li><strong>sql&#x8DEF;&#x7531;&#xFF1A;</strong>sql&#x8DEF;&#x7531;&#x5305;&#x62EC;&#x5E93;&#x8DEF;&#x7531;&#x548C;&#x8868;&#x8DEF;&#x7531;&#x3002;&#x5E93;&#x8DEF;&#x7531;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#x5E94;&#x8BE5;&#x63D2;&#x5165;&#x54EA;&#x4E2A;&#x5E93;&#xFF0C;&#x8868;&#x8DEF;&#x7531;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#x5E94;&#x8BE5;&#x63D2;&#x5165;&#x54EA;&#x4E2A;&#x8868;&#x3002;</li>
<li><strong>sql&#x6539;&#x5199;&#xFF1A;</strong>&#x56E0;&#x4E3A;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x53EA;&#x80FD;&#x63D2;&#x5165;&#x5230;&#x4E00;&#x4E2A;&#x5E93;&#x4E2D;&#xFF0C;&#x800C;&#x4E0A;&#x8FF0;&#x6279;&#x91CF;&#x63D2;&#x5165;&#x7684;&#x8BED;&#x6CD5;&#x5C06;&#x4F1A;&#x5728; &#x6BCF;&#x4E2A;&#x5E93;&#x4E2D;&#x90FD;&#x63D2;&#x5165;&#x56DB;&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x660E;&#x663E;&#x662F;&#x4E0D;&#x5408;&#x9002;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5BF9;sql&#x8FDB;&#x884C;&#x6539;&#x5199;&#xFF0C;&#x6BCF;&#x4E2A;&#x5E93;&#x53EA;&#x63D2;&#x5165;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x3002;</li>
<li><strong>sql&#x6267;&#x884C;&#xFF1A;</strong>&#x4E00;&#x6761;sql&#x7ECF;&#x8FC7;&#x6539;&#x5199;&#x540E;&#x53D8;&#x6210;&#x4E86;&#x591A;&#x6761;sql&#xFF0C;&#x4E3A;&#x4E86;&#x63D0;&#x5347;&#x6548;&#x7387;&#x5E94;&#x8BE5;&#x5E76;&#x53D1;&#x7684;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5E93;&#x4E0A;&#x53BB;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6309;&#x7167;&#x987A;&#x5E8F;&#x9010;&#x4E00;&#x6267;&#x884C;</li>
<li><strong>&#x7ED3;&#x679C;&#x96C6;&#x5408;&#x5E76;&#xFF1A;</strong>&#x6BCF;&#x4E2A;sql&#x6267;&#x884C;&#x4E4B;&#x540E;&#xFF0C;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x7ED3;&#x679C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x7ED3;&#x679C;&#x96C6;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#xFF0C;&#x4ECE;&#x800C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7ED3;&#x679C;&#x3002;</li>
</ol>
<p><strong>&#x6311;&#x6218;2&#xFF1A;&#x5206;&#x5E03;&#x5F0F;id</strong></p>
<p>&#x5728;&#x5206;&#x5E93;&#x5206;&#x8868;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x518D;&#x4F7F;&#x7528;mysql&#x7684;&#x81EA;&#x589E;&#x4E3B;&#x952E;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x63D2;&#x5165;&#x8BB0;&#x5F55;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5E93;&#x751F;&#x6210;&#x7684;&#x8BB0;&#x5F55;&#x7684;&#x81EA;&#x589E;id&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x51B2;&#x7A81;&#x3002;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x7684;id&#x751F;&#x6210;&#x5668;&#x3002;&#x76EE;&#x524D;&#x5206;&#x5E03;&#x5F0F;id&#x6709;&#x5F88;&#x591A;&#x4E2D;&#x65B9;&#x6848;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x65B9;&#x6848;&#x662F;twitter&#x7684;snowflake&#x7B97;&#x6CD5;&#x3002;</p>
<p><strong>&#x6311;&#x6218;3&#xFF1A;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;</strong></p>
<p>&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x662F;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7ED5;&#x4E0D;&#x8FC7;&#x53BB;&#x7684;&#x4E00;&#x4E2A;&#x574E;&#xFF0C;&#x56E0;&#x4E3A;&#x6D89;&#x53CA;&#x5230;&#x4E86;&#x540C;&#x65F6;&#x66F4;&#x65B0;&#x591A;&#x4E2A;&#x5206;&#x7247;&#x6570;&#x636E;&#x3002;&#x4F8B;&#x5982;&#x4E0A;&#x9762;&#x7684;&#x6279;&#x91CF;&#x63D2;&#x5165;&#x8BB0;&#x5F55;&#x5230;&#x56DB;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5E93;&#xFF0C;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x8981;&#x4E48;&#x540C;&#x65F6;&#x6210;&#x529F;&#xFF0C;&#x8981;&#x4E48;&#x540C;&#x65F6;&#x5931;&#x8D25;&#x3002;&#x5173;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#xFF0C;mysql&#x652F;&#x6301;XA&#x4E8B;&#x52A1;&#xFF0C;&#x4F46;&#x662F;&#x6548;&#x7387;&#x8F83;&#x4F4E;&#x3002;&#x67D4;&#x6027;&#x4E8B;&#x52A1;&#x662F;&#x76EE;&#x524D;&#x6BD4;&#x8F83;&#x4E3B;&#x6D41;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x67D4;&#x6027;&#x4E8B;&#x52A1;&#x5305;&#x62EC;&#xFF1A;&#x6700;&#x5927;&#x52AA;&#x529B;&#x901A;&#x77E5;&#x578B;&#x3001;&#x53EF;&#x9760;&#x6D88;&#x606F;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x65B9;&#x6848;&#x4EE5;&#x53CA;TCC&#x4E24;&#x9636;&#x6BB5;&#x63D0;&#x4EA4;&#x3002;&#x4F46;&#x662F;&#x65E0;&#x8BBA;XA&#x4E8B;&#x52A1;&#x8FD8;&#x662F;&#x67D4;&#x6027;&#x4E8B;&#x52A1;&#xFF0C;&#x5B9E;&#x73B0;&#x8D77;&#x6765;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x3002;</p>
<p><strong>&#x6311;&#x6218;4&#xFF1A;&#x52A8;&#x6001;&#x6269;&#x5BB9;</strong></p>
<p>&#x52A8;&#x6001;&#x6269;&#x5BB9;&#x6307;&#x7684;&#x662F;&#x589E;&#x52A0;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x6570;&#x91CF;&#x3002;&#x4F8B;&#x5982;&#x539F;&#x6765;&#x7684;user&#x8868;&#x62C6;&#x5206;&#x5230;2&#x4E2A;&#x5E93;&#x7684;&#x56DB;&#x5F20;&#x8868;&#x4E0A;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5C06;&#x5206;&#x5E93;&#x7684;&#x6570;&#x91CF;&#x53D8;&#x4E3A;4&#x4E2A;&#xFF0C;&#x5206;&#x8868;&#x7684;&#x6570;&#x91CF;&#x53D8;&#x4E3A;8&#x4E2A;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4E00;&#x822C;&#x8981;&#x4F34;&#x968F;&#x7740;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x3002;&#x4F8B;&#x5982;&#x5728;4&#x5F20;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;id&#x4E3A;7&#x7684;&#x8BB0;&#x5F55;&#xFF0C;7%4=3&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#x4F4D;&#x4E8E;user3&#x8FD9;&#x5F20;&#x8868;&#x4E0A;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x5206;&#x8868;&#x7684;&#x6570;&#x91CF;&#x53D8;&#x4E3A;&#x4E86;8&#x4E2A;&#xFF0C;&#x800C;7%8=0&#xFF0C;&#x800C;user0&#x8FD9;&#x5F20;&#x8868;&#x4E0A;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;id=7&#x7684;&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x56E0;&#x6B64;&#x5982;&#x679C;&#x4E0D;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x8BB0;&#x5F55;&#x627E;&#x4E0D;&#x5230;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x672C;&#x6559;&#x7A0B;&#x540E;&#x9762;&#x5C06;&#x4F1A;&#x4ECB;&#x7ECD;&#x4E00;&#x79CD;&#x5728;&#x52A8;&#x6001;&#x6269;&#x5BB9;&#x65F6;&#x4E0D;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x7684;&#x65B9;&#x6848;&#x3002;</p>
<h2 id="2-&#x4E3B;&#x6D41;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;">2. &#x4E3B;&#x6D41;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;</h2>
<p>&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x4E3B;&#x8981;&#x4F5C;&#x7528;&#x662F;&#x5411;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C4F;&#x853D;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x548C;&#x5206;&#x5E93;&#x5206;&#x8868;&#x9762;&#x4E34;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x5E76;&#x9690;&#x85CF;&#x5E95;&#x5C42;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x4F7F;&#x5F97;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x50CF;&#x64CD;&#x4F5C;&#x5355;&#x5E93;&#x5355;&#x8868;&#x90A3;&#x6837;&#x53BB;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x3002;&#x5728;&#x4ECB;&#x7ECD;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x4E3B;&#x6D41;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x5728;&#x5355;&#x4E2A;&#x5E93;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5E94;&#x7528;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E0B;&#x56FE;&#x8FDB;&#x884C;&#x63CF;&#x8FF0;&#xFF1A;</p>
<p><img src="../assets/1030.png" alt=""></p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5728;&#x64CD;&#x4F5C;&#x5355;&#x5E93;&#x5355;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x76F4;&#x63A5;&#x5728;&#x5E94;&#x7528;&#x4E2D;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x8FDE;&#x63A5;&#x6C60;(connection pool)&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x8FDB;&#x884C;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#x3002; &#x800C;&#x5BF9;&#x4E8E;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x548C;&#x5206;&#x5E93;&#x5206;&#x8868;&#xFF0C;&#x5E94;&#x7528;&#x90FD;&#x8981;&#x64CD;&#x4F5C;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x4F8B;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x3002;</p>
<h3 id="21-&#x8BBE;&#x8BA1;&#x65B9;&#x6848;">2.1 &#x8BBE;&#x8BA1;&#x65B9;&#x6848;</h3>
<p>&#x5178;&#x578B;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;&#x6709;2&#x79CD;&#xFF1A;<strong>proxy</strong>&#x3001;<strong>smart-client</strong>&#x3002;&#x4E0B;&#x56FE;&#x6F14;&#x793A;&#x4E86;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6848;&#x7684;&#x67B6;&#x6784;&#xFF1A;</p>
<p><img src="../assets/1031.png" alt=""></p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E0D;&#x8BBA;&#x662F;proxy&#x8FD8;&#x662F;smart-client&#xFF0C;&#x5E95;&#x5C42;&#x90FD;&#x64CD;&#x4F5C;&#x4E86;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x4F8B;&#x3002;&#x4E0D;&#x8BBA;&#x662F;&#x5206;&#x5E93;&#x5206;&#x8868;&#xFF0C;&#x8FD8;&#x662F;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#xFF0C;&#x90FD;&#x662F;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x5C42;&#x9762;&#x5BF9;&#x4E1A;&#x52A1;&#x5F00;&#x53D1;&#x540C;&#x5B66;&#x8FDB;&#x884C;&#x5C4F;&#x853D;&#x3002;</p>
<h4 id="211-proxy&#x6A21;&#x5F0F;">2.1.1 proxy&#x6A21;&#x5F0F;</h4>
<p>&#x6211;&#x4EEC;&#x72EC;&#x7ACB;&#x90E8;&#x7F72;&#x4E00;&#x4E2A;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x80CC;&#x540E;&#x7BA1;&#x7406;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x4F8B;&#x3002;&#x800C;&#x5728;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x6570;&#x636E;&#x6E90;(c3p0&#x3001;druid&#x3001;dbcp&#x7B49;)&#x4E0E;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x6240;&#x6709;&#x7684;sql&#x64CD;&#x4F5C;&#x8BED;&#x53E5;&#x90FD;&#x662F;&#x53D1;&#x9001;&#x7ED9;&#x8FD9;&#x4E2A;&#x4EE3;&#x7406;&#xFF0C;&#x7531;&#x8FD9;&#x4E2A;&#x4EE3;&#x7406;&#x53BB;&#x64CD;&#x4F5C;&#x5E95;&#x5C42;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5F97;&#x5230;&#x7ED3;&#x679C;&#x5E76;&#x8FD4;&#x56DE;&#x7ED9;&#x5E94;&#x7528;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x65B9;&#x6848;&#x4E0B;&#xFF0C;&#x5206;&#x5E93;&#x5206;&#x8868;&#x548C;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x7684;&#x903B;&#x8F91;&#x5BF9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x662F;&#x5B8C;&#x5168;&#x900F;&#x660E;&#x7684;&#x3002;</p>
<p><strong>&#x4F18;&#x70B9;&#xFF1A;</strong></p>
<p>1 &#x591A;&#x8BED;&#x8A00;&#x652F;&#x6301;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E0D;&#x8BBA;&#x4F60;&#x7528;&#x7684;php&#x3001;java&#x6216;&#x662F;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x3002;&#x4EE5;mysql&#x6570;&#x636E;&#x5E93;&#x4E3A;&#x4F8B;&#xFF0C;&#x5982;&#x679C;proxy&#x672C;&#x8EAB;&#x5B9E;&#x73B0;&#x4E86;mysql&#x7684;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x5C31;&#x5C06;&#x5176;&#x770B;&#x6210;&#x4E00;&#x4E2A;mysql &#x670D;&#x52A1;&#x5668;&#x3002;mysql&#x5B98;&#x65B9;&#x56E2;&#x961F;&#x4E3A;&#x4E0D;&#x540C;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5374;&#x52A8;&#xFF0C;&#x5982;java&#x8BED;&#x8A00;&#x7684;mysql-connector-java&#xFF0C;python&#x8BED;&#x8A00;&#x7684;mysql-connector-python&#x7B49;&#x7B49;&#x3002;&#x56E0;&#x6B64;&#x4E0D;&#x540C;&#x8BED;&#x8A00;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;mysql&#x5B98;&#x65B9;&#x63D0;&#x4F9B;&#x7684;&#x5BF9;&#x5E94;&#x7684;&#x9A71;&#x52A8;&#x6765;&#x4E0E;&#x8FD9;&#x4E2A;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x5EFA;&#x901A;&#x4FE1;&#x3002;</p>
<p>2 &#x5BF9;&#x4E1A;&#x52A1;&#x5F00;&#x53D1;&#x540C;&#x5B66;&#x900F;&#x660E;&#x3002;&#x7531;&#x4E8E;&#x53EF;&#x4EE5;&#x628A;proxy&#x5F53;&#x6210;mysql&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x4E1A;&#x52A1;&#x540C;&#x5B66;&#x4E0D;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x592A;&#x591A;&#x4EE3;&#x7801;&#x6539;&#x9020;&#xFF0C;&#x65E2;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x63A5;&#x5165;&#x3002;</p>
<p><strong>&#x7F3A;&#x70B9;&#xFF1A;</strong></p>
<p>1 &#x5B9E;&#x73B0;&#x590D;&#x6742;&#x3002;&#x56E0;&#x4E3A;proxy&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x88AB;&#x4EE3;&#x7406;&#x7684;&#x6570;&#x636E;&#x5E93;server&#x7AEF;&#x7684;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#xFF0C;&#x5B9E;&#x73B0;&#x96BE;&#x5EA6;&#x8F83;&#x5927;&#x3002;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E00;&#x4E9B;proxy&#x6A21;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x53EA;&#x80FD;&#x4EE3;&#x7406;&#x67D0;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5982;mysql&#x3002;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x4EE3;&#x7406;&#x591A;&#x79CD;&#x6570;&#x636E;&#x5E93;(sqlserver&#x3001;PostgreSQL&#x3001;Oracle)&#x3002;</p>
<p>2 proxy&#x672C;&#x8EAB;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x9AD8;&#x53EF;&#x7528;&#x3002;&#x7531;&#x4E8E;&#x5E94;&#x7528;&#x672C;&#x6765;&#x662F;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x73B0;&#x5728;&#x6539;&#x6210;&#x4E86;&#x8BBF;&#x95EE;proxy&#xFF0C;&#x610F;&#x5473;&#x7740;proxy&#x5FC5;&#x987B;&#x4FDD;&#x8BC1;&#x9AD8;&#x53EF;&#x7528;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x6CA1;&#x6709;&#x5B95;&#x673A;&#xFF0C;proxy&#x6302;&#x4E86;&#xFF0C;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x5E93;&#x65E0;&#x6CD5;&#x6B63;&#x5E38;&#x8BBF;&#x95EE;&#xFF0C;&#x5C31;&#x5C34;&#x5C2C;&#x4E86;&#x3002; </p>
<p>3 &#x79DF;&#x6237;&#x9694;&#x79BB;&#x3002;&#x53EF;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x8BBF;&#x95EE;proxy&#x4EE3;&#x7406;&#x7684;&#x5E95;&#x5C42;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5FC5;&#x7136;&#x4F1A;&#x5BF9;proxy&#x81EA;&#x8EAB;&#x7684;&#x5185;&#x5B58;&#x3001;&#x7F51;&#x7EDC;&#x3001;cpu&#x7B49;&#x4EA7;&#x751F;&#x8D44;&#x6E90;&#x7ADE;&#x4E89;&#xFF0C;proxy&#x9700;&#x8981;&#x9700;&#x8981;&#x5177;&#x5907;&#x9694;&#x79BB;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<h4 id="212-smart-client&#x6A21;&#x5F0F;">2.1.2 smart-client&#x6A21;&#x5F0F;</h4>
<p>&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x6539;&#x9020;&#xFF0C;<span class="pg-emphasize pg-emphasize-green" style=""> &#x5F15;&#x5165;&#x652F;&#x6301;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x6216;&#x8005;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x529F;&#x80FD;&#x7684;sdk </span>&#xFF0C;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;smart-client&#x3002;&#x901A;&#x5E38;smart-client&#x662F;&#x5728;&#x8FDE;&#x63A5;&#x6C60;&#x6216;&#x8005;driver&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x5C42;&#x5C01;&#x88C5;&#xFF0C;smart-client&#x5185;&#x90E8;&#x4E0E;&#x4E0D;&#x540C;&#x7684;&#x5E93;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EA7;&#x751F;&#x7684;sql&#x4EA4;&#x7ED9;smart-client&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x5176;&#x5185;&#x90E8;&#x5BF9;sql&#x8FDB;&#x884C;&#x5FC5;&#x8981;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9009;&#x62E9;&#x8D70;&#x4ECE;&#x5E93;&#x8FD8;&#x662F;&#x4E3B;&#x5E93;&#xFF1B;&#x5728;&#x5206;&#x5E93;&#x5206;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FDB;&#x884C;sql&#x89E3;&#x6790;&#x3001;sql&#x6539;&#x5199;&#x7B49;&#x64CD;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x8DEF;&#x7531;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x5E93;&#xFF0C;&#x5C06;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#xFF0C;&#x8FD4;&#x56DE;&#x7ED9;&#x5E94;&#x7528;&#x3002;</p>
<p><strong>&#x4F18;&#x70B9;&#xFF1A;</strong></p>
<p>1 &#x5B9E;&#x73B0;&#x7B80;&#x5355;&#x3002;proxy&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x5E93;&#x7684;&#x670D;&#x52A1;&#x7AEF;&#x534F;&#x8BAE;&#xFF0C;&#x4F46;&#x662F;smart-client&#x4E0D;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x5BA2;&#x6237;&#x7AEF;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#x3002;&#x539F;&#x56E0;&#x5728;&#x4E8E;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x636E;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5546;&#x5DF2;&#x7ECF;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;&#x76F8;&#x5E94;&#x7684;&#x6570;&#x636E;&#x5E93;&#x9A71;&#x52A8;driver&#xFF0C;&#x4F8B;&#x5982;mysql&#x9488;&#x5BF9;java&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;mysql-connector-java&#x9A71;&#x52A8;&#xFF0C;&#x9488;&#x5BF9;python&#x63D0;&#x4F9B;&#x4E86;mysql-connector-python&#x9A71;&#x52A8;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#x5DF2;&#x7ECF;&#x5728;driver&#x5C42;&#x9762;&#x505A;&#x8FC7;&#x4E86;&#x3002;&#x56E0;&#x6B64;smart-client&#x6A21;&#x5F0F;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x901A;&#x5E38;&#x53EA;&#x9700;&#x8981;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x8FDB;&#x884C;&#x5C01;&#x88C5;&#x5373;&#x53EF;&#x3002;</p>
<p>2 &#x5929;&#x7136;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x3002;smart-client&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x7531;&#x4E8E;&#x672C;&#x8EAB;&#x4EE5;sdk&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x88AB;&#x5E94;&#x7528;&#x76F4;&#x63A5;&#x5F15;&#x5165;&#xFF0C;&#x968F;&#x7740;&#x5E94;&#x7528;&#x90E8;&#x7F72;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x4E14;&#x76F4;&#x8FDE;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4E2D;&#x95F4;&#x4E0D;&#x9700;&#x8981;&#x6709;&#x4EE3;&#x7406;&#x5C42;&#x3002;&#x56E0;&#x6B64;&#x76F8;&#x8F83;&#x4E8E;proxy&#x800C;&#x8A00;&#xFF0C;&#x9664;&#x4E86;&#x7F51;&#x7EDC;&#x8D44;&#x6E90;&#x4E4B;&#x5916;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x4E0D;&#x5B58;&#x5728;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x8D44;&#x6E90;&#x7684;&#x7ADE;&#x4E89;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x9AD8;&#x53EF;&#x7528;&#x7684;&#x95EE;&#x9898;&#x3002;&#x53EA;&#x8981;&#x5E94;&#x7528;&#x7684;&#x8282;&#x70B9;&#x6CA1;&#x6709;&#x5168;&#x90E8;&#x5B95;&#x673A;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#x3002;(&#x8FD9;&#x91CC;&#x7684;&#x9AD8;&#x53EF;&#x7528;&#x662F;&#x76F8;&#x6BD4;proxy&#x800C;&#x8A00;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x672C;&#x8EAB;&#x7684;&#x9AD8;&#x53EF;&#x7528;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x7684;)</p>
<p><strong>&#x7F3A;&#x70B9;&#xFF1A;</strong></p>
<p>1 &#x901A;&#x5E38;&#x4EC5;&#x652F;&#x6301;&#x67D0;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x3002;&#x4F8B;&#x5982;tddl&#x3001;zebra&#x3001;sharding-jdbc&#x90FD;&#x662F;&#x4F7F;&#x7528;java&#x8BED;&#x8A00;&#x5F00;&#x53D1;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x5C31;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x4E2D;&#x95F4;&#x4EF6;&#x3002;&#x5982;&#x679C;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x8981;&#x4F7F;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x5F00;&#x53D1;&#x591A;&#x8BED;&#x8A00;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</p>
<p>2 &#x7248;&#x672C;&#x5347;&#x7EA7;&#x56F0;&#x96BE;&#x3002;&#x56E0;&#x4E3A;&#x5E94;&#x7528;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x6E90;&#x4EE3;&#x7406;&#x5C31;&#x662F;&#x5F15;&#x5165;&#x4E00;&#x4E2A;jar&#x5305;&#x7684;&#x4F9D;&#x8D56;&#xFF0C;&#x5728;&#x6709;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x90FD;&#x5BF9;&#x67D0;&#x4E2A;&#x7248;&#x672C;&#x7684;jar&#x5305;&#x4EA7;&#x751F;&#x4F9D;&#x8D56;&#x65F6;&#xFF0C;&#x4E00;&#x65E6;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x6709;bug&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5E94;&#x7528;&#x90FD;&#x9700;&#x8981;&#x5347;&#x7EA7;&#x3002;&#x800C;&#x6570;&#x636E;&#x5E93;&#x4EE3;&#x7406;&#x5347;&#x7EA7;&#x5219;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#xFF0C;&#x56E0;&#x4E3A;&#x670D;&#x52A1;&#x662F;&#x5355;&#x72EC;&#x90E8;&#x7F72;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x5347;&#x7EA7;&#x8FD9;&#x4E2A;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6240;&#x6709;&#x8FDE;&#x63A5;&#x5230;&#x8FD9;&#x4E2A;&#x4EE3;&#x7406;&#x7684;&#x5E94;&#x7528;&#x81EA;&#x7136;&#x4E5F;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x90FD;&#x5347;&#x7EA7;&#x4E86;&#x3002;</p>
<h3 id="22-&#x4E1A;&#x754C;&#x4EA7;&#x54C1;">2.2 &#x4E1A;&#x754C;&#x4EA7;&#x54C1;</h3>
<p>&#x65E0;&#x8BBA;&#x662F;proxy&#xFF0C;&#x8FD8;&#x662F;smart-client&#xFF0C;&#x4E8C;&#x8005;&#x7684;&#x4F5C;&#x7528;&#x90FD;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#x3002;&#x4EE5;&#x4E0B;&#x5217;&#x51FA;&#x4E86;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6848;&#x76EE;&#x524D;&#x5DF2;&#x6709;&#x7684;&#x5B9E;&#x73B0;&#x4EE5;&#x53CA;&#x5404;&#x81EA;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#xFF1A;</p>
<p><img src="../assets/1032.png" alt=""></p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; wu_mingsheng@126.com 2017 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x4EF6;&#x6700;&#x540E;&#x4FEE;&#x6539;&#x65F6;&#x95F4;&#xFF1A;
2019-12-05 18:20:04
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="002.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 一文读懂分库分表的技术演进（最佳实践）">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"数据库中间件详解 | 珍藏版","level":"1.1.3","depth":2,"previous":{"title":"一文读懂分库分表的技术演进（最佳实践）","level":"1.1.2","depth":2,"path":"part-db-table/002.md","ref":"part-db-table/002.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["-lunr","-search","search-pro","theme-comscore","chapter-fold","splitter","tbfed-pagefooter","code","page-toc-button","popup","back-to-top-button","emphasize"],"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy wu_mingsheng@126.com 2017","modify_label":"该文件最后修改时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"emphasize":{},"splitter":{},"search-pro":{},"popup":{},"code":{"copyButtons":true},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"theme-comscore":{},"page-toc-button":{"maxTocDepth":2,"minTocSize":2},"back-to-top-button":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"part-db-table/003.md","mtime":"2019-12-05T10:20:04.226Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-12-05T10:24:12.600Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

